[{"text":"Lebih suka mobile legend yang dulu gak ada mode chat tapi sekarang semenjak dikasih fitur chat banyak player kebanyakan bacot udah gitu kebanyakan player tonixnya buat apa main game banyak player tonix mending pindah game aja lah mending di game sebelah player tonix gak ada lebih nyaman mainnya kalo gak ada player tonix,","sentiment":"negatif","predict":"negatif"},{"text":"Para develomer mungkin merasa hebat atas kerja mereka yang sering meng-Update ntah itu Update Versi, Revam Hero, Eblem, tampilan UI mereka merasa hebat dan merasa ML itu semakin bagus setelah setelah dirobah menurut kepintaran mereka sendiri. Namun Motoon tidak menyadari dengan adanya hal seperti itu MLBB sekarang sudah sangat buruk baik dari Matcmaking, System yang kacau, Koneksi, perlawanan 5v5 yang tidak seimbang. Apakah Montoon sudah Meninggal? atau karna sudah kaya jadi banyak masa bodoh?","sentiment":"netral","predict":"netral"},{"text":"Ni monton pikiran nya gimana sih, makin kesini makin aneh , setelah sisen baru ini , yang emblem nya ga masok akal , tambah lagi sinyal bagus malah lag kocak lu monton , disini gua dan teman gua kecewa , dan temen gua banyak pensi karna sisen baru yang gak masuk akal ini , saran gua bagus yang dulu lagi dari pada yang sekarang aneh tau gak dan sisen ini boros sama ruangan , pikirkan yang hobi tapi hp nya ram 2 GK bisa main karna sisen ga jelas ini","sentiment":"positif","predict":"negatif"},{"text":"Game nya bagus skin banyak hero banyak apalagi ini game seru tapi masalahnya juga banyak. Mulai dari lag padahal jaringan teman bagus, matching gak seimbang, kalau mau naik di kasih musuh pro kalau mau kalah dikasih bot. Banyak bug, cheater,kalo main party sering ketemu penjoki kalo gak pro player.apalagi setiap main selalu data nambah punya aku udah 6gb masih juga update Sekian dari saya terimakasih semoga cepet di fix","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa saya kasih bintang 1? Karena saya kalau main rank dapat tim yg ga bisa main sedangkan dpt tim pro player susah banget nnti klo udh sering dpt tim pro sya ksh bintang 5 deh","sentiment":"negatif","predict":"negatif"},{"text":"Setiap update patch yg dilakukan selalu memberikan ketidak nyamanan dalam bermain..pembagian team match yg tdk seimbang dan pengaturan emblem yg baru malah membuat permainan jadi tdk menarik sebab terlalu rumit dan pengaturan tdk sesuai yg diinginkan oleh setiap pemain ...mobile legend sangat tdk fair dan tdk bagus dlm setiap update terbarunya sebab banyak merugikan para player dan anda tdk mempertimbangkan kenyamanan para player ..sangat buruk","sentiment":"positif","predict":"netral"},{"text":"Perbaiki analog nya , maju maju sendiri sama penaggetar nya besic attak udah berhenti hero masih maju maju aja. Dan masalah jaringan kalo game ini harus ada jaringan khusus mending gak usah di publik buat orang\" tertentu aja yg main. Game babi relog ingame gak masuk\" nunggu kalah baru masuk babi","sentiment":"negatif","predict":"negatif"},{"text":"Ohh ya satu lagi masalah dark system' aneh bgt gw winstreak lebih dari 3x pas main langsung dikasih tim noob apa² an gitu tim gak bisa maen tapi musuh jago² bagus kek gitu? Lama² kalo ini dibiarin player pada pensi ml ayolah moonton udahlah game p2w ini lagi drag system' nanti player nya pensi semua baru tau tuh bangkrut perusahaan lu kalo gak dibenerin masalah ini gw gak bakalan naikin rating mlbb ok😤😤","sentiment":"negatif","predict":"negatif"},{"text":"Makin di update bukannya bagus malah tambah parah sistem Lo nton,coba deh lu bikin sistem yang ngotak dikit biar kita ngk setres kalau main , sekarang tiba tiba ping tinggi habis tu udh dikil musuh normal lagi maksud Lo apaan anjg.gue udh beberapa kali kena drak sistem Lo ,Lo kalau game nya mau maju perbaiki sistem Lo nton. Jangan update terus tpi sistem tetep rusak ,tolong tanggapi.","sentiment":"negatif","predict":"negatif"},{"text":"Plislah kasi tim yang seimbang udh 1 bulan naik turun naik turun loh padahal sisa satu bintang lagi ke mythic, tolong berikan matchmaking yang seimbang, timnya yang bisa main jangan yang kayak bot.","sentiment":"positif","predict":"negatif"},{"text":"Kalau bisa pihak moonton meringankan atau mengurangi data resource atau di pisahkan data data tersebut sebab kami para pengguna android ram 3gb ke bawah sudah tidak mampu menampung semua data tersebut. Bahkan ada di antara beberapa hape yang tidak bisa menginstal apk ini setelah up date terimakasih!!!","sentiment":"netral","predict":"netral"},{"text":"Setelah d update bukan nya membaik malah memburuk, lagi main di game tiba2 ke restar sendiri mana menghubungkan lagi ke dalam game sangat lama padahal dalam kondisi jaringan yang bagus dan kouta yg masih banyak, hingga menyebabkan AFK dan dan mendapatkan hukuman, padahal moonton nya sendiri yang Error.","sentiment":"negatif","predict":"negatif"},{"text":"Sistim moonton memang para masa kalo mau so harus di kasih tim yang gak imbang misalnya rank yang berbeda di mode solo rank teman saya renda sedangkan rank musunya tinggi sekali.. Makanya kita selalu kalah di mode solo.. Sengdangkang 79% di ml pengguna solo. Makanya bayak yang hapus data itu di ml pengguna solo.. Masa kita setiap hari main harus tunggu atau cari teman main kita gak mungkin karana setiap orang ada kesibukan masing2 atah itu dia sekola apa kerja kan ada kesibuka masing2","sentiment":"negatif","predict":"negatif"},{"text":"Kalo bikin sinergy BM atau mage yang ngotak lah.. Masa wawan s3 full item, full blood dan full sinergy, kalah sama kagura s1 cuman sekali ulti, baru beberapa detik pertandingan dimulai.","sentiment":"positif","predict":"positif"},{"text":"Saya sarankan jangan Dwonlod aplikasi ini, aplikasi ini cuman membuang memori dan waktu kalian doang, soalnya ini game sudah cacat sepenuhnya dari pembagian tim sampe servernya pun ga bener. Pokoknya jangan Dwonlod anime cacat ini","sentiment":"negatif","predict":"negatif"},{"text":"Saya sudah mendownload ml sudah lama . Trus semua faild sudah saya download kenapa saya di suruh download lagi sedangkan saya tidak pernah mereses faild tolong di perbaiki bab Nya kadang jg tiba tiba bhs dan tulisan berubah sendiri jadi bhs chinah dana tulisan china","sentiment":"netral","predict":"netral"},{"text":"Kenapa di kasi bintang 1 .karna pemain tidak di buat nyaman masa setiap main pas lagi asiknya jaringan pink nya merah gak stabil payah.. bukan 1x ,tapi tiap main pasti gitu terus ....","sentiment":"positif","predict":"positif"},{"text":"Maaf saya turunin bintang nya,karena setiap kali main pasti jaringan nya selalu nge lag.kadang klo sering menang di setiap game nya pasti pas lanjutnya sinyal ya lsg jadi merah. Padahal kalau buka aplikasi game lain g ada masalah,g ada nge lag nya","sentiment":"negatif","predict":"negatif"},{"text":"Makin banyak bug _-- ,, koneksi terganggu mulu padahal koneksi internet bagus sama data terus di upgrade makin sini bukanya makin enak main malah makin berat","sentiment":"positif","predict":"positif"},{"text":"Enak enak main malah menghubungkan ulang satu tim..musuh juga menghubungkan ulang..gimana sih..tolong bug nya diperbaiki...jaringan baik baik aj padahal","sentiment":"positif","predict":"positif"},{"text":"Sorry bintang 1, karena update terbaru pada item attack agak mengecewakan has claw bagus efek yang dulu dari pada yg update sekarang, dan lebih unggul Scarlett phantom dari pada item terbaru yg sekarang ini. Karena efeknya sangat jauh bener² beda, sungguh mengecewakan sangat² kecewa berat gua dengan anda pihak moonton. Kalo spek grafik udah bagus, jaringan masih 7\/10 nilai dari gua, gua kecewa cuma dari item lama menghilang dan digantikan dengan item terbaru, semoga di jawab dan segera di urus","sentiment":"negatif","predict":"netral"},{"text":"Tidak ada game yg menyerukan selain game ini, mobile legend bangbang. Kurang lebih sudah 5 tahun saya memainkan nya, hanya saja belakangan ini mengapa jaringan suka tiba2 merah dan bikin Hero gabisa gerak, seolah jadi kaya org lgi bljar Hero, kebanyakan update cuman buat data hp ku jadi penuh, apalagi android evercoos ram3\/32 hadeh, pdhal dulu hp Andro biasa ram di bawah 2 aj maen gada kendala seperti lag2 gajelas, sering patah2, membuat org yg memainkan bukan nya happy justru malah bikin emosi.","sentiment":"netral","predict":"negatif"},{"text":"mobile legends sekarang banyak bug nya, mulai dari sinyal jumping terus delay padahal sinyal bagus dan banyak lagi. Tolong perhatikan bug² kecil dan match making nya","sentiment":"netral","predict":"netral"},{"text":"kali ini bener\" kecewa lagi, 4x dipertengahan game selalu losse koneksi hingga tidak bisa masuk ke dlm game lg alhasil afk otomatis..kenapa ini moonton? saya sdh telfon provider katanya server mereka aman,,gimana ini solusinya?","sentiment":"negatif","predict":"negatif"},{"text":"Semakin update semakin gajelas... matcmakingnya makin rusak... Dapet musuh orang gila semua giliran se team kek beneran bot, sering banget lose. Win hanya sekali lose berjuta\" kali. Minimal kalo lagi losestreak 2 kali pas mo main lagi game 3 kasihlah musuh bot 2 ato 3 kali biar GK nyesek\" amat main nih game. Lama\" player stress berat gara\" main game ini. Tolong kesadarannya ya moonton🙏","sentiment":"negatif","predict":"negatif"},{"text":"Game tolol jaringan gw lancar malah di bilang ngelag. Ketika gw main di game saat gw keluar sebentar abis itu gw kembali malah ngelag jaringan tolong diperbaiki biar game lu gak jadi tolol dan sampah","sentiment":"negatif","predict":"negatif"},{"text":"Ajing lah coba di kasih tim tuh ya bener Napa ada aja pasti yang afk ngtroll bhut Mapl asal main kalo di clsikk gpp ini rnk coba tuh di kasih tim ya bener .kalo main squat pasti ketemuya mytih legenda ini baru turun season dah Ketu gituan ...ya wajar lah mukin player jarang top up mana pernah di perhatiin..coba gitu di kasih tim ya bener moga moga di perbaiki ....ngk asik lagi drak pic yah🥲.kaga seimbang sama sekali ..udah kaga asik nih mobile legenda.sekian makasih","sentiment":"positif","predict":"positif"},{"text":"Kenapa tiap update sinyal selalu menjadi masalah?apakah wifi\/ data saya jelek oh mana mungkin! wifi\/data saya sudah maksimal 10ms kenapa tidaa dapat masuk ke match?","sentiment":"netral","predict":"netral"},{"text":"Saran saya sih makin kesini makin aneh ,salut gue sama moonton menang sekali abis tu di musuh nya pada jago team gue bego bego , mending versi dulu daripada yang sekarang meskipun gak sebagus sekarang grafik nya tapi normal musuh nya dan team nya seimbang daripada sekarang grafik bagus tapi ga seimbang, maap saya hapus game nya di hp saya ngundur\" waktu ga jelas. Makasih","sentiment":"negatif","predict":"negatif"},{"text":"Moonton tolong di perbaiki ini saya kalo mau login pake kuota sendiri servernya g mau konek,,harus di ulang 2 sampe 3x buat bisa login,itu ngeselin banget sih,,sama di update terbaru patch ixia pas draf pick di 10 detik terakhir tiba tiba lag dan ke skip","sentiment":"netral","predict":"negatif"},{"text":"Matchmaking nya lebih baik berdasarkan kemampuan dan tier player,, sering kena lostreak sama tim yang bermain buruk..","sentiment":"netral","predict":"netral"},{"text":"Woiiii monton, kalau ngasih tim itu yg baguslah, percuma main 4 jam nggak ada hasil yg puas, kalah 4x, menang 4, apa namanya ituu, kalau gini terus saya cukup kecewa, jelas!","sentiment":"positif","predict":"positif"},{"text":"Kok ml sekarang banyak bug nya ya kek ga bisa masuk mode yang satu land itu loh pas udah pencet masuk yang lainya juga kok ga bisa masuk ke pertandinganya sih sama lag parah padahal sinyal lancar lancar aj sama sering stuck loading","sentiment":"netral","predict":"netral"},{"text":"Mohon maaf sebelumnya izin, buat sistem penyeimbangan matchmaking tolong di perbaiki jangan menyeimbangkan matchmaking melewati win rate lihat lah gameplay sama kan lah tim yang setara dengan musuh agar menjadi lebih seru di match nya tolong di seimbang kan saya bermain bbrpa match saya selalu mendapatkan tim yang egois bermain dengan performa yang rendah melakukan feed dengan sengaja mohon untuk pihak monton agar di seimbangkan matchmaking nya, masa win rate kecil jago trs di kasi tim yang bott","sentiment":"positif","predict":"negatif"},{"text":"Tidak layak, karna masih banyak yang harus di perbaiki, seperti mode chees yang sangat tidak bagus, banyak skill skill yang aneh.. di mode MC-nya wanwan di pojokan saat ulti tidak kena kepada musuh!! Bisa di benerin gak?!!! Rusak x gamenya lama-lama !!!! Bisa gak kalau orang dah 10x lostreak itu jgn di kasih yang 10x lostreak juga timnya !","sentiment":"netral","predict":"netral"},{"text":"Game nya bagus event eventnya juga gak monoton..Tapi yg jadi masalah DARK SYSTEM MOONTOT itu loh.., lebih sering ketemu tim ampas kalo di rank..gak pernah seimbang.. SERING KENE TROLL MULU !!!! ASEMMMMMMMMM!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Setiap Main Dapat tim nya bot terus,kalau sesekali nggak papa, ini hampir semua Pertandingan dapat tim nya ngk jelas banget,kasihan player solo, seperti saya main solo","sentiment":"positif","predict":"positif"},{"text":"Uninstall sajalah tidak bisa di main kan juga. Game cacat suka keluar sendiri kadang hilang suara kadang jadi patung.kadang susah masuk main lagi. Padahal main game pubg yang lebih besar dari mlbb. Aman2 saja device, provider dan tempat yang sama. Game cacat","sentiment":"negatif","predict":"negatif"},{"text":"Game bagus, tapi kenapa ya? Sistem matchmaking nya ga adil,masa tim gw isinya orang orang yg ga bisa main sedangkan tim lawan tim lawan orang nya pada jago, capek gw dapet tim kek gitu setiap hari dapet MVP tapi kalah,tolong perbaiki sistem matchmaking nya","sentiment":"negatif","predict":"negatif"},{"text":"Maaf ini terjadi lagi. Mohon di perbaiki. Saat mau masuk mode macking kenapa jaringan terputus sendiri. Katanya suruh hubungi customer servis.. pdhl kuota game masih ada. Mohon di perbaiki. Supaya tidak beralih ke game lain. Terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Untuk grafik nya bagus game nya juga bagus tpi buat keseimbangan tim nya sangat buruk tolong di perbaiki, trus hampir setiap saya mau naik ke pamgkag selanjut nya di kasih tim yang ga bisa main sedangkan lawan pro tolong di perbaiki lagi:(","sentiment":"negatif","predict":"negatif"},{"text":"Game nya lumayan seru, tapi gara gara jaringan nya ngeleg jadi gak terlalu seru, ini saya lagi updatenya saja sangat lama, sangat lelet, padahal saya baru beli kuota, dan data yang sudah saya download malah disuruh download ulang, tapi data ml saya udah 3 GB tersimpan. Tolong Moonton perbaikan sinyalnya!!!!!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Apaansih, sering bgt kejadian gabisa masuk ke pertandingan padahal jaringan bagus aja tapi pas loding screennya gabisa masuk masuk dan timnya juga gak seimbang katanya diseimbangin tapi apa ini banyak player yg mengalami pertandingan yang tidak seimbang tolong diperbaiki moonton","sentiment":"netral","predict":"netral"},{"text":"Knapa performa moba menurun , lebih sering crash , lag dan lain sebagainya . Walaupun jaringan wifi dan data bagus masih aja tetap sama , bahkan hp kpasitas 6gb aja gak memadai","sentiment":"netral","predict":"netral"},{"text":"Saat main pertarungan tiba tiba pertengahan permainan mulai muncul BUG dan saat itu juga ping 250 padahal jaringan 4G aman tapi main ml terasa tidak enak lagi mungkin kah sudah banyak pemain menggunakan cheat buat bug dan lain lain, tolong Di banned aja pemain yang pakai cheat sangat mengganggu","sentiment":"positif","predict":"positif"},{"text":"Abis di update makin parah dapet tim nya pada buta maps, ga bisa main , dan sering terjadi masalah jaringan padahal jaringan wifi nya bagus, ga kaya AOV","sentiment":"positif","predict":"negatif"},{"text":"Game sampah!, woy monton kalo kasih tim tuh yang seimbang lah, bukan malan dapet musuh jago jago, tim sendiri dapet nya gblk semua, tau diri lah woy ini game sebelumnya udah dikasih bintang 5 malah dibales gini, gajelas ini game, ga seimbang lawan ama tim, game ny juga menang kalah menang kalah, udah gitu aja terus, dasar monton ngasih darkSystem huuu, ngasih match tuh yg seimbang LOL !","sentiment":"negatif","predict":"negatif"},{"text":"Untuk grafiknya bagus, tapi awalnya kukira matchmaking bakal seimbang terus ehh... ternyata lama kelamaan tim kita bodoh dan musuh pada jago-jago. Bikin males maen gamenya, bukannya naek rank malah ngestuck trus sampe 2 season. Mohon untuk matchmaking lebih diseimbangkan lagi!!! Sama yang awalnya 2gb data udah bisa liat emote, sekarang malah harus download full data dulu baru bisa ganti emote. Entah sama game ini, gak jelas.","sentiment":"negatif","predict":"negatif"},{"text":"Game lemot tapi sekali nya loading gara2 jaringan jelek langsung di afk , tolong di minimalisir min kesalahan nya di sengaja atau bukan jangan maen ambil tindakan","sentiment":"negatif","predict":"negatif"},{"text":"Game nya parah.untuk koneksi jaringan buruk pas lgi main & sering Bug.di tambah lagi team nya pada ga bener. tolong di perbaikin lagi. Ngasih team nya yg bener dong monton,klo gua lagi maen solo.Game tolol asli.main solo kalah 20x gegara di kasih tim nya tolol.. giliran Mabar di kasih tim lawan nya jago²..Game Goblokk!! Fix gua hapus game ini..","sentiment":"negatif","predict":"negatif"},{"text":"Mangkin update bukannya mangkin bagus ternyata banyak bug nya Jaringann lebih buruk, pliss lah moonton klo update tuh minimal jaringan di stabil kan, dan matmacking tim di adilkan masa kalah terus gak ada menangnya, dan Satu lagi jangan dowllod game ini bro","sentiment":"negatif","predict":"negatif"},{"text":"1.Dapat match yang ga adil,yang solo sering ketemu orang mabar tapi beban padahal rank nya mythic 2.dapat tim yang ga bisa main,padahal rank mytich 3.banyak orang ngetrol 4.jaringan kadang tidak stabil 5.masih ada yang pakai cheat dalam game 6.serig bnyk bug pas main","sentiment":"negatif","predict":"negatif"},{"text":"Perbaiki jaringan gak stabil kek dulu sering merah ping waktu war . update Mulu jaringan kaga di perbaiki,saya suka game ini. mohon di perbaiki lagi masalah jaringannya.banyak player yg ngeluh masalah jaringan!!! Gua jamin player ml akan berkurang klw masalah jaringan belum di perbaiki.","sentiment":"negatif","predict":"negatif"},{"text":"Game dengan sistem terburuk yg gua temuin, dari segi jaringan selalu lag padahal di apk yg lebih besar dari lu moonton selalu lancar. ( \" Game buruk sistem)","sentiment":"negatif","predict":"negatif"},{"text":"Selamat siang developer, baru saja saya tadi mengalami eror, pas mode rank pertandingan sudah berlangsung kurang kebih 15 menit, tiba tiba match nya hilang, semua teman satu tim afk karna saya mabar sama teman saya, setelah berhasil login, match nya di histori tidak ada, tolong diperbaiki, karna itu sangat merugikan karna saya dalam keadaan menang dan 1 bintang lagi legend karna awal season. Tolong dengan sangat ini ditindak lanjuti agar tidak ada yang spt ini lagi, sekali lagi ini sangat mrgkan","sentiment":"negatif","predict":"negatif"},{"text":"Montoon kalo update tuh jangan besar banget kesian yang ram hp nya cuma 2 nanti kan banyak yang gk pada mau main ml klo ram nya besar, terus kalo lagi main tim nya tuh harus sesuai merata, aku kasih bintang 1 dlu deh","sentiment":"positif","predict":"positif"},{"text":"ada apa ini....??? jaringan data bagus, wifi apalagi.... tapi sering nge lag,,, bahkan ping nya naik tinggi sampai 300.... otomatis jadi malas maen....","sentiment":"netral","predict":"negatif"},{"text":"Tolong benerin masalah komunikasi di game ,Bisa gk kalo main pubilc gk kebanyakan toxic main game buat nambah mood bukan malah hancurin mood, kalo bisa player yang kayak gini di mute aja sebulan dulu kalo ngulangin lagi baru seumur hidupnya. Di mute d game , kalo d mute hidupnya jg gpp sih lebih baik kayaknya.","sentiment":"negatif","predict":"negatif"},{"text":"Ketika main tiba-tiba ping merah padahal jaringan bagus, seperti ada data yang diunduh oleh Game Mobil Legend itu sendiri ketika bermain dan bikin jaringan lag. setelah selesai main, ping hijau kembali. Seperti sudah diatur tim mana yang akan menang oleh moonton!!!","sentiment":"positif","predict":"negatif"},{"text":"Game tidak jelas , di kasih tim bot semua sedangkan musuh pro player semua , perbaiki lagi sistem match making nya bang moonton yang terhormat, masa glori di kasih tim romawi semua emang gak jelas ni game ,,","sentiment":"negatif","predict":"negatif"},{"text":"Seperti nya game ini sdh di setting, gk bakalan menang Klu belum sampai level tertentu , slalu di kasih team lemah,kalah menang kalah menang gitu aja di level tertentu,jadi mualai bosan..tolong jgn di setting pertarungan nya,knp harus ada turun sesion,ini yg membuat org lebih jenuh lagi ! Macth sering di atur ...! Bossaaan!!","sentiment":"negatif","predict":"negatif"},{"text":"Game nya seru tapi playernya tolong seimbang pertandingan nya kembali saya menggunakan Kadita 4 kalo di mode rank 1 menang 3 kalah dan di pertandingan ke 2,3,4 pasti ada orang yang menggunakan hanabi dan hanabi itu feeder saya dan rekan 1 tim saya kewalahan dengan hanabi karena diaa maju2 seperti tank tolong player seperti ini di beri sangsi yang lumayan berat ~TERIMA KASIH~","sentiment":"negatif","predict":"negatif"},{"text":"Pembagian tim\/lawan sangat tidak adil, karena lawan saya terlalu jago\/keras sedangkan teman satu tim saya sangat bodoh dan lemah\/noob player sehingga membuat saya sangat sulit sekali untuk naik rank,yang menyebabkan rank saya nge stuck di situ saja!","sentiment":"negatif","predict":"negatif"},{"text":"Sekarang moonton banyak bug nya apalagi masalah sinyal. Masa pas di lobby sinyal nya lancar namun pas ini game ngelag apalagi pas war sehingga saya sering sekali kalah akibat bug dari sinyal moonton ini. Kepada pihak developer mohon diperbaiki kalau memang lancar bilang lancar jangan pas ini game malah tiba tiba lag apalagi pas war sehingga orang melaporkan cheat kepada player lain","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak, setiap saya draft pick atau loading menuju ke Battlefield selalu saja mengalami freeze, dan saya tidak dapat masuk kembali ke dalam Battlefield karena itu. Saya mohon untuk Montoon agar segera mengatasi hal ini. Device saya sudah sangat bagus untuk bermain namun sering saja mengalami freeze di bagian loading ke Battlefield. Credit score mengurang dan saya tidak dapat bermain rank karna itu :(","sentiment":"negatif","predict":"negatif"},{"text":"Moonton yang terhormat, mungkin sering kali orang orang bermasalah dalam pembentukan tim,apalagi bagi mereka yang sudah berusaha(mvp) pasti sangat kecewa dengan tim mereka, saya punya usulan,📌Bagaimana kalau setiap Player yang MVP itu mendapatkan proteksi bintang ⭐dan selain yang MVP tidak❌, mudah mudahan usulan saya bisa di pakai, TERIMAKASIH 🩷","sentiment":"netral","predict":"negatif"},{"text":"Tolong lah jangan persulit saya yang solo player, yang gendong tim gua mulu, season ini tidak biasanya saya ngestak di legend padahal saya biasa cepet ke mitik. Selalu di kasih tim feeder, dan musuh yang terlalu kuat. Mls bgt jigg lu","sentiment":"netral","predict":"negatif"},{"text":"Makin dimainin makin stres.. mending unistal.. lawan nya ga seimbang.. kita main nya bagus dikasih team kacau.. biar lostrek terus menerus, jadi nya mentok aja disitu.. darksistem nya luar biasa.. buat yg baru instal aman . Tapi lu juga bakalan hadapin hal yg sama seperti saya... By Ml","sentiment":"positif","predict":"positif"},{"text":"Ini kenapa ya? Setiap saya login pasti tidak bisa, saya coba berkali kali tetap gk bisa bikin emosi saja, mohon utk moonton perbaiki bugnya segera, Terima kasih🙏","sentiment":"netral","predict":"negatif"},{"text":"MONTOON gak berani menjawab kenapa Macthmacking tidak seimbang lose trike tros kan gajelas, game teburuk sepanjang sejarah, apa penyebabnya di beli tiktok? Padahal saya main di tahun 2017 macth making nya seimbang, tapi semenjak sekarang sudah berubah, di kasih lose trike sampek 15 kali juga pernah, gini amat sistem nya, jangan memikirkan uang dan uang terus, update skin apalah, yang paling penting drak sistem nya dulu di hilangin, di cari kelemahan game nya,kasih tim yang seimbang.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong moonton beri dukungan untuk hp yang ram 2 kasian main nya ngelag ngelag,kasian sering mgefrezze tolong dong,kami main nya mau mulus grafik nya,kami cuman mau kami main nya ga ngelag ga patah patah.padahal grafik nya udah rendah Lo 😭😭","sentiment":"positif","predict":"positif"},{"text":"Game sampah asu, kebanyakan main sama bot, tim tolol. Buang² waktu, pengalaman bermain yang buruk, dark system.","sentiment":"negatif","predict":"negatif"},{"text":"Semenjak pembaruan trus .suka sering sinyal merah ping gak stabil. Timbul nya malas main game ini lgi.mending main game pou aja lah","sentiment":"negatif","predict":"negatif"},{"text":"Game nya emng seru tapi kayak di sengaja bngt gitu klo main di kasih tim nya yg jelek gk seimbang sama musuh nya yg udng ngerti main apa lagi setiap mau naik renk pasti gitu mlu jadi saya belum bisa kasih bintang 5 dlu🙏🙏🙏","sentiment":"negatif","predict":"negatif"},{"text":"Matchmaking mode klasik selalu bikin emosi parah. Musuh bisa main semua, tim panen coklat semua, gerak-geriknya udah kayak komputer maju ke depan terus mati. Main solo lagi winstreak malah pecah, bukan lagi 1vs5 tapi 1vs9, capek dapat tim kerjaannya feeder bikin ketinggalan poin. Lord summon 8 menit juga bikin susah comeback, potensi hero lategame nggak terlihat, build item belum jadi udah kalah duluan karena musuh straight push bareng lord di early game. GAME SAMPAH!!!","sentiment":"negatif","predict":"negatif"},{"text":"Sistem cacat, Kesalahan dari sistem game tiba tiba freeze, tapi pas report ga ada tindak lanjut apa apaa, kredit skor berkurang doang ajaa, cuma cari duit doang ajaa ini game","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah Moonton kenapa setiap ganti akun download data lagi, padahal setiap akun sudah saya download data, selang beberapa jam saya ganyi akun lagi suruh download data lagi, sdh 3.5 giga sata pakek internet data HP ... Ayolah perbaiki Saran ya kalau milah tim itu yg bener ... Masak gua dapet tim ampas muluu g ada bener2 nya ... Tolong lah pihak Mobile Legends direktur developer atau apalah d rubah itu yg ampas2 dibedakan yg pro dibedakan ... Jadi males maen kalau kek gini terus","sentiment":"netral","predict":"netral"},{"text":"Sumpah game ga jelas ,uda mytic ktmunya feeder terus sama dapat tim bot .game ga jelas ,ga ngotak ,ini sistemnya gimana ,sekali main tmen kek bot trus ,capek solo ranked trus.","sentiment":"negatif","predict":"negatif"},{"text":"Kalo gak siap kesel ya gak usah main game ini Kalo keseimbangan matchmaking tidak segera di perbaiki saya tetep kasih bintang satu buat game ini Saya rasa moonton curang kalo dari 20 match hanya 5 kali match yang timnya imbang Kalah menang akan lebih seru kalo tim nya imbang Apalagi di solo rank Segera perbaiki kalo gak mau di bilang Moonton curang Moonton curang Moonton curang","sentiment":"negatif","predict":"negatif"},{"text":"Sistem matchmaking rusak, udah bukan kategori rusak. Emang disengaja, setiap mau naik ke rank lebih tinggi yang perlu 1 bintang lagi selalu diberi dark sistem","sentiment":"negatif","predict":"negatif"},{"text":"Ga tau ini game apa setiap main selalu kalah tim sama musuh ga seimbang, udah cape cape main game ini tapi selalu kalah tolong di perbaiki. Main game ini ga pernah menang cape","sentiment":"negatif","predict":"negatif"},{"text":"Emblem baru di tahun 2023 sangat tidak bagus menurut saya karena hero lain jadi tidak seimbang, karena ada nya emblem terbaru ini, pemain pro pasti paham apa yang saya maksud di mohon kan buat monton di kembalikan setinggan emblem ya seperti tahun 2022","sentiment":"netral","predict":"negatif"},{"text":"Game nya seru tapi sistem nya buruk. PING tidak stabil, kalau login ulang lama+kena ban pengurangan kredit skor. Mau main game aja ribet,di classic ketemu musuh party tapi Temenya player baru.ngechat kasar juga dikurangi kredit skor.","sentiment":"negatif","predict":"negatif"},{"text":"Matchmaking tidak seimbang, solo ketemu mabar, atau rekan satu tim tidak mengerti main, biarpun sudahbermain bagus, kalau dapat tim tidak bisa main tidak imbang jadinya, no fun at all","sentiment":"positif","predict":"positif"},{"text":"Berat gamenya, banyak data tidak berguna seperti skin hero yg banyak, skin map, berfaedah bagi user tidak, hanya bagi developer sebagai celah keuntungan Matching pertandingan tidak relevan, jika bukan teman satu tim tidak tau bermain, musuhnya yang pandai bermain, bagaimana caranya supaya kita susah menang banyak bug, cheat, dan gangguan untuk memainkan game ini, dan batasan sangat banyak bahkan tulis pesan pun dianggap berkata kasar, suka keluar sendiri (booting ulang), lag karena sistem","sentiment":"negatif","predict":"negatif"},{"text":"Sangat mengecewakan masalah jaringan...tiba2 lag sampai hero tidak bisa di gerakkan...kadang sampai pertandingan berakhir...percuma main kalau selama pertandingan hero tidak bisa bergerak...padahal wifi lancar...parah moonton","sentiment":"positif","predict":"netral"},{"text":"mohon di atur tim nya, setiap saya main saya selalu mendapat tim yang kurang kompetitif dan tidak adil dan saya selalu kalah jika memdapat kan tim tersebut.","sentiment":"positif","predict":"negatif"},{"text":"Monton kayak monyed Gua klo lagi war tiba tiba lag Klo udah mokad mlh sinyal bagus Padahal jaringannya bagus Alasan gua kasih bintang ⭐1 karena banyak bug, tim dan musuh g seimbang Gua lostrek oyyyyy. sekian hapus ml karena gua udah muak sama ni game. Capeee. Kalah trs. Sekian ganti game Terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Assalamu'alaikum wr.wb Saya: putra bagus w. Saya beri saran untuk jangan download game Mobile Legenda Bang Bang,karena bikin stress dan juga itu klo gk AFK kalian m4ti² trs akan kekurangan poin kalian Dan saya saran kan jangan download game ini ok.","sentiment":"negatif","predict":"negatif"},{"text":"Aku sudah main game ini sudah 5 tahun tapi semakin kesini game banyak sekali bug dan error' nya, aku dari kemari mau main selalu lag dan tiba tiba keluar sendiri, ayolah moonton jangan kau memperioritaskan uang terus dengan update skin ini, skin itu, Hero baru, map baru, fokuskan aja dengan gameplay dan jaringan para pemain agar yang main tidak sering kesal dengan gamenya karena gak bisa dimainkan","sentiment":"negatif","predict":"negatif"},{"text":"Saya bermain game ini sejak season 2, dan season 29 adlh season terburuk yg pernah saya alami.. mactmaking sangat tdk imbang,, pernah saya main 12 jam nyari 2 bintang buat naik mythic dan hasilnya di kasih lose streak 14x , win cuma 1x , lose lagi begitu terus.. sangat merugikan buat player Solo !!! Ampazzzzzz !!! Bad game,,not 5vs5 ( 1 VS 9 )","sentiment":"positif","predict":"negatif"},{"text":"Nemu tim beban di classic, rank, brawl. Kalau musuh pro, gila gendong 3-4 pemain buat menang iya kalau musuhnya juga sama jeleknya masalahnya musuh kek udah top lokal aja padahal belum main di mhytic, tolong ya sesuaikan tim macht soalnya gak seimbang banget, tim gua bobrok sedangkan tim musuh pro, kalau ada ya tim musuh 1-2 player aja yang bodoh, lah ditim gua bukan 1-2 tapi 3-4 orang","sentiment":"positif","predict":"negatif"},{"text":"Keseringan update. Abis update malah gak bisa di buka game nya. Hadeh kacau makin kesini ML. Ganti aja tuh manajemen nya pada gak bisa kerja.","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa kebanyakan timku itu orangnya bodoh² tidak tau rotasi, mainya maju², ga bisa war, dan tim musuh sangat solid dan kompak, dan saya sudah losetreak 4×, mohon untuk pihak moonton untuk memperbaiki keseimbangan pemain yang pro dan bodoh, karena apa karena itu membuat emosi para player yang mendapatkan pemain bodoh saat dalam permainan, yaudah itu aj perbaiki keseimbangan pemain,","sentiment":"netral","predict":"netral"},{"text":"Gamenya banyak bugg semakin update bukanya perbaiki bug malah update semakin rusak,dan tolong lah kasih tim atau musuhnya yang seimbang. Terimakasih","sentiment":"netral","predict":"netral"},{"text":"Kalau ini game gamau cepat tutup seperti game sebelah , TOLONG PERBAIKI SISTEM SINYAL , kalah karna tim musuh lebih jago itu lebih baik dari pada kalah karna sinyal ngelawak . Just info : Sebelum bermain sinyal susah di pastikan dalam keadaan baik","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak makin di update bukanya makin bagus malah performanya makin turun udah gitu sinyalnya tiba tiba lag lagih mending main game lain yang jaringan lebih lancar daripada game plagiat sampah kayak gini nyesel gua main ni game","sentiment":"negatif","predict":"negatif"},{"text":"Saya Kasih satu bintang, Karena selalu dapat tim yang tidak seimbang, tetapi tim musuh selalu unggul dri tim yang saya dapat, selalu Dark Sistem.","sentiment":"negatif","predict":"negatif"},{"text":"moonton tolong dong perbaiki masalah jaringan, saya sangat kecewa sekali karna jika tidak war jaringan bagus, jika war ping langsung 200an, kadang bagus, trus 200 lagi tolong dong perbaiki..................bener bener gajelas game ini, tolong dong moonton. Jadi males gw pngen gw hapus ni game. tambah lagi dapet tim nya yg bot terus capek moontonnnnnnnn","sentiment":"negatif","predict":"negatif"},{"text":"Udah gausah pada main ini game, game kok pake dark system habis menang di kasih lostrek terus gak ngotak banget mau glory aja susah banget padahal tinggal dikit lagi malah sampe ke legend, kalo mau kasih tim random yg ngotak lah di kasih player bot mulu gila","sentiment":"negatif","predict":"negatif"},{"text":"Klo pilih lawan yg seimbang lakh bangke imah klo musuh d kasih pemain bagus semua level aja beda jauh...lol unisal aja dari dulu ga pernah bisa memperbaiki sistem macth nya","sentiment":"netral","predict":"negatif"},{"text":"Game bikin stres, yang belum install saya harap nggak usah install si, awal2 masih menghibur , lama kelamaan pasti di bikin emosi dengan sistemnya,. Apa yang di dapet ketika mendapatkan lose streak\/kalah berturut-turut : emosi, stress, kesel dan bikin nyesel. Bukan karena mainya, tp karena sistemnya. Game untuk hiburan bukan untuk bikin stress penggunanya.","sentiment":"negatif","predict":"negatif"},{"text":"Lagi lagi jaringan,tolong lah kenapa sekarang jadi lag terus jaringan nya merah tapi sinyal oke² aja, menghubung kan kembali tiba tiba percuma sja ada fitur service klo ga di baca.😤","sentiment":"netral","predict":"netral"},{"text":"Moonton tolong kalo lagi latihan di custom sistem nya perbaiki lagi seperti dulu yg ga bisa set up lord set up turtle kami yang lagi di challenge kesusahan karena bot Bot kita set up lord dan yang main jungle buff by sering di ambil","sentiment":"positif","predict":"positif"},{"text":"Game nya bagus, cuman aku kasih 1 bintang dulu Udah kecewa berat karena pembagian tim tidak seimbang, apalagi pas sinyal di ml patah² waktu pertandingan , padahal kondisi sinyal saya aman² saja Akibatnya membuat kredit skor dan rank saya menurun","sentiment":"negatif","predict":"negatif"},{"text":"Game paling gak jelas servernya, masa kita yang udah main sampe ribuan match di kasi tim yang baru main, server tukang troll. Gw kasi bintang 1 soalnya servernya gak cerdas. Kalo kaya gini mulu mending uninstal aja gw main game pou","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa pas saat bermain tiba tiba lah padahal sinyal wifi saya bagus gak kenapa kenapa tolong di perbaiki bug nya min dan satu kata buat Mobile Legends[DANCOK NCEN DEVELOPER NYA]","sentiment":"netral","predict":"netral"},{"text":"Makin lama makin jelek segi bug . Chiter nya. Dan matching nya tim kawan kaya apa lah main nggak tau main mod darf pick tapi kalau tim musuh seperti sudah berkali kali naik turun mayticy . Maka dari itu saya uninstall game ini MAAF MONTON KALAU MAU GAME INI RAME LAGI TOLONG DI PERBAIKI SEPERTI SARAN DI ATAS TERIMAKASIH","sentiment":"negatif","predict":"negatif"},{"text":"Masalah Kembali Lagi, Pakai Data Selalu Ping nya sangat Tinggi, 100 -200 ms an, padahal posisi sinyal full bar buat download tembus 1mb+, udh aktifin mode speed masih gak terlalu ngefek malah jadi naik turun ga karuan, udh coba ganti provider sinyal ttp sama aja","sentiment":"positif","predict":"netral"},{"text":"Jangan mempersulit di setiap spin, misalnya untuk spin skin leo setiap saya spin selalu mendapatkan hadia yang sama, seperti tidak ada hadiah² lain nya... Harus adil lah moba taik.. Walaupun secara acak spin nya tapi udah berulang kali spin selalu dapat hadiah yang sama terus....","sentiment":"netral","predict":"negatif"},{"text":"Kadang badmood mainnya aplagi rank,karena kita main jago tapi ketemu tim yang kyk baru bljr maen alhasil kalah sedangkan tim musuh pada jago, harusnya bisalah menyatukan tim dengan player yang jago maennya biar tim seimbang ini kyk pilih kasih","sentiment":"positif","predict":"negatif"},{"text":"Bagus aja sih tapi match making nya emang yang rada diluar akal tapi semua nya bagus tapi saya menemukan bug yaitu setiap kali saya login harus download data lagi padahal dari awal sudah download data tapi semua nya ke reset setiap kali saya login","sentiment":"netral","predict":"negatif"},{"text":"Padahal kemarin udah ada pesan dari moonton kalo jaringan yang tidak stabil sudah diperbaiki. Tapi sampai sekarang masih sampah!.","sentiment":"netral","predict":"netral"},{"text":"tolong sistem pembagian timnya direvisi lagi masi banyak pemain yang feed demi kenyamanan pemain karna sistem pembagian tim yang tidak seimbang membuat daya minat berkurang terimakasih","sentiment":"netral","predict":"netral"},{"text":"saya selalu bertemu player yang sengaja melakukan feeder tapi saat saya melaporkan ke costumer service bilangnya player tidak bersalah menurut GM SILVANA?apa costumer service hanya ikon tak berguna?sampai tidak adanya penilaian dari gameplay maupun chat saat gameplay nya?kami selaku player tidak terlalu tertarik dengan hero hero barumu melainkan dari kebijakan yang kalian berikan percuma update hanya untuk membuat hero baru dan nerf\/buff hero lama tapi sistemnya terasa tidak adil bagi playersolo","sentiment":"netral","predict":"negatif"},{"text":"Ini mlbb kenapa, semenjak rilis nya unduhan manajemen terbaru bukan nya makin bagus malah makin buruk, lelet lagi, apalagi pas di gameplay ny jaringan naik turun naik turun gitu terus 👎","sentiment":"netral","predict":"negatif"},{"text":"game apaan nihhh, sinyal kuat lancar2 aja tbtb ngefreeze gabisa gerak nge lag dan lebih parahnya lagi game ini matchmaking nya diluar nalar dibuat kalah terus2an dg tim yg di dapat gak sepadan dg musuhnya terus tanpa menang sekali pun gak masuk akal bgt, game lawak, pantes rating rendah dan bnyk pengguna yg komen negatif, game nya aja begini bikin emosi. jgn cuma skin doang yg di upgrade, sistem dan jaringan juga diperhatiin. ocehan pengguna lebih penting demi kenyamanan bermain!! terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Setelah update malah jadi ngebug pingnya. Udah gonta ganti jaringan pun masih jumping dan ngebug(ping yang ditampilkan beda sama ping yang sebenarnya) . Kacau","sentiment":"netral","predict":"netral"},{"text":"tolong untuk player yg berkata kasar dan suka membully untuk di tindak tegas,, kemudian masalah keseimbangan pertandingan emang jauh bgt, kadang dapet lawan yg kuatnya gk ngotak tp rekan satu tim bot dan lemah,, jadi gk seimbang dan gk seru,,","sentiment":"netral","predict":"netral"},{"text":"Saya kasih rating 1 karna terkadang saya sering bertemu tim yang ga masuk akal, ada yang 2 jungler, ga ada tank, buta map, dan terkadang sinyal ngelek bug padahal di sinyal di hp netral","sentiment":"netral","predict":"netral"},{"text":"Ajang cari uang ya haha Game apa ini tidak merekomendasikan katanya sudah event dimana mana tapi masih saja banyak trouble di game play nya buruk sekali!!!!!!!!!!!!!! Anda cari uang dengan cara buruk tunggu akibatnya saja !!!!!! #KECEWA","sentiment":"negatif","predict":"negatif"},{"text":"Monnton mending lu update game ini tolong lah di hapus aja mode solo, asli capek bgt udah bener main malah dapet team solo trol, Game hampir selalu update ini itu mana kadang sering banget lag lag, ping merah gak stabil, Pihak moonton yg tehormat, apa lagi kami sebagai pemain pejuang solo , selalu gak bener kasi team di solo rank Kadang kita main bener temen kita yg ngetrol Tolong lebih selektif lagi kalo mencari temen dalam mode rank solo\/gak hapus skalian aja mode rank solo,parah","sentiment":"negatif","predict":"negatif"},{"text":"Woi moonton plis lah . Ini dark sistem parah banget . Gue ini sebenernya kurang mekanik apa lagi. Dapat tim trol . Plis kalau ada tim pick hero asal plis agar gue bisa hindar. Ini cuma 5 pick mm baru bisa menghindari dari permainan ni kan gak lucu moonton , gue mau menang malah ada afk , tim gue afk malah gak nyerah malah ujung nya def. Plis lo ubah aja ini game kalau gitu. Plis coba kalau gue rank A jangan lo beri tim B, yang musuh tim A semua mana imbang moonton.","sentiment":"negatif","predict":"negatif"},{"text":"makin kesini makin parah ml sekarang sering ilang jaringan nya di saat war , dan sering reload sendiri ,bikin afk game aja ... padahal game seru , mohon di perbaiki lagi sistem nya","sentiment":"negatif","predict":"negatif"},{"text":"Mobile Legends: Bang Bang Mobile Legends: Bang Bang Salam sejahtera. Moonton saya sebelum nya ingin mengutarakan keberatan di dalam matching , kenapa selalu ada teman satu tim yang melakukan feeder atau bermain dengan aneh tidak sesuai role nya , lalu setelah permainan pasti mereka yang bermain aneh itu selalu OFF atau tidak aktif , dan juga biasanya jumlah pertandingan nya hanya ratusan , dan tier nya mentok di legend sedangkan tim lawan hebat hebat dan jago jago dan tier terakh Vuck you game","sentiment":"negatif","predict":"negatif"},{"text":"Tolong moonton. Bikin game buat bikin orang refreshing happy. Ini mala bikin stress ngk masuk akal ketemu sama orang2 tolol.. game asuu.. rating gamemu sudah jelek, perbaiki lah masuk akal dikit kalau dapat rekan tim. Tiap naik bintang sdh 5 ketemu sama teman2 tolol terus turun lagi smpe bintang habis. Lu sistemx gimana?? Pengen orang main terus, tapi cara sistemnya bodohhh","sentiment":"positif","predict":"negatif"},{"text":"Game nya sih memang bagus tapi knp sinyal nya selalu saja tiba\" lag padahal sinyalnya bagus trs segi pembagian tim ny ga adil saya selalu mendapatkan tim yang buruk","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah kualitas ML ini dijaga agar kami terus menggunakan game ini, lama kelamaan kami muak dengan sistem yang tidak bersahabat, waktu tanding e malah lemot, trus akirnya bintangnya turun lagi, cuuuookk dah moonton","sentiment":"negatif","predict":"negatif"},{"text":"Sampaikan ke pembuat game,kalau solo game ketemu musuh ngak pernah sesuai tier begitupun teman malah dapat jauh di bawah tier kita,suka ngelag padahal jaringan bagus.","sentiment":"negatif","predict":"negatif"},{"text":"Bikin kecewa banget .masah jaringannya jelek malah gak bisa gerak lagi Ndak bisa main .. kok di ban sampai 4 jam emank anehh... Ni mobile lagend sekarang...... Tingkatkan lagi kualitasnya. Ok . Terimakasih","sentiment":"positif","predict":"positif"},{"text":"Bagus si bagus tapi ya tapi pas awalnya tim bagus ya ya kalo udahkelamaan kelamaan tim kagak seimbang dan bosoh tim yang di pilih oleh monton saya kesel saya pensi aja maen di luar udah saya gak usah maen ngam mending maen bolla dah pensi maen ml pensi gam burik semuannya cape saya tau gak pusrenk pusrenk sampe tangan pegel nyampe bosen kalah kalah mulu 😡😤 yang bisa ke mitick mah cuma orang dewasa yang bisa tapi yang kecil susah susah naikit sampe pegel tolonglah pilih tim yang enak enak dikit","sentiment":"netral","predict":"negatif"},{"text":"tolong untuk diperbaiki masalah jaringan karena ketika kita udah didalam ingame dalam waktu udh mid game sering terjadi adanya lagh parah bahkan menyentuh 200 ms padahal kondisi wifi saat itu baik dan lancar lancar aja jadi kami mohon pada pihak moonton agar memperbaiki masalah ini bukan perbanyak hero terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Kepada pihak moonton saya setelah beberapa bulan ini bermain mobile legends bang bang pengalaman saya bermain game ini tidak enak saya selalu bermain classic dan rank selalu mendapatkan tim yang tidak seimbang seperti tidak mengerti Lane dan tidak memperhatikan map dengan ini saya minta kepada pihak moonton agar perbaikan ini AGAR konsumen anda tidak kecewa, terima kasih","sentiment":"negatif","predict":"negatif"},{"text":"Game ini membuat kita kesal kalau kalian mau game yg gak bikin kesal main saja \"free fire\" Karna freefire adalah game battle ground yg asik sekali dari pada game ini karna game ini membuat kita main dan kita akan diseting tidak bisa menang dalam kata lain tim yg egois\/tim yg tidak seimbang jadi jangan main game ini!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Moonton gak adill banget kalo ngasih tim, selalu dapet tim bott(player pemula) sedangkan musuh nya pro player semuaa plisslah diperbaiki lagi supaya timnya imbang.setelah update bukannya lebih baik malah burukkk.Banyak bugg saat login kadang gak bisa login padahal jaringan saya normal² aja","sentiment":"netral","predict":"netral"},{"text":"Game gak jelas, sistem match makingnya sangat amat buruk. Semua event harus ngeluarin uang yang gak sedikit, banyak joki dimana-mana dan gak ada solusi untuk menangani masalah-masalah seperti ini. Jujur, ini game terburuk yang pernah gw mainin, pengembangan hanya pengen duit dari player, sementara mereka gak peduli apa yang player alami. Mending main Pokemon kalo gini gw","sentiment":"negatif","predict":"negatif"},{"text":"Satu satunya masalah yang membuat main gak nyaman yaitu sinyal tiba2 lag, ping merah ijo kuning, sinyal gabisa stabil main jadi males, saya akan kasih bintang 5 kalau sudah di perbaiki masalah sinyal ini.","sentiment":"positif","predict":"positif"},{"text":"Lah ko sekarang susah bngt ya masuk ke game nya. Masa harus restart ulang lgi jaringan bermasalah. Pdahal jaringan bagus. Di perbaiki lgi dong","sentiment":"negatif","predict":"netral"},{"text":"Update trs ni game masalah team gk pernah di urus. buang² data aja download gk kira kira Pas selesai download malah sering ngelek parah pas main padahal siang di app lain bagus. tolong lah perbaikin dikit nih game","sentiment":"negatif","predict":"negatif"},{"text":"Dapat time yg selalu tidak mengerti bagaimana bermain game ML selalu di kasih pemain yg tidak bisa memilih hero yg baik. selalu bikin kesel mereka pilih mm padahal tidak mahir memainkan mm kadang punya 4 teman demuanya gg","sentiment":"negatif","predict":"negatif"},{"text":"Jaringan bagus tapi malah lag Mulu, udah keluar tapi masih sama aja nunggunya lama dirank pas war game anj, lag jadi afk dibayar pake kredit skor, update kentir tim gua ngatain yang gak bagus kegua karena jaringan merah","sentiment":"negatif","predict":"negatif"},{"text":"Setelah update skillnya delay, trus analog jalannya sering tiba2 tereset (gk jalan lagi) auto attack nya aktif pdhal udh d matikan (akibat analog nya tiba2 mati pdhal udah d tahan tekannya) akhirnya sering masuk tower msuh sndri, mohon d perbaiki","sentiment":"netral","predict":"netral"},{"text":"Sumpah tiba² banyak terjadi delay.. Padahal sinyal baguss .. Akhirnya skill gak pas saat mau di keluarin.","sentiment":"netral","predict":"netral"},{"text":"Game rusak, sinyal ga pernah benar kalo main pingg aja terusss, sekalian aja kasih nama game nya mobile jumping, selalu update terus\"an sinyalnya ga dipedulikan huhh payahhh!!","sentiment":"negatif","predict":"negatif"},{"text":"Game yg bisa membuat perkelahian ini,sangatlah tidak bagus.dulu masih seimbang permainannya.sekarang bahkan digabungkan dgn tim noob.saya uninstall aj.sebelum ada update yg baik.baru saya berikan bintang 5.tolong dibuat adil pertempurannya.sementara diberikan bintang 1 dulu.Terima kasih .","sentiment":"negatif","predict":"negatif"},{"text":"Jaringan jelek saat pertandingan.. Gw saranin hapus game ini.. Systemnya diatur sedemikian rupa agar player bisa loss streak dan saat waktunya slalu turun rank.. Dari segi jaringan semua loss,, buang² data pnyimpanan.. Perbaiki kalo emang tanggung jawab.. Gw mending pindah server sebelah,, enak maennya.. Dri pda ini susah di jaringan,, jaringan itu utama","sentiment":"negatif","predict":"negatif"},{"text":"Game nya baguss polll lah aku kasih bintang 1 di mohon buat monton naekin kredit skor jangan 1 hari cuman 3 pliss kasian bocil\/anak pas lagi maen tiba\" di suruh ema ke pasar\/belanja warung dan bisa juga pas lagi maen ehh hp nya mati\/ngebleng sebentar tiba\" kaya hp saya udh mah posisinya lagi push rank mau mohon kaya gimana g bisa ngomong langsung.pliss buat pihak monton tolong klo setiap menang pertandingan dapet 1 kredit skor buat yang rendah aja kredit skor nya jangan yang di atas 90pliss:)","sentiment":"negatif","predict":"negatif"},{"text":"Game bagus grafik nya bagus, cuman tim pada gk bisa main, dan sedang kan musuh jago semua tolong kasih lawan yang seimbang","sentiment":"negatif","predict":"negatif"},{"text":"Bukannya game di update makin bagus lah ini..... Di update makin jelek, soal sinyal kenapa setelah di update sering leg...leg... Tolong lah!","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak, bukannya benerin bug malah banyakin update.. sistem match ga seimbang bisa pula solo ketemu yang mabar.. Alah game Gilak bug, main dah menang tiba² DC padahal sinyal ok, lalu ga bisa masuk lagi.. hasil match ga masuk profil lalu bintang pun ga bertambah.. masalah ini terlalu sering terjadi.. Benerin bug ini jangan Gilak update sama banyak event","sentiment":"negatif","predict":"negatif"},{"text":"Saya kasih bintang 1 karena 1. Kedua tim tidak seimbang dengan kemampuan dalam bermain 2. Banyaknya orang yang ngomong kata kasar 3. Ada juga beberapa orang cheat seperti map hack,damage yang tidak normal,dll","sentiment":"netral","predict":"negatif"},{"text":"Terlalu bnyak update. Pengalaman bermain menjadi susah karena teman random yang TIDAK SEIMBANG. menyebabkan game menjadi SULIT untuk dimainkan...","sentiment":"negatif","predict":"negatif"},{"text":"Ini bug apa gmna ya dri dulu tim saya kok gak ada yg jago sama sekali ya sedang kan musuh nya sangat jago main nya😠😡😡😠 kalo bintang segini tuh lebih baik game tidak pantas di bintang 4 seharus nya bintang 3.0 bukan 3.6","sentiment":"negatif","predict":"negatif"},{"text":"Habis update bukannya makin bagus malah tambah jelek, padahal main pake wifi dan game lain lancar tapi kenapa main ml lah parah? Minimal jaringan dibuat lancar lah","sentiment":"negatif","predict":"negatif"},{"text":"Tolonglah moonton untuk update kali ini di perbagus lagi kenapa saya kasih rating bintang 1? Dikarenakan saat dalam permainan sering terjadi sinyal jelek\/ping merah padahal mau buat meme YouTube jadi kayak gini susah, lag yang sangat parah sampe gak bisa gerak membuat gak nyaman saat bermain untuk masalah ini tolong di perbaiki moonton supaya saya bisa bikin meme di game ini biar makin rame yang main nih makasih","sentiment":"negatif","predict":"negatif"},{"text":"Keren Sik, tapi pertimbangan timnya sangat kuranggg!, Mendapatkan musuh lebih baik dari pada tim saya, mohon kerja samanya *MOONTON* belakangan ini banyak babget yg ngerasain hal yang sama seperti saya, MOHON DI SEIMBANG KAN GAME NYA!","sentiment":"negatif","predict":"negatif"},{"text":"Untuk kesenangan nya dapat. Namun bikin stress berat, dari tim nya yang losestreak lalu ngetroll, ram nya semakin besar, dan resos nya yang ga ngotak. Jadi mohon untuk mengondisikan hal yang mesti di kondisi kan. Dan untuk moonton lain kali kasih otak dikit tim nya.","sentiment":"netral","predict":"negatif"},{"text":"Oi ni bug gajelas tiba tiba putus koneksi. 3 orang terus gak bisa masuk ulang ke battlefield abis update ini fix lah ga bisa masuk lagi","sentiment":"netral","predict":"netral"},{"text":"Lagi main rank, menit 1-6 aman aman aj, tb tb pas di gank musuh lag, pdhl wifi data bisa dipake nonton yt, coba relog, pas di ingame gw kira bisa tb tb lag lagi, moonton benerin lah ni bug ato cheat,nyusahin anjg","sentiment":"negatif","predict":"negatif"},{"text":"Kok lu selalu ngasih lose treak sih,curang cokk drak sistem cokkk,gk suka gua game yang selalu kayak gini buang\" waktu cokk,pasmain pertama menang trs main ke dua kalah,biar main terus gitu trs lu kaya haaa,game Babi make drak sistem anyinggg,ngapain coba kayak gitu jadi meles main game kayak gini mending main epep kalo di kasih lose treak terusssss.","sentiment":"negatif","predict":"negatif"},{"text":"Untuk bermain game tidak adil banget saya selalu mendapatkan tip bot\/nob saat bermain solo terlalu banyak anak anak dibawah umur plis tolong perbaiki min ini membuat saya dan orang orang lebih cepat pensiun main mona legend.","sentiment":"negatif","predict":"negatif"},{"text":"Lama\" gak jelas ni game,kadang lagi main keluar sendiri,lagi asik\" engwar tiba\" lah padahal jaringan bagus bgt,udah sering pembaruan tapi game makin parah,","sentiment":"negatif","predict":"negatif"},{"text":"Makin aneh, setiap main suka nge freeze udah ganti hp juga ttp sama, dan ketika relog lagi loading lama bgt dari 1-100%, game lain aja ga selama itu. Dari dulu ga pernah di perbaiki!!+!!","sentiment":"negatif","predict":"negatif"},{"text":"Permasalahan match mackingnya tidak pernah di perbaiki, setiap bermain selalu tidak di perseimbangkan, musuh jago tim sendiri bodoh itupun bukan hanya sekali duakali tapi lebih 5kali berturut turut","sentiment":"netral","predict":"netral"},{"text":"Saya mau ke pertandingan tidak bisa terus padahal udah pada mulai itu yang lainnya cuma saya aja yang blm ntr di kiranya saya yang afk padahal saya udah login bolak balik tetap ga masuk","sentiment":"netral","predict":"netral"},{"text":"Gamenya skrng agak erorr...sinyal baguss...WiFi baguss...tpi kenapa klo pas udh in game...analog dan skill..trs pergerakan musuh seakan akan ngelag bentar...pdhl hp udh mendukung redmi note 10..tetep aja kek gini..emang game ini gjlss","sentiment":"negatif","predict":"negatif"},{"text":"Untuk patch yang terbaru kalau soal grafik saya mengakui bahwa pengalaman yang sekarang sudah lumayan bagus,tapi kalau untuk performa main game,bug,dark system,tolong lebih diperbaiki gimana nasib nanti update besar besaran sedangkan ml masih banyak mengalami permasalahan tolong kepada developer moonton untuk lebih memeperhatikan kenyamanan player nya terima kasih🙏🙏","sentiment":"positif","predict":"negatif"},{"text":"Banyak banget kosakata yg dianggap tidak sopan padahal normal disebut (tolong banget direview ulang karena sangat mengganggu komunikasi game). Lalu apa gunanya fitur kasih tau ping in game??? Jika saat dipencet yg muncul adalah saat ping internet normal. Terakhir tolong perbaiki fitur cancel matchmaking. Buat apa ada fitur itu kalau saat dipencet malah masih masuk ke dalam matchmaking nya sehingga kalo dicancel akan berkurang credit scorenya","sentiment":"negatif","predict":"negatif"},{"text":"Yg terhormat moonton tolong memperbaiki bug \/cheat karena saya ketika mau menang jaringan saya tiba² merah sendiri dan itu satu tim saya terkena lag jaringan tolong ya moonton perbaiki bug \/ cheat","sentiment":"netral","predict":"netral"},{"text":"Percuma ada hero baru,sama skin baru tapi kalau bugnya masih belum diperbaiki.Terutama bug ketika lagi asik main tiba tiba keluar sendiri.","sentiment":"positif","predict":"negatif"},{"text":"Semenjak banyak update,kenapa jaringan gak stabil,terus suka keluar sendiri dari game,ngefreze\/stack lah,nambah aneh nih game","sentiment":"negatif","predict":"negatif"},{"text":"Game nya bagus sih bagus,soalnya gw jadi dapet husbu baru dan skin nya juga bagus tapi gw GK suka bgst Ama moonton pilih kasih Ama gw,masa gw setiap main selalu kalah anj apa lagi di rank kalo tadi cs gpp ya kan,ini malah rank langsung kntl Tolong untuk moonton Jan pilkas Ama gw,gw udh capek dapat team yg agak laen kadang,ntr mm nya buat map kalah gold+damage,roamnya rotasi Mulu bantuin gw kadang kalo gw udh bikin \"berkumpul\"5×,blm lagi hyper nya Indomaret anj.Tolong ya Moonton Jan pilkas Ama gw","sentiment":"negatif","predict":"negatif"},{"text":"Saya selalu ngerasa kesal ketika mainkannya. Mengapa?karena saya dikasih tim yang tolol terus. Kalo bisa kasih tim saya dan tim lawan yang seimbang lah sering sekali saya losetreak sampai 30× bukannya terhibur malah makin setres😔","sentiment":"netral","predict":"negatif"},{"text":"Musuhnya GK seimbang tim musuh lebih kuat dan tim saya sangat buruk.tolong diperbaiki saya sudah mengeluarkan banyak biaya untuk game ini tolong diperbaiki sistem nya saya sebagai player kecewa dengan sistem yang sekarang kalah berkali-kali dapat tim yang GK seimbang dan juga banyak yang memakai jasa joki agar bisa naik ke rank yang lebih tinggi tolong ditindak lanjuti saya sebagai player solo sangat tertekan dengan sistem yang sekarang banyak sekali hal hal yang harus diperbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Skarang makin susah aja nih game , musuh di kasih yg ga seimbang , mytic turen ke legen 4 saya pake puss turun banget sampe epic 3 kya ga masuk akal menang pun 10 x match paling sekali abis ituu turun terus , kl gini caranya mnding delet ganti maen POU aja , udh ga rekomend 👎 di persulit untuk naik rank , makin kek taiii , sekarang main masa kalah sampe 10 bingang anjingg ga tuhh","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah coba match making nya tu di benerin masa dapat tim gak jelas terus gak seimbang lagi musuh nya jago tapi dapat tim nya jelek kayak apa mau menang pas masih warrior sampai GM mah biasa aja kalo habis mytic kena reset season ke epic kok susah betul dapat tim yang pro sedangkan kalo musunya jago terus, plis moonton kasih lah tim yang dapat di andalkan dan sesekali kasih musuh yang noob","sentiment":"positif","predict":"negatif"},{"text":"Ini game apaan di ladenin tiap hari malah di kasi lose streak trus,CUMA ngetik \"hero\" aja langsung sensor ditambah kena dark sistem titik toxicnya mana woilah cape co ngepush di kasi musuh nya ga imbang,maen dapetnya orang² mabar semua sedangkan gua solo kalo mau curang ngotak dikit lah,menang 3x kalah 12x kan ga ngotak.lama lama jadi broken ni game,sekian salam lose streak","sentiment":"negatif","predict":"negatif"},{"text":"Pas mau menang tiba2 sinyal ngelag, padahal udah pake wifi sama kuota tapi tetep ngelag, terus tiba2 saya keluar dari game kemudian tidak bisa login lagi, itu kenapa ya?","sentiment":"negatif","predict":"negatif"},{"text":"Lingkungan toxic, developer psikopat, bikin system \"dark system\" di tim lawan\/kawan , hasil pertandingan selisih sangat jauh, tidak membantu mengembangkan skill player, sudah season 28 dan mau M5 belum dapat kasih solusi, moonton sangat konyol dan merendahkan diri developer sndiri, keluhan player tidak direspon dengan baik oleh developer","sentiment":"negatif","predict":"negatif"},{"text":"Kembalikan ulti 3 odette seperti kemarin. Skrg ulti 3 odette tidak bisa untuk pindah pindah posisi. Sdh hero lemah di ubah sprti ini, tambah banyak matinya. Jadi akhir ini saya males main mobile legend wajar saya kasih bintang 1. Kecewa saya kpada Mobile legend.","sentiment":"positif","predict":"negatif"},{"text":"Kok makin parah aja nih game Ping sering drop padahal sinyal bagus, saat main patah patah, kadang ga gerak sama sekali, sudah di atur settingan paling rendah pun tetep aja lag dan patah patah 🤬🤦👎👎👎","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak sama komputer, tingkat losstreak mantap banyak, jadi kesannya game settingan, mohon diperbaiki montoon ,makin sini mobile legend makin arogan dark system nya .","sentiment":"negatif","predict":"negatif"},{"text":"Nge bug teruss lagi main tiba tiba keluar padahal sinyal bagus, lagi Mabar 1 tim 3 orang keluar tiba tiba padahal sinyal bagus, tolong dong makin buruk nih game","sentiment":"negatif","predict":"negatif"},{"text":"Tolong diperbaiki untuk sinyal dan kembalikan seperti dulu yang gak gampang jumping jumping padahal sinyal bagus, mohon bantuannya pihak moonton","sentiment":"netral","predict":"netral"},{"text":"Kok makin update, punyaku gabisa kebuka, loading update, penuh, trus ngulang login, biasanya udh kebuka, tpi ini malah loading update lgi, penuh, trus ngulang lagi, gitu mulu sampek bosen, udh coba ganti jaringan, udh coba pakai wifi juga, tpi tetep aja. Kasi solusi dong min","sentiment":"netral","predict":"netral"},{"text":"game-nya bagus, masalahnya hanya ada di sinyal dan match making, untuk sinyal sering tidak stabil, padahal saat bermain game lain sinyal selalu bagus, dan untuk match making, selalu tidak seimbang antar kedua tim, tolong di perbaiki demi kenyamanan dan pengalaman bermain yg lebih baik","sentiment":"negatif","predict":"negatif"},{"text":"saya mengalami pengalaman bermain yang buruk. begini pengalamannya : pertama, saat di draftpick saya tidak bisa memilih hero karena terhalang dengan tanda buffering yang membuat saya tidak bisa memencet apapun. kedua, saat loading match saya mengalami layar blank hitam. ketiga, saya pun mecoba me-restart game tetapi hal tersebut kembali menyebabkan layar blank juga, kejadian tersebut kembali terulang hingga match-nya invalid. akhirnya sistem menghukum saya dan saya tidak bisa mengajukan banding.","sentiment":"negatif","predict":"negatif"},{"text":"Moonton tolong dong lw benerin lagi keamanan akun player, soalnya hack akun meraja lela dimana mana akun gw di hack mulu, terus feedback buat pengajuan pengembalian akun ke pengguna sebelumnya asli kayak taik, Kalo nggak lw atasi makin banyak ntar kerjaan lw. Thanks","sentiment":"positif","predict":"netral"},{"text":"Perbaiki dulu masalah jaringan, terus masalah pemilihan teman yang sudah disetting oleh montoon buat bikin player kalah berkepanjangan dan itu mmng ada (sistem yang buruk) montoon hanya mengejar keuntungan tanpa buat player nyaman bermain","sentiment":"netral","predict":"negatif"},{"text":"Ini kok main di advance server gk bisa Mabar sama publik yang dri global chat ya? Pas di follow selalu muncul \"versi tidak cocok\" aku pun bingung lantaran ml di hp ku yg belum update atau di mereka.. pdahal sudah update di play store, sama Nemu match nya aja lama kali sampai 13 menit +","sentiment":"positif","predict":"positif"},{"text":"Matching nya tidak jelas tidak seimbang, makin update makin kesini bukannya malah lebih baik malah makin rusak. Matching nya tidak seimbang, jaringan suka naik turun bug lag pas masuk pertandingan, bug lag pas awal masuk pertandingan, gratisan makin berkurang, niat lanjut apa enggk nih game kok malah makin gajelas rating aja turun parah kacau nih game. Jika terus seperti ini bakalan kesaing sama game yang lain","sentiment":"negatif","predict":"negatif"},{"text":"Kembalikan sistem download resource yang dulu,dulu 6,6gb udah bisa ngerasain tampilan hd dan semua efek skin Hero mulai dari graphic low sampai ultra,skrng malah suruh download secara terpisah,buat yang hp low spek sangat merasa terganggu oleh ukuran game nya yang banyak memakan penyimpanan dan skrng bingung resource sampah mana yang harus dihapus dan mana resource yang penting,mohon ulasan kami para player dibaca agar kenyamanan bermain kami tetap terjaga,jangan hanya mikirin untung kalian","sentiment":"negatif","predict":"negatif"},{"text":"Skin elite, perbaiki jaringan sulit, d kasih tim sampah mulu, ama baru keluar bentar ehh reload lagi pas masuk, kena ban machmaking karena afk, kredit skor d turunin, apaan ini game, bikin saya emosi aja","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya gak adil terlalu banyak tim yang tidak mengerti bermain ranked dan itu sangat merugikan orang yang sudah mengerti bermain game ini, dark sistem moonton sangat terlalu jelas dalam permainan ini saya selalu sering mendapatkan kekalahan yang banyak dan kemenangannya hanya selalu 1 kali dikasih moonton, dan terlalu banyak orang yang sengaja melakukan feed didalam pertandingan sehingga merugikan tim.","sentiment":"negatif","predict":"negatif"},{"text":"Kasih tim buat solo player berasa 9 vs 1 ,bukan 5 vs 5, dan tololnya lagi game ini sering dapat tim yang troll dan merugikan kami yang udh pro dalam game, game moba terbaik masih DOTA DAN AOV yang terbaik gk ada namanya orang push solo dipersulit,apa lagi sering ketemu akun joki jadi merugikan buat solo player","sentiment":"negatif","predict":"negatif"},{"text":"Sya ska bgt sama gamenya, ska bgt. Tapi ada yg kurang, klo kita LAPORKAN PLAYER atau AJU BANDING tapi g diterima maksudnya apa?! Dikira sya bohong? Jgn mentang dia MVP terus \"wah main dia bgus kok\" NGGA!! Dia main aman Moonton, yg lain war dia ga ikut. Trus gunanya fitur laporkan player itu apa klo g diterima? Player kyk dia yg jdi kurang ajar dan g tau diri, jadi mereka bisa begitu trus. TLG KLO UDH DILAPORKAN YA DISANKSI AJA PLAYERNYA LANGSUNG. Soal afk aja cpt, giliran FEEDING g ada aksi!!","sentiment":"positif","predict":"negatif"},{"text":"Ping suka Jumping, dan untuk login kembali ke dalam game lama sekali padahal sudah menggunakan wifi + data.. tolong diperbaiki servernya agar lebih baik saat melakukan match","sentiment":"negatif","predict":"negatif"},{"text":"Maaf sekali lagi pas mau nyambung ulang mulay nya lama banet gak kira kira nyambung ulang nya terus di tulis afk lagi mau nyambung ulang aja lama banget pas masuk udah kalah padahal lang sung nyambung ulang lo kok lama banget masuk nya mohon maaf tolong di per baiki jika ingin menyambung ulang di in game biar cepet","sentiment":"negatif","predict":"negatif"},{"text":"Kasih minimal yg seimbang lah Tim kurang jago musuh jago kadang musuh nya kurang jago tim ku yang jago Tolonglah mactmaching nya yang seimbang dong Tambahan tolong jaringan yg awalnya nyaman dan lancar menjadi tidak lancar saat memulai game sekali lagi tolong kasih tim yg seimbang saya sudah muak saya lebih baik bermain game yg lain Setiap saya bermain mobile legend pesti gak ada have fun nya mau rank lose Mulu saya sedang nge-push susah akhirnya kalah Mulu dapet tim beban","sentiment":"negatif","predict":"negatif"},{"text":"Wifi 5 bar tapi kenapa sinyal ga stabil? Tiba tiba ngelag\/ patah patah Pihak developer mohon diperbaiki ya... Hal ini sangat mengganggu saya saat bermain dan menyebabkan saya dan tim saya menjadi berbicara toxic\/kasar Dan karna hal itu saat kami bermain sering disangka feeder lalu direport oleh orang-orang g*bl*k developer mohon diperbaiki -mengetik dengan sabar setelah kejadian.","sentiment":"netral","predict":"netral"},{"text":"mobile legends, kok aneh ya setiap kalah win rate selalu ngurang banyak kayak bisa 0,3 bahkan lebih. tapi pada saat menang cuman nambah 2 bahkan 1. itu maksudnya apa ya? walaupun kalah juga mvp kok ngurang banyak, bisa ngitung ga sih? aneh cape saya naikin tapi ngurangnya cepet kan gaguna saya usaha buat naikin","sentiment":"positif","predict":"negatif"},{"text":"Game ini jgn di download karena pemilihan tim yg tidak sesuai, dan ada bug jaringan percuma update besaran\" Klo bug jaringan tidak di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Matchmakimg tidak seimbang, sistem losestreak. Jika tidak ada perbaikan, semakin berkurang minat bermain. Semakin jelek sistem nih game. Tolong perbaikan sistem, untuk kenyamanan player bermain","sentiment":"negatif","predict":"negatif"},{"text":"Pesan kepada MOONTON kalo gandengin tim itu yang seimbang lah, masak math 8000 dapet tim yang math nya ganyampe 1000, terutama solo, mending kalah tapi tim waras sama2 berjuang dari pada main sama yang math nya dikit main asal2an, mending sistemnya diganti lah tiap server pertandingan disamakan math nya, bukan masalah kalah menangnya sih, tpi kesal sih udag serius2 main dapet tim asal2an gapaham objektif,serasa berjuang sendiri, capek tau mending ban aja akun saya aja biar sekalian gabisa main.","sentiment":"positif","predict":"positif"},{"text":"Match yg tidak adil. Tolong kalo mau awet ini game matching nya di perbaiki lagi , permainan yang tidak adil dan amburadul untuk pembagian tanding nya 👎👎👎👎👎","sentiment":"negatif","predict":"negatif"},{"text":"Sekarang update makin besar belum lagi next project. Say udah gk bisa ram saya cmn 2 gb tapi trmkasih lah mlbb udah menemani saya dalam kesepian. Sayang bgt padahal gwe baru aja dapat temen buat mabar dan mabar tuh bikin game makin have fun dan enak. Tapi ada update lagi nanti next projek dan hp gwe g sanggup. Ya intinya welcome next project and good bye mobile legends","sentiment":"positif","predict":"negatif"},{"text":"Ini semua karena sistem rancangan pro diterapkan Kedua sekarang game play nya kaya Di kendalikan Sama montoon Efek dari semua Hero dan grafik nya makin berat kalo bisa dikurangan ukuran File Filenya Di FF keseluruhan data tidak sampai memakan banyak penyimpanan lalu kenapa montoon justru menghabiskan banyak penyimpanan sekarang Hampir 8 GB lho download seluruh datanya","sentiment":"negatif","predict":"negatif"},{"text":"Penurunan kredit skor AFK terlalu berlebihan hingga -16 kredit skor, menurut saya itu tidak adil harusnya 3-5 sudah cukup. Apalagi alasan AFKnya hanya karna INVALID","sentiment":"netral","predict":"negatif"},{"text":"Mohon jaringan di benarkan dulu, di tampilan merah pas di pencet ijo mohon sebesar besarnya agar di benarkan, memang ada fitur wifi+data tapi bagi saya yg pake wifi kan ga bisa beli data terus cuman buat maen mobile legend,mohon sekali lagi agar di fix dulu jaringanya jangan hanya update\/collab tapi jaringan gk di benerin","sentiment":"netral","predict":"netral"},{"text":"tolong match making nya dibenerin lagi jangan hanya skin aja yg di perbanyak tapi sistem bermain tidak adil,teman satu tim terlalu nob sementara di tim lawan lebih pro sehingga membuat game berat sebelah","sentiment":"negatif","predict":"negatif"},{"text":"Tolong loading screen nya jangan dibatasi, pesan saya cuma itu jadi tolong diperbaiki setelah update nanti kalok sudah saya kasih bintang 5","sentiment":"netral","predict":"negatif"},{"text":"Kok kalo lagi main trus ada yg tlpon kan keluar eh pas masuk lagi itu gabisa kenapa ya. Jadinya saya afk. Padahal udah masuk lagi tapi tetep gabisa.","sentiment":"positif","predict":"netral"},{"text":"Makin kesini memang makin bagus dari segi fiturnya maupun design nya, tetapi sangat di sayangkan memakan rom hingga HP dibawah rom 64 sangat berat untuk game ini, usahakan tidak banyak update yng sekiranya akan memakan rom, jangan bikin malas mainin game ini nantinya banyak yng kecewa akan peningkatan game ini","sentiment":"negatif","predict":"negatif"},{"text":"Perbaiki lagi gamenya! lagi di pertandingan, hp tiba\" mati jadi otomatis harus login ulang ga apa-apa tapi gara\" masuk ulangnya super lama, satu\" loadingnya akhirnya tim aku kalah, Aku jadi kena afk. Kesel banget! Perasaan dulu gak kaya gini. Lama banget masuk ulang pertandingannya! Padahal sinyal lancar. 😡😡","sentiment":"positif","predict":"netral"},{"text":"Match tidak seimbang selalu dapat tim yang bodoh.. Mobile legend adalah game paling buruk dalam sistem matchmaking.. Selau dapat tim yang punya role tidak seimbang dan kelakuan yang buruk.. Game ini seperti game judi yang memaksa kita untuk terus bermain namun sistem matchmaking diatur tidak seimbang oleh moonton","sentiment":"negatif","predict":"negatif"},{"text":"Game ini udah banyak masalahnya gak ada perbaikan sama sekali,tolonglah diperbaiki,agar pengguna game ini bisa puas saat dalam bermain gamenya,jgn update doang yang diperbaiki,systemnya gak ada sama sekali yg memuaskan,hampir tiap main game kena dark system Mulu lost treak tiap main,menangnya bisa dihitung setiap kali main.","sentiment":"negatif","predict":"negatif"},{"text":"Keseimbangan tim yang tidak sesuai,koneksi jaringan yang bertambah buruk saat pertandingan ,apalagi saat akan menggunakan skill,jaringan nya tolong di perbaiki jangan skin terus yg di tambah performa jaringan saat di pertandingan di perbaiki 2023 nggak maju uninstall","sentiment":"netral","predict":"netral"},{"text":"Game ga ngotak, moonton aneh gua main solo malah dapat tim yang kayak bot. Dari awal season main Mobile Legend baru season ini yang parah, masak bisa lose strike sampe 15 kali lebih.. tolong diperbaiki lagi tim solonya bang moonton🙏","sentiment":"negatif","predict":"positif"},{"text":"Payah gameny makin kesini makin parah bukan player sekarang yg cheat tp SYSTEMNY yang curangin player gk seru banget gamenya lama lama 1. Ping bagus tbtb lag 2. Dark system dikasih tim yang pergerakanny kaku \"BOT\" atau musuh sama aj BOT juga tapi kalah dulu yang banyak 3. Dark paling dark musuh bisa ilang pas pengen mati 4. Ketika war & dikit lagi win tbtb lag 1tim 5. Gk ad perbaikan \"SANTAI BAE\" Rating turun bukan diperbaikan Mala justru anteng","sentiment":"positif","predict":"negatif"},{"text":"Terkadang sinyal buruk dan pembagian tim yang tidak seimbang seperti musuh yang gg dan tim yang tidak kompak membuat gameplay menjadi berat dan sulit dimenangkan","sentiment":"netral","predict":"netral"},{"text":"Tolong moonton segera perbaiki gamenya kamu,sebelum menyesal setelah gamenya sepi peminat,masak sinyal bagus langsung merah di gamenya,kalok memang gak niat buat game hapus aja,lebih parahnya lagi ketika mau masuk game lagi malah gak bisa,kalok terus²san gini fix hapus apk","sentiment":"negatif","predict":"negatif"},{"text":"Game gak jelas, ping nya kadang naik turun terus, padahal di pake nonton youtube aman aman aja, pas di loby juga aman aman aja, tapi pas in game langsung brutal ping nya.","sentiment":"negatif","predict":"negatif"},{"text":"Apa salah kami Player solo sehingga moonton memberikan tim yg suka trol. Gua tau itu teknik marketing kalian agar kami penasaran dan ingin terus memainkan gamenya. Tapi jangan lah sampai merusak mental kami. Sekali dua kali gak papa selebihnya jangan lah. Mohon moonton Plis.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong gajelas banget setelah update fitur management recourse di setting knp dihilangkan itu berguna bgt buat hp dengan sfesifikasi low tolong munculkan kembali. Terimakasih","sentiment":"netral","predict":"netral"},{"text":"Menurut saya dari kebanyakan game, cuman game ini yang pembuat pemainnya jadi stres, karena apa? Karena pemain di kasih sbuah kelompok yang dak bisa bermain dengan bagus, dan juga dikasih lose treak sebanyak-banyaknya, jadi ini lah game perusak rohani orang, karena pemainnya dibuat stress karena mendapat random player yang dak bisa main ml","sentiment":"negatif","predict":"negatif"},{"text":"Matchmaking sangat buruk!!player yang jumlah pertandingan nya baru ratusan di satu tim kan dengan player yang jumlah pertandingan nya sudah ribuan.tolong untuk moonton perbaiki matchmaking nya saya tidak masalah menunggu lama yang penting mendapatkan tim yang seimbang","sentiment":"netral","predict":"netral"},{"text":"Makin ga ramah sama memori, yg katanya update skrg bakal MERINGANKAN malah memperberat. Udah masalah matchmaking ga imbang, ping 200an di tengah war, dapet musuh mantan mythic, sering force close di tengah match terus mulai lagi dari awal (ga langsung ke match, loading lama, alhasil jadi AFK), auto dapet cokelat\/perak aja tiap match ini mah","sentiment":"netral","predict":"netral"},{"text":"Pas mau main suka keluar game sendiri terus ke lerock ulang sangat di sayangkan tolong di perbaiki atau saya tidak akan maim game ini lagi!!!!","sentiment":"negatif","predict":"negatif"},{"text":"game anda memiliki ping yang tidak stabil,penyimpanan besar,dan memakai penggunaan data yang sangat besar pada saat mendownload. kenapa anda tidak mencoba memperbaikinya?,sementara game anda hanya berfokus pada banyak nya skin hero.","sentiment":"negatif","predict":"negatif"},{"text":"Buat moonton untuk update yang terbaru ini tolong diperbaiki masalah sinyal saat didalam game yang naik turun,yang dari ping 30ms tiba tiba jadi 200ms. Padahal sinyal internet aku bagus,dan waktu dilobi pingnya juga bagus 30ms,tapi ketika didalam game jadi tidak karuan pingnya. Jadi buat moonton tolong diperbaiki secepatnya 🙏.","sentiment":"negatif","predict":"negatif"},{"text":"Habis season ga makin baik malah nambah rusak, gw solo selalu disatuin sama tim yang ga bisa main sedangkan lawannya pada jago semua. Tolong yang moonton kalau pembagian tim tolong disama ratakan, skin doang diperbanyak lol! Jaringan juga gitu, kita lagi asik\" war tiba\" merah Sumpah game sampah banget ini","sentiment":"positif","predict":"negatif"},{"text":"Sistem gak bagus.. Entah apa maksud game ini.. sinyal bagus bisa lag merah gak jelas.. udh mati heronya ijo lagi .. aturan sistem taikk","sentiment":"negatif","predict":"negatif"},{"text":"Minimal ngasih tim yang bener tim berat sebelah dapet tim gak bisa main,banyak ngetik, buta map, t*l*l , bukan game 5 vs 5 lagi lebih ke 1 vs 9 , tolong diperbaiki pemilihan tim jangan ngasal #hapus dark sistem bisa gila kalo main kayak gini terus","sentiment":"negatif","predict":"negatif"},{"text":"Pendapat saya untuk game ini udah bagus, cuma yg menjadi masalahnya skarang adalah jaringanx, udah updetan knp tambah gak enak, baru masuk rank aj udah nglag. Itupun gak cuma skali, klo pada nglag smua bisa bisa gk ada yg maen ml lg, saran saya cuma itu, tolong diperhatikan","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong akun\" Feeder di band dong... Lu ga ngerasain monton di feed tiap hari.. Gw di kasih tim feed mulu... Lu sehat moonton !!! Game ini sangat tidak recomended buat yg pirah darah tinggi.... Gw niatnya maen game buat ilangin stress... Tapi maen game ini malah buat jadi tambah stresss karena di satutimkan sama tukang feedd... Gw yakin banyak yg pensii dari game ini... Tolong kominfo di pertimbangankan lagi game ini...","sentiment":"negatif","predict":"negatif"},{"text":"Game nya bagus benget seru pokonya.. Yg jadi bikin unek nya setiap mau ke metic dapat tim Rank rendah jika mabar akan dapat lawan rank metic posisi nya kami masih lagenda? Gmna itu tolong di fixx","sentiment":"negatif","predict":"negatif"},{"text":"gamenya ps sblm update udh bagus,tapi pas d update sering bgt lag+jaringan merah pdhl internet bagus kok,trs tim juga g seimbang bgt sama tim musuh,trs skrng kalau main d rank atas ps draft pick g ada map yg ad lane ny,trs ps lagi main tiba²ktnya menunggu jaringan mohon diperbaiki ya montoon,kalau msh kek gini ml bkl sepi pemain :(","sentiment":"negatif","predict":"negatif"},{"text":"Setiap mau naik rank suka di kasih tim gk bnr sedangkn tim musuh pada jago, moonton ni gk adil suka ngasih pertandingan yg gk seimbang!!! Sekarang gw percaya bahwa dark sistem \/ dark moonton itu bnr adanya jadi males main lahh","sentiment":"negatif","predict":"negatif"},{"text":"gua sebgai player old gk nyaranin ni game sekarang ,server buruk ,mact dirank atas lama banget dpet player seperti komputer itu\" aja kyk gk ada plyer lain .stag war parah abis pdhl ping hijau .gk recomendet sebelum perbaikan besar\"an.jngn maenin ni game","sentiment":"negatif","predict":"negatif"},{"text":"Hapuskan dark sistem yang dapat merugikan pemain. Game ini membutuhkan kekompakan dan kerja sama antara pemain tidak semua pemain dapat bergantungan dengan satu pemain. Dan jika tier pemain tidak seimbang dengan tier lawan jadi apa gunanya tier?. Mending buat semua pertandingan sama dengan classic yg tidak menggunakan tier. Saya harap monton dapat melihat dan memproses rostingan dari saya. Lebih kurangnya mohon dimaafkan sekian dari saya","sentiment":"negatif","predict":"negatif"},{"text":"saran untuk yang baru mau bermain mobile legend. Hal yang harus diperhatikan adalah mentall. hati² kuatin dulu mentalnya baru deh download gamenya. Jangan tanya kenapa,, ntar juga tau wkwk","sentiment":"netral","predict":"netral"},{"text":"Kasih bintang 1,karena pengalaman dalam bermain game ini,sudah rusak akibat tim yg kurang kerja sama,beda halnya dengan AOV game yang sangat bagus,Tolong di perbaikin saat bermain Solo ranked,matchmaking yg rusak","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal nya makin parah ni Game merah ijo padahal gak bisa main ,, tolongperbaikan sinyal nya padahal hijau , kenapa gak bisa main aneh montoon klau kayak gini terus penggemar mobile legend akan berkurang","sentiment":"negatif","predict":"negatif"},{"text":"game ngaco, gk sesuai teman main, nasib solo players kali ya. teman yg di kasih pertanding 100 an di gabungin sama player ribuan pertandingan ,lah ujung2 nya troll, mau di suruh gendong??sesuai kan lah jumlah pertandingan nya...","sentiment":"negatif","predict":"negatif"},{"text":"Menurutku Overall dari gamenya udah bagus, tetapi tolong dong perbaiki matchmakingnya, masa saya yang masih pemula langsung dikasih musuh pro banget, sementara teamku sendiri bermainnya sangat tidak becus, saya sdh melihat tutorial youtube cara menghidari hal semacam ini, ttp hasilnya sama saja nihil, saya sudah mengurangi waktu bermain saya, tetapi sama saja tolong ya moonton matchmakingnya diperbaiki agar semua player bisa enjoy gamenya","sentiment":"positif","predict":"netral"},{"text":"Karena fitur saat masuk ke devise baru harus verifikasi ke email. Sedangkan email saya telah terhapus oleh Google sendiri sehingga tidak bisa login kembali, padahal masih bisa pakai akun lain tetapi tetep harus verifikasi ke email, akun yang sudah saya rawat dari tahun 2018 hilang dengan konyol. 😃","sentiment":"netral","predict":"netral"},{"text":"Sehabis update jadi ga enak game nya. diley kursor dan skill ga enak di mainin . banyak bug suka fc sendiri. Emblem banyak yang ruksak jadi ga seimbang ngaco parah . update ter fail mobile legend . kasih bintang satu ga sih .","sentiment":"negatif","predict":"negatif"},{"text":"Muak aku sama game ini pas lagi perang tiba2 berhenti lumayan lama habis udah gerak lagi langsung kalah, Ini bukan hp ku yang lemot ya karna pas sebelum mulai perang dan aplikasi lainya gak macet gitu jadi ,tolong untuk di perbaiki lagi ya🙏","sentiment":"negatif","predict":"negatif"},{"text":"Kangen mobile legends yang dulu, masa sekarang main relog Mulu, udah rusak ni game buat hp ram 3, kolo bisa di buat ngak relog lagi gue kasih bintang 5 dah,siapa yang setuju Ama gue, salin komen yang sama kayak gue agar di atasi, sekian semoga di baca.","sentiment":"negatif","predict":"negatif"},{"text":"Game apaan ini banyak bug,tidak ada keseimbangan matching,soal bikin emosi mobile legend juaranya, jual skin elit memperbaiki bug sulit.!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Akhir akhir ini dapet tim dark system dan ngelag, lag nya itu pas di war sama mau ke tower musuh aja, padahal jaringan wifi kenceng, good bye mobile legend, Terima kasih 5 tahun nya","sentiment":"positif","predict":"negatif"},{"text":"Setelah update, lagi main malah makin lag. Buat buka aplikasi lain semua lancar lah lagi in game ping nya 250 an. Jujur kecewa sih bukannya makin bagus malah jadi buruk.","sentiment":"negatif","predict":"negatif"},{"text":"Game ini mmg sudah di senting\/di atur menang kalahnya. Apa lagi kalau gk turun bintang pasti di kasih lawan kuat spy kalah kdg juga di kasih teman tim komputer yg bot. Kadang juga di kasih lawan komputer yg kuat di putar2 aja spt itu hheeee.. game yg membosannkan 👎👎","sentiment":"negatif","predict":"negatif"},{"text":"setelah di upgrade analog kadang tiba tiba susah di gerakin. Ini menurut aku ya gatau kalo kalian rasain juga jarak serangan hero kayak ulti nya si amoon juga pendek kayak dlu masih bisa kabur pake ulti sekarang susah. Skill aku auto turun drastis. Di update nambah bagus dong, di update kok nambah kayak game murahan.","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak event dengan hadiah yang sama sekali tidak menggiurkan, hanya menghabiskan ruang penyimpanan dan membuat perangkat menjadi lemot. Selalu lag ketiga sedang melakukan tim fight, game terasa berat dan patah-patah. Semakin kesini Mobile Legend semakin tidak nyaman untuk di mainkan. Perangkat menjadi lebih cepat panas, padahal grafik sudah yang paling rendah. 🙄 Lama-lama ini game bakalan gak laku.","sentiment":"negatif","predict":"negatif"},{"text":"Setiap bintang full pasti kalah,tim nya bot giliran musuh jago,sistem moonton aneh emg game rusak.kalo matching temuin tim nya yg setara lah jangan tim nya bot musuhnya jago!!!","sentiment":"negatif","predict":"negatif"},{"text":"Di update bukan lebih baik malah fps semakin buruk..data semakin besar tapi otak semakin kecil wkwkwk .....genshin impact saja data lebih besar tapi otak besar juga jadi nyaman mainnya fps bagus...","sentiment":"netral","predict":"netral"},{"text":"blok. gua maen ga pernah menang tau ngga, game macam apa ini masa semakin kesini tim makin gajelas gapernah menang sekarang. udah 1 bulan ga pernah menang sama sekali. gila kali ya. gw uninstall aja nih ML ga guna","sentiment":"negatif","predict":"negatif"},{"text":"Blok gua main dikasih lag, trus ga bisa masuk ingame, teman 1 tim gua juga di kasih lag gak bisa masuk ingame padahal inet aman, tolong kompensasi nya","sentiment":"positif","predict":"positif"},{"text":"Dikit2 pelanggaran. Padahal tidak sengaja pun di nilai feed sengaja.. Ajukan banding pun tidak mempan. Udah gtu sering keluar sendiri secara tiba2","sentiment":"netral","predict":"netral"},{"text":"Ini kenapa dah kok main custom teman teman ku bisa musuh nya bisa ngebuff sama tank di team ku tidak pernah bantu aku ngebuff kalo di teman ku serasa main di clasik ini akun yang mitick aku coba di akun yang epick kok bisa tapi ini gimana nya sama bug pertandingan sinyalnya udah bagus tapi kok ngelag","sentiment":"positif","predict":"positif"},{"text":"Game bagus, matchmaking tim yg ga pernah seimbang. Tim sendiri ga tau main, tim lawan selalu bagus.. Apa guna fitur feed laporan matchmaking kalau tiap di lapor ga pernah di fix..","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong montoon, kenapa setiap kita winstreak. Pasti ad pertandingan yang menyebabkan hilang jaringan.sy sudah mengalami beberapa kali.setelah kalah baru di matc berikutnya normal lagi,sy kasih bintang 1 aj, sangat mengecewakan.,main game itu buat hiburan bukan bikin stres,cuan mulu yg di kejar hero baru, skin baru, tp kepuasan konsumen tidak di utamakan. Biarkan skil player yg menentukan kemenangan, jgn di patahkan sama sistem. Kita main game buat hiburan.","sentiment":"negatif","predict":"negatif"},{"text":"Dark sistem lu ga asik jaringan bagus kok bisa2nya malah analognya kayak nge lag padahal udah pake jaringan yg bagus, gimana sih. Klo mau bikin gw kalah jgn kayak gini juga caranya","sentiment":"negatif","predict":"negatif"},{"text":"Semenjak saya update ml, ping saat bermain selalu merah padahal pakai wifi+kouta Yg aneh pas ping merah musuh sama temen bisa gerak bebas sedang kan saya tidak, juga pas saya coba afk tapi gak out ml karakternya bisa gerak dan gak ada masalah pas nonton bot ml -_- (Serasa kaya ml tahun 2021, ping merah mulu)","sentiment":"netral","predict":"netral"},{"text":"Rating udah ancur 3, Tapi sistemnya masih amcur. Pantes banyak yang berhenti main game ini, karna memang sistemnya bobrok.","sentiment":"negatif","predict":"negatif"},{"text":"Saran dari saya kalau mau ngasih team sama musuh itu meskipun tiernya sama tapi masi ada sistem seperti epic 1 2 3 saya sering dapet tim yang gabisa main sedangkan musuhnya jago banget, tolong di update sistem pemilihan tim nya yang sesuai.","sentiment":"positif","predict":"positif"},{"text":"Sistem matchmaking perbaiki. Masa tiap maen dapat tim troll.nob dan afk. Gak guna banget. Dark sistem yang parah..tidak ada peebaikan sama sekali","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah, masa dari legend 1 bintang 5 langsung kena sistem tim aneh turun ke legend 2 bintang 0, perbaiki lah pemilihan timnya tolong, jangan event doang ya","sentiment":"netral","predict":"negatif"},{"text":"Game taik,di beri tim beban nya minta ampun, niat have fun sama mau naik ke mitik,di kasih drama\" taik kucing,beri lah kami tim sama musuh tuh yg kompak setara,bukan banyak bacot lalu afk,apa itu tim taik,player solo seperti saya susah bener,mana playernya cmn bisa 1 hero doank, minimal all role udh 100+\/200+ baru bisa rank,ini total pertandingan masih 2 digit ada di mitig 😢","sentiment":"negatif","predict":"negatif"},{"text":"Buat moonton tolong game nya jangan di perlemot🙏🙏masak setiap di loby jadi lemot malah muter muter mulu, setiap selesai main, padahal liat tiktok enak gk ngelek apapun dan login nya lama banget juga mau masuk, dan tolong klok kalah malah di kasik player yg lebih noob pas main lagi, masak gw kalah pas main lagi Los mulu di kasik team yg gk jelas mulu","sentiment":"positif","predict":"positif"},{"text":"Kacau. Pertandingan banyak yang gak seimbang. Tim sendiri bego, tim lawan jago. Minimal seimbang. Perbaiki lagi utk pembagian tim. Berdasarkan Riwayat gameplay nya.","sentiment":"negatif","predict":"netral"},{"text":"Bukan karna saya gak suka sama game nya ya cuma saya rada² kebawa emosi aja dulu ml mudah banget buat di mainkan tapi sekarang sudah engak karena ml sekarang sudah bukan ml yang saya kenal soalnya mlnya banyak banget Download nya ya harusnya bisa lahya ngotak dikit ini gak langsung penuh memori sekali download apalagi ml sekarang susah buat dimain nanti pas matchmaking selalu muncul tulisan yang bilang kek gini \"koneksi jaringan mu sedang tidak stabil\" padahal pas itu data nya 4G kok dan jaringa","sentiment":"negatif","predict":"negatif"},{"text":"MLBB sekarang banyak yang ngecheat.. Apalagi klo sinyal yg di cheat.. Gak bisa gerak sama sekali.. Mohon buat pihak game untuk lebih meningkatkan lagi keamanannya biar para player bisa bermain dengan nyaman🙏🙏","sentiment":"negatif","predict":"negatif"},{"text":"Game ini sangat bagus untuk dimainkan bersama anak2 TK yg masih belajar baca dan hitung. Karena sistemnya yang sangat bagus dan adil, sehingga para player yg masih receh di satukan dalam tim dengan player yg match ribuan dan main sudah bagus. Sehingga player yg sudah bagus bisa kesulitan naik rank. Sungguh sistem yg sangat bagus agar player tergiur membeli item di dalam game supaya dimudahkan naik rank. Sungguh karya game yang luar biasa. Semoga kedepanya semakin berkurang peminatnya.","sentiment":"negatif","predict":"negatif"},{"text":"Kalo bisa saya ga kasih bintang, disaat saya bermain lagg bgt , ppadahal wifi bagus banget ga ada yg lag, tapi di ml lag bgt padahal GB aku besar.. nah trus yg paling parah lag disaat ada lawan mau push ke turret. Tiba tiba lag saya ga bisa gerak. Trus kalah tiba2, GUYS GAUSAH DOWNLOAD GUYS!","sentiment":"netral","predict":"netral"},{"text":"Setiap main pasti saya dapat tim tolol.moonton tolong diperbaiki pemilihan timnya ya.kalau gak bisa jangan ada rank.moonton tolong lihat komen play store,punya mata gak y.dan tambahan tolong di respon y jangan cuma diem aja","sentiment":"positif","predict":"negatif"},{"text":"Lama lama gk ada benernya ini game. di in game ketika war sinyal tiba\" merah, gk nanggung\" sinyal merahnya sampai 3\/5 detik. Itu lagi war. Kebayang gak?. Jadi makanan musuh. Ketika udah mati sinyal balik hijau. Sumpah cape bgt.","sentiment":"negatif","predict":"negatif"},{"text":"Udah gw capek dengan sistem matching ni game, gapernah benar!! Solo dapat tim troll. Tapi kalau main sama teman masih baguslah, masalahnya orang yang solo susah kalau matching kayak gini","sentiment":"negatif","predict":"negatif"},{"text":"Sudah di atur sebelumnya siapa yang akan menang, di awal game sudah bisa di tebak damage kita\/lawan akan lebih tinggi. Lawan yang saya temukan kebal namun tidak menggunakan item defense sama sekali. Setiap kalah selama 4 kali maka akan menang yang kelima Kali walaupun tidak membantu teman satu tim di pertandingan kelima. Jelas ini adalah settingan dan akan membuang buang waktu untuk menaikkan rank.","sentiment":"negatif","predict":"negatif"},{"text":"Mathcmaking yang tidak seimbang. Tapi sepertinya memang disengaja Moontoon biar kita merasa tidak puas dengan hasil pertandingan dan main lagi, lagi dan lagi. Ujung²nya kalah juga. Game sampah.","sentiment":"negatif","predict":"negatif"},{"text":"Banyak sistem yang berubah, dan fitur cs di pemulihan akun tidak dapat membantu sama sekali, akun saya sudah di hack oleh orang, namun saat melakukan pemulihan akun selalu gagal dalam verifikasi... Bagus bagus","sentiment":"netral","predict":"netral"},{"text":"Halo moonton tolong lah kasih tim yang bener main dari pagi sampai sekarang masih aja ketemu tim yang suka ngetrol ngefed dan afk rasanya bosen banget ketemu tim kaya gitu Mulu tolong untuk pihak developer untuk memperbaiki sistem matchmaking nya game sih bagus grafik nya juga bagus tapi sistem matchmaking nya gak bagus jelek","sentiment":"negatif","predict":"negatif"},{"text":"Moonton semakin parah...bertambah buruk..update melulu tp g ada perubahan kyamanan bermain,sinyal semakin tak terkendali + login ulang+mau masuk permainan kembali sampai 5 menit,pas masuk jd afk kredit score berkurang...parah lo....anyi....","sentiment":"netral","predict":"netral"},{"text":"Maaf monton saya player udah 4th main mobile legends dengar suara saya, saya mohon perbaiki jaringan, sinyal di hp kan stabil masa ping di dalam game gak stabil, saya mohon nonton lebih memperhatikan hal2 kecil dulu, kualitas game no 1, oke trimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Game burik sekali, lagi asyik main tiba2 jaringan ngeleg, padahal kuota full jaringan stabil, banyak di perbaiki lagi bug bug mobile legend ini. Sangat payah!!!","sentiment":"positif","predict":"negatif"},{"text":"Sering melakukan perubahan sistem Sehingga sering terjadi permasalahan di dalam game, performa bermain pun secara otomatis menurun, dan mungkin jika mode jaringan di dalam game bisa lebih di optimalkan, dan lebih di support kan kembali, itu bisa memperbaikinya, sama kayak di setting sama moonton kalo mau naik bintang tuh, pasti dapet temen yg jelek.","sentiment":"negatif","predict":"negatif"},{"text":"Game ngga bagus, gada sama sekali kelebihannya apalagi dalam hal lose trek sama sekali tidak ada solusinya. Player slalu bertemu dengan tim musuh yg jauh lebih unggul dan diuntungkan. Sama sekali tidak ada keadilan dari pihak moonton sejauh ini. look at these complaints from almost all users of the legendary mobile application","sentiment":"positif","predict":"negatif"},{"text":"Update doang sering, tapi ga di perhatiin soal ping, main pas early game lancar, pas mid - late game ping tinggi tiba² pas mati baru bagus pas udah hidup naik lagi tuh ping. Main cuma ngeliat in proses mati doang","sentiment":"negatif","predict":"negatif"},{"text":"Ini game yang membuat saya stres bbgsat tolong di perbaiki lah malu game gravik baguss tapi pembagian tim aja g bisa nguruss males Lo kalah teruss ,,minimal dibaca jawab juga tolong perbaiki agar game ini semakin ramee jangan di baca doang perbaiki jugaaa suapaya g ada yang seperti saya main game ni stress cape saya ,,saya kira setelah update bakalan ada pembagian tim merata ternyata sama aja ,,itu yang membuat orang males main ini gamee ,,, intinya ini game burukk","sentiment":"negatif","predict":"negatif"},{"text":"Nih game bukan nya ngehilangi stres eh malah nambah stres masak main nih game kalah mulu gak ada menang nya ni ni yah monton kalau kasih tim tu yang setarah lah sama musuh main ketemu musuh rata rata udah myitic poin seribuh dua ribuh sedangkan ketemu temen sendiri pada baru main malahan gak bisa main nih yh monton tolong banget gpp klo di kasih temen bot tapi musuh nya juga sama bot biar gak stres liat temen mati mulu","sentiment":"negatif","predict":"negatif"},{"text":"Tolong monton •contoh akun tidk normal|T i n a <3|• akun yg kaya gini pertandingan baru sedikit udah metik akun nga normal di Ben aja permanen akun instan merusak player metik asli. Jadi permainan tidk adil dan tidak nyaman.","sentiment":"positif","predict":"netral"},{"text":"Saya tidak terlalu suka dengan fitur menyambungkan ulang karna disitu saya menunggu lama sekali sampai Match berakhir masa gk 100% naiknya juga lama satu per satu naik ke 100% tolong di perbaiki lagi agar saya main dengan nyaman.","sentiment":"positif","predict":"positif"},{"text":"Plisss lah moonton, masa udh mau win jaringan gw bermasalah sih, ping merah jaringan nya padahal jaringan gw baik baik aj ga ad masalah plisss lahh moontoddd, tolong di perbaiki masalah itu karna menggangu player lain saat mau menang pertandingan.... Thanks you MLBB","sentiment":"positif","predict":"negatif"},{"text":"Setelah akan naik peringkat team yg di lot asli buruk dan control hero mengalami keanehan seperti di sengajakan oleh pihak developer. Beri pertandingan yg jujur dan kontrol real atas pemain.","sentiment":"positif","predict":"netral"},{"text":"Tolong di perjelas sinyal nya makin kesini makin ga jelas bukan nya nambah bagus padahal hp mendukung sinyal ga ada masalah di game lain tolong di perbaiki gosah sering update udah pro kontra sebenarnya padahal bnyak vote bnyak ga usah di update","sentiment":"negatif","predict":"negatif"},{"text":"Makin hari makin gak jelas ni game, tolong lah di perbaiki sistem penyeimbang nya,, giliran musuh dapat tim jago\" sedang kan tim ku pada gk bisa main, perasaan enakan ml yg dlu Daripada sekarang, tolong ya moonton di perbaiki lagi sistem penyeimbang tim nya","sentiment":"negatif","predict":"negatif"},{"text":"benerin match makingnya,tim musuh sama tim sendiri tidak seimbang,dan saran aja kalau bisa fungsi mute chat itu tanda² berkumpul dll jangan ikut mati.","sentiment":"netral","predict":"netral"},{"text":"Tolong sinyal Nya diperbaikin, saya main sinyal nya 120an, pass saya tekan maaf lag malah tertulis jaringan baik 52an, aneh banget itu. Tolong ya makasih","sentiment":"positif","predict":"positif"},{"text":"Dulu updat masih aman,sekarang ga aman kaya banyak pengguna cheat jaringan,aku main mitik kalau pas udah mau menang tiba² sinyal lag padahal udah make wifi bagus,ditambah data kuota nyala,wifi dan data nyala,masih lag,dan akhirnya kalah,moonton tidak memperdulikan itukah ?,masih banyak lagi kaya tombol geser susah,sinyal dadakan ilang,DLL","sentiment":"positif","predict":"netral"},{"text":"Saya mengajukan banding tetapi pihak atau admin tidak menerima ajukan banding itu bukan masalah online atau offline itu bergantung sinyal, saya saja masuk bisa lebih dari 4 menit trus dibilang afk padahal saya berniat untuk bermain kembali tetapi gara masalah sinyal saya agak sulit bermain dan ajukan banding saya tidak di terima oleh pihak mlbb sungguh game TIDAK ADA KEADILANNYA!!! Kalo bisa saya mengasih rating 0,000000000001 terhadap game tidak adil ini","sentiment":"negatif","predict":"negatif"},{"text":"Saya kecewa berat sama developer, alasan nya fitur manajemen rescource dihilangkan, padahal fitur itu sangat membantu bagi saya sebagai pengguna perangkat yang mempunyai penyimpanan sangat sedikit","sentiment":"netral","predict":"negatif"},{"text":"Kepada pihak mobile legends saya memberikan rating bintang 1 karena ada beberapa kendala yg saya alami saat bermain game seperti sinyal di in game yg buruk padahal sinyal di out game nya bagus dan juga saat mau masuk lagi ke pertandingan saat afk atau baterai habis itu waktunya terlalu lama sehingga ada kemungkinan pertandingan berakhir dan kredit skor dikurangi.Tapi untuk grafik sudah bagus hero juga banyak selalu update event dan game ini harus dikembangkan lagi,sudah itu saja dan terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa saya terus mengalami dark system selalu kalah setiap hari kalau menang palingan cuma 1 sampai 2 kali padahal saya gak terlalu sering mainnya udah main di jam tertentu tapi tetap saja kalah mohon diperbaiki 🙏🙏","sentiment":"positif","predict":"negatif"},{"text":"Sistem matching solo ranked nya ga masuk akal, selalu setim ama yg jumlah match nya masih puluhan, dark system nyata, developer aneh. Game buruk","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak,kalian masih mau main ini ,game,..?? Sementara dari pihak moonton hanya peduli dengan CUAN,mikir dong kawan,uninstal aja ini game,banyak game yang lebih baik dan mengerti dengan player,ketimbang ML,keluhan kalian aja gak di balas sama dia kan...?? Itu tanda nya dia hanya mementingkan CUAN dari pada kenyaman playerr...orang pintar pasti uninstal ini game...","sentiment":"negatif","predict":"negatif"},{"text":"Lah game ini gjlss amat beda sama game yang lain udahmah ngefreez mulu padahal jaringan ok sama dapet tim yang noob buta map selalu kena dark system mulu setiap mau naek legend ...... Beda dari ff minimal mah di benerin dulu bug nya jangan nge update besar besaran dulu...... Minimal dibaca lah agar di benerin dulu bug nya","sentiment":"negatif","predict":"negatif"},{"text":"Ini kenapa jaringan sya bagus tapi pas di in game nya merah yah... Padahal sdh kencang skali jaringan sya... Minta tolong dari pihak ML di perbaiki lagi untk server nya.. Karena kami selaku pemain sangat tidak puas","sentiment":"negatif","predict":"negatif"},{"text":"Saya sering mengalami lag sinyal pada saat war, padahal jaringan\/wifi stabil, tapi kenapa merah terus ping nya. Tolong diperbaiki moonton!!!!","sentiment":"netral","predict":"netral"},{"text":"Game macam apa ini setiap main di trol tim mulu dark sistem monton masi ada mohon bantuanya. Masa klo main dapat temen bot pless tolol trs musuh nya jago banget tolong perbaiki itu Update terus masalah gituan ga pernah kelar dari dulu. mohon tanggapan nya MONTON.","sentiment":"negatif","predict":"negatif"},{"text":"Sering laq kalau pertandingan sedang berlangsung. Waktu pemilihan masih normal dan kalau di deteksi jaringan bagus tp kalau sudah mulai bertanding sering lag","sentiment":"positif","predict":"netral"},{"text":"Sekarang permainan terasa lag, setelah update terakhir jaringan jadi aneh koneksi tidak stabil padahal ping hijau tapi lag , tolong di perbaiki. Jum'at .30 Juni 2023.","sentiment":"netral","predict":"netral"},{"text":"Game banyak player²bodoh yang gak bisa maen waktu solo rank,waktu duo trionya yang tolol,musuh juga pada jago²ini tolong di perbaiki jika memberikan team,bagi saya team yang bagus agar bisa mempelajari banyak moment.#mlbb","sentiment":"negatif","predict":"negatif"},{"text":"Game nya bagus tapi tim musuh sama tim kita beda tim musuh pada jago tim kita kek kurang jago kayak orang bodoh dan katanya draksistem katanya udah hilang mana masih ada draksistem nya tolong moonton ya tolong","sentiment":"negatif","predict":"negatif"},{"text":"Montoon suka gak jelas, tiba2 sinyal lag parah gak bisa jalan, paket gue banyak udah pake hospot juga, tetep gak bisa, gamenya makin kesini makin gak bener, bikin gak nyaman bermain","sentiment":"netral","predict":"netral"},{"text":"Game ga jelass kasih event yang menarik lah, cape nge klaim tiap hari cuma dapet tiket kalo ga tiket cuma dapet kotak kotak ampass cape banget muncul notif di event cuma kotak ampass ama tiket exp. dah gitu aja sisanya nanti","sentiment":"negatif","predict":"negatif"},{"text":"Saya berharap kepada moonton berikan saya musuh seimbang bukan yg pro\/jago ya itu saja, saya bosan defeat terus semoga di perbaiki agar semua player mau memainkan game ini ya, kalau GK di perbaiki ya saya unistal aja ya moonton 😥😥😥","sentiment":"negatif","predict":"negatif"},{"text":"Tolong yahh moonton dengan sangat Ada suruh kita update tapi sistemnya aja jelek Masa sementara war tiba2 jaringannya merah padahal wifi sama datanya lancar2, disaat udah ngk war atau udah di lobby jaringannya bagus!!!!! Tolong diperbaiki lagi, anda ini salah satu aplikasi yang paling banyak di instal yaaa!!!! Disuruh update sedangkan sistemnya saja bermasalah seperti anda!","sentiment":"netral","predict":"negatif"},{"text":"Ngak lo apasi orang cuman minta menang sekali di kasih kalah 3 udah gitu kalo lagi masuk pertandingan kalo di cancel malah di suruh 3 detik kadang kadang udah gitu bukannya kebatal malah masuk game giliran ngak masuk keditskor berkurang cuman 1 kata kata yang mau gua ucapin lagi game kon","sentiment":"negatif","predict":"negatif"},{"text":"ML sekarang buruk, jaringan dan sinyal bagus, tapi pinknya merah kuning merah kuning terus, semenjak update seharusnya game tambah bagus, sekarang malah tambah parah. #GameRusak.","sentiment":"negatif","predict":"negatif"},{"text":"Game serame ini ratingnya 3,6 dan ga pernah ada perbaikan yg signifikan. Ada sistem dark system, sistem report yg aburadul, sistem blokir pemain gajelas, emg bener bener trash game. Mending main ARENA OF VALOR dari pada game ini, cuma menang rame karna banyak bocil yg main. Bikin frenchise league seharga 30M, tapi ngedevelop game yg udh bertahun2 gini masih sulit. Mines dimana mana.","sentiment":"negatif","predict":"negatif"},{"text":"Eh moonton kenapa sih gw gak bisa bermain game ini di wifi gw 🤬 tapi game game lain bisa kayak ff yt tik tok banyak pah tapi game ini gakbisa sebelum update tolong diperbaiki😤 aku ingin ingin jaringan nya kayak dulu kalau bisa aku kasih bintang 5.","sentiment":"negatif","predict":"negatif"},{"text":"Game nya udah mulai rusak moonton dari pada Lo memperbarui even2 trus lebih baik Lo perbaikan game nya banyak yang bag masak dari dulu masih gitu aja walaupun grafik nya bagus percuma kalau banyak bag juga banyak hack tolong di perbaiki sama sekalian moonton knpa updetan baru banyak tim bot ya","sentiment":"negatif","predict":"negatif"},{"text":"game sampah, role ngak ada aturannya udah tau gua mage malah timnya pick mage lagi dua game jelek emang mending gua uninstal, di game lain kalau udak pilih role ngak bisa pilih role itu lagi ngak kaya game sampah ini.","sentiment":"negatif","predict":"negatif"},{"text":"Pembagian tim nya tolong di seimbang kan kasian untuk yang solo player, losstrek mulu, jadi nya males main kalau gini. Tolong lah tim nya jangan ada yang ngetroll. Musuh nya juga jago jago. Gimana ini...!!!","sentiment":"positif","predict":"positif"},{"text":"Udah bagus kek dulu di update makin menjadi' ini masalah nya makin susah aja ya ml enth kek mana Update bulan ini aku kurang suka 28\/Juni\/2023 Tolong di bikin semula aja kami pada player ml banyak kebingungan jdianya, tolong di semula in lagi,satu lagi itu setting emblem nya makin susah aja ya bagus kek dlu aja dri pda player ml pda pensi, bagus kyk dulu aja lebih simpel lebih praktis lebih mudah end lebih mudah di pahami, sekian dri saya tolong di baca dan di pahami end maaf jika ad kesalahan.","sentiment":"netral","predict":"negatif"},{"text":"Tolong ya perbaiki sistem prgabungan tim nya ya masa tim saya pada tingkat nya di bawah pringkat saya tapi di tim musuh mereka jauh di atas saya makanya saya beri nilai 1 bintang, ya.. karna itu tidak seimbang di kasih tim yg gak waras trus di luar nalar tim misuh nya dan satu lagi kenapa jaringan saya selalu jelek ya padahal saya ada di kotq besar lo mohon pertimbangkan ya sekian trimakasih atas perhatian nya","sentiment":"netral","predict":"negatif"},{"text":"Sering ngefreez,keluar sendiri dan pingnya tembus 350ms padahal internetnya lancar cuman jaringan server mobile legendnya jelek banget apa lagi pas baru update selama 2mingguan terus pas baru reset season selama 1 minggu hpnya sih ok' aja buat main game lain","sentiment":"positif","predict":"negatif"},{"text":"Sistem battle gak ngotak, lebih sering dapat player feeder. Makin lama makin tolol Dev nya cuma mentingin duit top up.. semoga muncul game pesaing biar segera ditinggal ni moba","sentiment":"positif","predict":"negatif"},{"text":"Semakin lama bukan semakin menarik malah bikin orang malas main, pembagian tim yang gak sebanding, darmage lawan yang tidak masuk akal pada lawan, sering skil gagal fungsi, terlalu berat gamenya dan sering lag yang sangat parah apa lagi waktu lagi pertarungan darmage musuh mlh semakin gak karuan, apalagi setingan baru, mlh bikin orang kenak trol, soal malah bikin ribet, dan gagal fungsinya","sentiment":"positif","predict":"netral"},{"text":"Untuk developer game saya saya sangat senang jika game di update apalagi colab dengan anime. Tapi setelah update ini saat saya bermain kenapa lag, patah-patah padahal jaringan saya bagus. Saya berharap masalah ini secepatnya di tangani, kalau sudah lancar kembali saya pasti akan memberikan bintang lima. Terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya seru, tpi karena pemilihan tim yg kurang jelas level beda jauh tpi sematch yg bikin game jadi ga seru. Kalo mau main game buat seru seruan ml ga worth it apalgi kalo buat solo player. Semoga kedepanya ada solusi buat player solo biar main makin nyaman 🙏 Jangan main game ini, ga guna bikin kecanduan. Darksistemnya kuat bgt najisssss","sentiment":"negatif","predict":"negatif"},{"text":"Menurut saya ML harus merubah sistem dalam pemilihan role hero , bagaimana kalau orang bisa menggunakan mage saja atau mm saja , tolong berikan kebebasan dalam memilih hero dan tidak terikat dengan lane , susah jadi main , seakan akan gak boleh main .","sentiment":"positif","predict":"positif"},{"text":"Moonton tolong lah perbaiki bugnya soalnya akun saya tidak bisa keluar dari room mcl ketika mcl ditutup trss saya tidak bisa keluar room???,berulang kali hapus data tetep tidak bisa keluar room. Dan satu bug lagi kenapa tidak keluar download data dalamnya ????,tolong yaa plisss🙏🙏","sentiment":"netral","predict":"netral"},{"text":"Abis update baru bukannya bagus dan optimal,malah makin gak jelas,di in game malah patah patah\/fps drop,udah pake grafik paling rendah sama menengah sama aja. Device Oppo A92,SD665, Ram 8\/128","sentiment":"negatif","predict":"negatif"},{"text":"cing baleg gera ngabagikeun tim teh ah,tida seimbang timtim yang bodoh dikasi ke saya tapi timtim jago dikasi kemusuh,ini maksudnya apa?bikin game ini makin rusak aja,sebelumnya ga kaya gini banyak oranglain yang merasakan juga,tolobg segera diperbaiki untuk matchmakingnya jika tida ingin game ini sepi,bahkan proplayer saja merasakan matchmaking yang tida seimbang,tolong dong goblog jangan bikin orang main game ini emosi.","sentiment":"negatif","predict":"negatif"},{"text":"Sekarang game ini bikin emosi..kita masih asik main rank tiba-tiba keluar sendiri dan akhirnya di bilang AFK dan kredit skor di kurangi..tolong lah di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Dark systemnya ngeri ini game, 1 bintang lagi naik rank dikasih tim yang kacau. dikasih lose steak pula .Asli parah. Buat apa coba kayak gitu ini moonton, Main solo ketemu trio duo. Kacau matchmakingnya . Dark system' makin merajalela","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa punya saya map nya hitam padahal udah di download semua data nya, entah itu bug atau apa saya gak tau mohon di perbaiki lagi kalo ini bener bug","sentiment":"netral","predict":"negatif"},{"text":"main game yg niatnya happy² malah makin stres ketemu tim yg ga seimbang sm musuh, capek ngadepinnya kasihan buat para player solo yg harus berusaha keras tapi percuma dark system moonton sekarang makin lama makin ga sehat, pliss bukan saya yg cuma ngeluh kyk gini tapi banyak","sentiment":"negatif","predict":"negatif"},{"text":"game nya suka ngelag.. suka kluar sendiri. banyak yg ngecit.. aneh kena dark sistem. Aplks yg bikin ngelag sendiri tapi dia sendiri yg baned skor aneh.. moonton moonton..","sentiment":"negatif","predict":"negatif"},{"text":"Sistem awal season perlu diperbaiki, untuk yg baru mytic, legend atau masih di epic ya turunin ke gm atau master. Lucu main sm mereka kalo setim jd beban kalo jd lawan terlalu mudah, buat pelangaman bermain tidak seru! Draftpick aja masih ngaco Sekarang jd suka ilang jaringannya, tiba tiba merah pas war jd ngelag parah! Tolong perbaiki semua","sentiment":"positif","predict":"positif"},{"text":"Ayo smua kita boikot game ini, hanya mau cari keuntungan saja, macth tidak pernah diseimbangkan apalagi player solo rank yang ada hanya kalah dan kalah, menang sangat langka, bukannya ada perbaikan malah makin parah, fokusnya cuma di heri baru, skin, biar makin untung.","sentiment":"negatif","predict":"negatif"},{"text":"Udh gabisa main sama sekali kendala jaringan terus padahal jaringan full udh pake data udh pake wifi tetap sama gabisa main. Gimana nih ceritanya","sentiment":"positif","predict":"positif"},{"text":"Game ini sampah sih masa gak bisa main padahal sinyal 4G, kuota ada. mtn kalo mau buat game ngotak dikit lah game apaan macam ini bikin orang emosi aja dah lah jangan instal game ini nanti nysel. Mending main ep ep🗿","sentiment":"negatif","predict":"negatif"},{"text":"Game ini jangan di mainin kasih bintang 1 aj jangan sekali nyoba game kalau anda di temu in musuh jago dan tim beban gak bisa main gak imbang main nya gak adil tolong di perbaiki untuk saya lu mending uninstal geme ini aj kalo gak mau kalah menang ada sistem lah katak moonton kasih menang gw dua kalau aj apa lima kali aj gak gpp gw cuman mau menang dua kali atau tiga empat lima gitu moonton sistem moonton itu di hapus aj tolong di imbang kan musuh dan tim kita kalo tim musuh dan tim kita","sentiment":"negatif","predict":"negatif"},{"text":"Game jelek, sistem macth making nya ga jelas selalu dikasih tim yang jelek game ini sangat tidak adil, saya sudah mytik tpi masih berasa di epic karena tim yg saya dapat selalu jelek dan game ini tidak adil,sekarang saya selalu saja mendapatkan marksman yg skill bermain nya buruk ribuan match saya telah mainkan tapi tetap saja saya selalu mendapatkan team yang buruk saya sungguh kecewa","sentiment":"negatif","predict":"negatif"},{"text":"Sangat tidak membantu ketika melaporkan player yang sangat merepotkan bahkan sampai membuat tim kalah,ketika ingin melaporkan pihak CS selalu memberikan jawaban player ini tidak melakukan pelanggaran,sangat menjengkelkan tolong lebih diperhatikan lagi dengan apa yang kami laporkan karna muncul nya player\" tersebut sangat mengganggu sekali","sentiment":"netral","predict":"negatif"},{"text":"Minta tolong kepada om Dev. Please lah hilangkan Dark System-nya... Cape aku tiap mau WIN kebanyakan langsung auto lag, padahal sinyal dah pake dual... Dari awal game ini ada dah ku mainkan dan banyak bug, tapi kali ini paling ngeselin karena ada system' yang gaje","sentiment":"positif","predict":"negatif"},{"text":"Sinyal bagus. Tapi in game malah nge lag. Ping merah. HP cepat panas jadinya frame drop. Tolong agar diperhatikan. Masa sekelas S22 ultra bisa frame drop perkara sinyal in game rusak. Ah ga ngertilah.","sentiment":"negatif","predict":"negatif"},{"text":"game yang sangat bikin emosional,tim gak sebanding masa tim lain bagus bagian tim gw jelek mainya,soal game emang seru tapi gitu lah tolong perbaiki sistem pertandingan nya agar seimbang,makasih smoga di lihat moonton","sentiment":"negatif","predict":"negatif"},{"text":"Min padal kita lagi enak\" main kx tiba\" gak mau di gerakin terus tiba\" jalan ke arah berlawanan padal jaringan bagus Dan itu pasti kena AFK itu kan bukan kesalahan kita dari siang kok sampe sekarang gitu terus gak adil lah kayak gitu","sentiment":"positif","predict":"positif"},{"text":"Pembagian tim sangat tidak jelas Sering sekali tim tidak seimbang dengan lawan. Untuk sinyal sering naik tiba tiba yang awalnya hijau tiba tiba kuning bahkan merah. Karena ping yang jelek terswbut saya banyak kehilangan credit skor saya karena di laporkan player lain. Akhirya saya tidak bisa bermain mode ranked.","sentiment":"netral","predict":"netral"},{"text":"Coba deh perbaiki sistem matchnya saja jangan cuma fokus sama update fokus sama grafiknya doang. Perbaiki sistem pembagian tim agar dapat tim yang seimbang lah perbaiki juga sistem mmnya","sentiment":"netral","predict":"negatif"},{"text":"Game nya suka gak ada sinyal tapi di hp gua sinyal ada bug paling parah ini Perbaki lah biar seru atau jika tidak aku uninstall tolonglah dah itu aja saran saya menghormati yang membuat game ini tapi tolong Perbaki bug tadi yah","sentiment":"negatif","predict":"negatif"},{"text":"Sampai draw skin legend dibalikin sebelum revamp Bukannya mempermudah, malah mempersulit. Dan perbaiki sistem match yg adil, bukan hanya lawan yg imbang, tp tim nya juga yg sesuai. Gila aja dari legend 1 bintang 4 turun ke legend 4 bintang 1. Sudah usaha untuk bermain sama temen, tp hasil sama aja. Kalah. 1x win mudah banget. Main lagi pasti loss di kasih tim ecek2, bgtu aja seterusnya","sentiment":"positif","predict":"positif"},{"text":"Woi monton baru sudah update sekarang , sinyal di in game jelek , padahal diluar bagus ,tolong diperbaiki lagi untuk jaringan nya","sentiment":"negatif","predict":"negatif"},{"text":"Game nya Bagus, Menarik. Namun System nya Gak Balance, seolah Olah bukan skill yang menentukan kemenangan, Tapi System, Keberuntungan yang di berikan oleh System. Masa Game se Gede ini System nya Gak Balance","sentiment":"negatif","predict":"negatif"},{"text":"game ga jelas cumn bgus di skin doang,tiba tiba forclose sendiri udh di coba relog loading msuk ke game ngestuck di 97% emng di sengajain atau gimna?,makin update buknnya mkin bgus mlh tambah jelek,sistem jaringan apalagi minta ampun klo ngeleg ga mau bgus jaringan nya,emang aneh ni game lama lama.Sekian saran meresahkan dari gua moonton semoga orang bnyak pensi main ni game Aaminn.","sentiment":"negatif","predict":"negatif"},{"text":"Kembalikan lah embelm yang dulu,gak semua harus di perbarui cukup tambahkan Hero Hero aja udah lebih dari cukup,tolonglah aku kurang nyaman dengan embelem yang sekarang monton.","sentiment":"netral","predict":"negatif"},{"text":"Saya setiap bermain selalu saja dapat tim yang ngak jelas kadang ngetrol kadang ngeleg trus musuh nya jago jago gimana sih monton aku sudah berusaha semaksimal mungkin knp saya selalu dapat tim yang ngak jelas","sentiment":"netral","predict":"netral"},{"text":"Saya kasih bintang satu, kalau ada bintang minus, saya kasih minus, karena saya di kasih tim level rendah dan musuh dengan level tinggi","sentiment":"negatif","predict":"negatif"},{"text":"Sungguh jelek sekali ini game, ngelag luar biasa padahal jaringan bagus sekalu Baru kali ini dari epic 1 masa turun ke epic 4, sungguh membosankan, tolong perbaiki lagi kalau mau aplikasinya jaya terus","sentiment":"negatif","predict":"negatif"},{"text":"Ini gimana tiap main ngga pernah ngasi lawan yang seimbang di kasih tim yang ngga bisa main sedangkan lawan pada jago monton sangat tidak adil sekarang jaringan sering jumping-jumping ngasih ws mentok cuman 5 game aneh pantesan sekarang dapet rating yang buruk","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak autosystem yg disetting sedemikian rupa untuk mengganggu suasana bermain para player. Saya sudah dua kali berada di situasi, dimana ketika berada di tier legend 2 bintang 2, sistem sengaja mempertemukan saya dengan player yang tidak bisa bermain sama sekali sebanyak 2 kali, sehingga saya turun ke legend 2 bintang 0. Saya merasa dihina setelah dipertemukan dengan bot pada match berikutnya. Setelah saya kembali ke tier legend 2 bintang 2, kejadian yang sama terulang. Jujur kecewa.","sentiment":"netral","predict":"negatif"},{"text":"Tolong perbaiki server nya saya bermain jaringan bagus wifi+Data seluler hp juga mendukung tapi sering mengalami lag, crush, dan freze kadang pink udah bagus 9ms tiba tiba langsung naik ke 250 dan itu gak bisa di mainin selama beberapa menit aneh memang gak jelas","sentiment":"negatif","predict":"netral"},{"text":"Koneksi mu buruk, wifi + paket data makenya tp diem dan tim musuh masih jalan? Hallo, kog gt maennya nah loh udah ketahuan jeleknya","sentiment":"netral","predict":"netral"},{"text":"Apaaan nih wifi jaringan stabil tetap aja ngeleg GK jls ta*!!!!!! Setiap gw main jaringan full tetap aja ngeleg game rusak!!!!! Main bertahun tahun jaringan Mulu kena masalah!!!!!!!!!!!!!!!!!!!!!!!!!","sentiment":"positif","predict":"negatif"},{"text":"Akhir akhir ini gak bisa lagi ganti akun , biasanya enak, sekarang gak bisa lagi, sama main solo player selalu dapat team yang gak imbang, males jadi mainnya sekarang.","sentiment":"positif","predict":"positif"},{"text":"game aneh masih aja kayak dlu login ulang masuk ke pertandingan nya lama amat tolong lah pihak montod di benerin lah sama aja buang buang waktu nunggu masuk 1 jam tolong diperbaiki lah biar player lebih nyaman kalo relog bisa masuk cepet","sentiment":"negatif","predict":"negatif"},{"text":"Game rusakkkkk.....permasalahan jaringan yg lag parah saat ketemu musuh,padahal sinyal bagus,tier naik turun bukan krna gk tau main,tapi ada aja embel2nya....dapat setim sama persis kayak computer,bukan player asli,sngaja emang harus dbuat kalah sistem moonton yg rusak ini....gw udah uninstall nih game rusak","sentiment":"negatif","predict":"negatif"},{"text":"Tolong sediakan fitur pause download resource. Sangat tidak nyaman ketika sedang ingin bermain tetapi terdapat pemborosan kuota saat di dalam draft pick. Saat saya ingin melakukan update, maka akan saya update dengan kuota yang cukup.","sentiment":"netral","predict":"netral"},{"text":"Gabisa di pertimbangkan lagi matchmakingnya???? Musuh selalu tidak seimbang sama tim bisa gak???? Di fix tolong banget. Belakangan ini game ini makin jelek","sentiment":"negatif","predict":"negatif"},{"text":"Nth ada apa dg mobile legend.. semakin hari semakin gk seru.. sinyal bagus.. buat all app berjalan lancar.. tp buat main mobile legend menghubungkan ulang terus.. lag parah..","sentiment":"positif","predict":"positif"},{"text":"Pernah nyoba game ini, tapi langsung saya uninstal, Beberapa ada yg tidak bagus gambar heronya. Main serius, pengen nge'dodge eh 'flickernya error, harusnya flicker mengikuti wheel tap arah kemana, ini malah gak jelas larinya, namanya reflek ya harus cepat survive, ini flickernya yg bikin kacau,. Seperti tidak bisa buat game. Mending yg lain aja.","sentiment":"negatif","predict":"negatif"},{"text":"Geme ini seru cuma tolong perbaiki monton untuk sinyal nya setiap kali lagi war pasti ngelek parah padahal sinyal gua bagus tapi tetap merah siyalnya tolong monton benerin bug nya harusnya makin ubdate makin bagus Sama untuk pembagian tim nya tolong di seimbang kan dan untuk harga hero-heronya tolong di permurah kira-kira 30000 soalnya harga 32000 kemahalan untuk ngumpulin battle poin nya itu susah harus sering main dan itu cuma dapat sedikit lagi tolonglah dipermurah harga heronya","sentiment":"positif","predict":"netral"},{"text":"Tambah ngacooo ni game... Ga di mainin 2 Minggu eh sakalinya di buka credit skor nya 70 aneh bgt.. Banyak bug nya, tim g pernah seimbang. Matchaking lama... Wajar klo di kasih bintang 1!!! Makin hari main makin aneh, selalu dapat tim yg level nya di bawah musuh, makanya udh gw hapus ni game, tiap hari main makin kacau dpt tim ngetrol terusss, masa dri legend 3 turun ke epic 4 dlm 2 hari kan aneh, ga pernah win sekalipun kocakkk ML","sentiment":"positif","predict":"negatif"},{"text":"Tolong ya game nya diperbaiki setres gua kenak dark sistem berkali kali, gua udah bentuk tim tapi knp setiap main yang kami dapat tim nya kompak rata rata legend padahal kami 1 tim masih epic 4 tim musuh juga ada yang main solo ada juga main duo tapi kok kompak banget mohon diperbaiki lagi ya","sentiment":"positif","predict":"positif"},{"text":"Tolong di perbaiki sistem sinyalnya, saya pake wifi kenapa sinyalnya jamping-jamping dalam waktu 1 detik berganti-ganti. Kecewa banget padahal saya pemain lama dari 2015 tapi makin kesini, makin emosi main mobil legend. Belum lagi soal pemilihan team yang acak tidak jelas. Saya jumlah pertandingan ribuan masa ketemu team yang pertandingannya baru belasan.","sentiment":"positif","predict":"positif"},{"text":"Kalo ada tanpa bintang, 0 stars saya kasih. Kemenangan sudah diatur oleh pihak development Mobile Legends, punya skill main bagus tidak berarti apa-apa tanpa backing pihak Mobile Legends.","sentiment":"positif","predict":"netral"},{"text":"Sistem yg buruk, membuat pengalaman bermain buruk, player troll dimana², ping yg tidak bagus padahal sinyal bagus, membuat player stres,jujur say pas masih main ni game jadi pemarah selalu emosian, tapi setelah uninstall Alhamdulillah jadi orang sabar gk toxic,juga jadi lebih tenang, saran saya lebih baik uninstall, main game lain aja, toh aov gk terlalu buruk, lebih seru malah","sentiment":"negatif","predict":"negatif"},{"text":"Game sangat menyusahkan ketika 1 bintang lagi pangkat naik malah di kasih team gajelas tapi musuh pasti jago, tolong di kurangin dark sistem nya menyusahkan player saja kasihan yg ingin push rank tapi malah di kasih team gajelas ketika mau naik rank","sentiment":"negatif","predict":"negatif"},{"text":"Gua kasih 1 bintang karena gua TDK puas sama game yg satu ini sudah lama gua info ke monnton masih aja ada masalah pada jaringan lag lah akhirnya banyak di luar sana jadi gila gara gara game yg satu ini gue mau mobile legends ini bisa di tingkat kan lagi jaringan lag ni supaya bisa main dgn lancar ya monnton ajg","sentiment":"negatif","predict":"negatif"},{"text":"Masih banyak pemain pakai cheat, moonton sangat tidak efektif berantas player cheat, mulai dari map hack, demage terus menerus, dan masih banyak lagi, Moonton tidak adil dalam hal ini, mereka player cheat bayar vip.","sentiment":"netral","predict":"netral"},{"text":"Makin diupdate bukannya makin bagus ni game malah maikin ancur, ping nya kebangetan banget pas setelah aku update terakhir, sebelum diupdate gk da masalah lancar2 aja. Ini tolong dong di fix, mana klu afk langsung dikurangin poinnya kan player yg rugi, klu gini ceritanya kurangin aja poin moontonnya🤣🤣","sentiment":"negatif","predict":"negatif"},{"text":"Buat yg belum download mnding ga usah .. game apaan menang satu kali kalah belasan kali .. mana sering pilih kasih .. tiba tiba di bikin lag tengah tengah game yg ujung ujung nya luu yg bakalan kalah ... Game burik lah .. Ml tuh cuma peduli Ama player ber duit banyak yg bisa beli skin mahal .. baru di menangin ...","sentiment":"negatif","predict":"negatif"},{"text":"komposisi player saat bermain mode rank sangat tidak seimbang,tim lawan jauh lebih kuat..dan tim kawan pada egois,ada yg mau memainkan mm semua,dsb.. main dari sore ampe tengah malem dari rank epic 4-2 terjun ke gm 1-1. Asli pembagian tim otomatisnya ga adil.jadi males main ml lagi","sentiment":"negatif","predict":"negatif"},{"text":"Gua sebagai player lama kecewa di updatean sekarang,apa apa ngeframe apa apa ngeframe padahal ruang penyimpanan masihh banyak itu pun data MLbb GK saya download semuaa,tolong di perbaiki lahh secepatnya,yang tdinya saya mau menang gara gara frame atau GK bisa digerakin ke ngebeku gitu jdii berujung kalah kn,segera ditindak lanjuti!!!!!","sentiment":"netral","predict":"netral"},{"text":"Game paling ngeselin, udah dpt tim jelek, bintang bisa turun, udh capek capek naikin bintang turun lg, ukuran file makin besar. Kalo sistem kalah trus turun bintang mending jadiin game solo aja wkw, daripada tim, dpt tim gak jelas bikin capek doang","sentiment":"negatif","predict":"negatif"},{"text":"D update bukan makin bagus malah jd jelek d tambah untuk control analog sering berhenti sendiri . Sangat memengaruhi game play.. Mending g Usa d update. Moonton makin hari bukan bikin palyer ny nyaman. Malah bikin bosen. Bikin jengkel bikin emosi. Kembalikan mlbb yg dlu","sentiment":"negatif","predict":"negatif"},{"text":"Sudah tidak layak untuk hp kentang, mohon perhatiannya untuk monton agar dapat menyesuaikan apknya untuk yang hpnya dibawah standart, kasihan orang yang hpnya \"kekurangan\" lah istilahnya. Biar kita semua dapat menikmati game ini bersama. Oh ya 1 lagi, kalau ngasih tim sama lawan itu yang seimbang, masak musuh nya jago-jago dikasih tim yang masih pemula. Mohon perhatiannya.","sentiment":"negatif","predict":"negatif"},{"text":"gak jelas, selalu ngasih tim yang jelek, sedangkan musuhnya pada op, 8 gane gk ada guna, dasar moonton ,gw gk puas sama sistem lu, gw party selalu ketemu musuh yang rank tertingginya immortal, sedangkan party gw rank tertingginya glory mentok 78, untuk chatnya tolong diperbaiki lagi, tolong ban kata kata agama dgn nama namanya, tadi saya juga Nemu player ngehina agama Islam tapi gk diban dasar moonton gk jelas, gw harap semua itu diperbaiki, kalo itu tidak segera diperbaiki, lama² gw stres","sentiment":"negatif","predict":"negatif"},{"text":"Rating 0 untuk game ini system security yang ngasih respon masih lambat, yang seharusnya sudah di proses masih di berikan keringanan.. system matchmaking yang kadang tidak sesuai, player solo yang keseharianya ketemu dengan tim duo maupun trio,,, sebuah system yang tidak adil bagi solo player,,,, saya memberikan rating seperti ini hanya untuk segi matchmaking dan segi respon dari pihak mlbb.!!","sentiment":"negatif","predict":"negatif"},{"text":"Akhir² ini saya sangat kecewa dengan ml karena setiap saya main Rank selalu saja saya mendapatkan tim yang tidak kompak dan ketika saya kalah batle point saya pun di kurangi. Jadi mohon maaf sebesar² nya saya tidak bisa kasih bintang 5","sentiment":"negatif","predict":"negatif"},{"text":"setiap kali winstreak pasti dikasi tim ga bisa main tapi musuhnya jago semua,sistem macam apa ini?katanya game kompetitif yang adil tapi kok sengaja kasi tim ga bisa main?bintang 1 trus klo masi lanjut","sentiment":"negatif","predict":"negatif"},{"text":"Ih ngeri main ini game bahaya,kita di bikin lose win .Terus bikin ketagihan atau penasaran ingin bermain terus terusan layak nya sudah di atur sistem.","sentiment":"positif","predict":"negatif"},{"text":"Gimana sih ini geme ini saya kembali komen lagi ini geme udah download data semua tapi grafik nya rendah Mulu padahal udah tinggi gimana ini bug atau apa tolong perbaiki lagi tadi login grafik tinggi trus main malah rendah grafik nya Hero nya juga jadi bola putih lagi gimana ini tolong d perbaiki","sentiment":"positif","predict":"negatif"},{"text":"2 tahun main mobile legends tapi sayangnya rank tertinggi di legens... setiap saya main dan pada setiap mau menang selalu kalah dan sering terus seperti itu di karenakan kebanyakan ketika hampir menang pasti 100% sering ngelag... hahahahaha ntah siapa yg salah apakah saya sebagai pemain atau HP Saya kurang bagus atau signal yg kurang baik... Bingung saya.. tolong solusinya saudara","sentiment":"negatif","predict":"negatif"},{"text":"kepada pihak moonton yg terhormat saya beri bintang satu karena pihak moonton ini meng afk kan seenaknya tidak tahu kondisi yg sebenarnya,saya itu lag jaringan jadi jangan seenaknya meng afk kan player bahkan sampai di ban kepada moonton saya mohon untuk di perbaiki sistemnya!yg ngerasain kaya saya like postingan ini mohon maaf moonton saya beri postingan kayak gini karna ini saya tidak nyaman lagi buat main game ini TERIMA KASIH SEMOGA DI PERBAIKI DARK SISTEM NYA JANGAN BERIMUSUHYGTIDAKSEIMBANG","sentiment":"negatif","predict":"negatif"},{"text":"Mohon maaf admin, saya ijin sedikit ketidak nyamanan dlm nge-game, di karenakan sinyal bagus tapi kok nge leg nya bisa parah bgt ya? Tolong lebih di buat nyaman lah, Tadi nya main buat ngilangin setres malah bisa nambah setres min!","sentiment":"positif","predict":"negatif"},{"text":"No recommended, karna pengalaman saya saat bermain game ini selalu bertemu musuh dengan emblem full dan permainan nya sangat gila. Lalu kenapa saya selalu mendapatkan tim yang sangat buruk, setelah itu saya berpikiran bahwa seperti nya ini sudah diatur seseorang. Saya tidak habis pikir, jadi saya menghapus game ini karena pengalaman game saya yang bertemu tim dengan player yang buruk dan game ini seperti sedang merusak otak saya. Season ini sangat lah buruk meta sekarang damage nya sakit banget.","sentiment":"negatif","predict":"negatif"},{"text":"Game ga sepadan ga imbang , masa tiap main ketemu random lawak terus , sedangkan dapet musuh niat maen mantan glory juga sedangkan random baru naek mytik lah atau legend abadi juga , keseimbangan matching nya mana moonton ampas yang ada","sentiment":"negatif","predict":"negatif"},{"text":"Walaupun saya sering bermain game ini tapi setiap saya memainkanny menambah stres saja,buang\" waktu,buang\" uang, seandainya saja game ini memiliki pembagian tim yg adil, saya jadi menyesal udah top up banyak","sentiment":"negatif","predict":"negatif"},{"text":"Game ini terlalu sulit untuk menaikkan rank nya,harusnya kalo sulit kek gini pelindung rank nya dipermudah,udah tim kayak bot sistem ngak mendukung","sentiment":"negatif","predict":"negatif"},{"text":"Makin lama makin aneh padahal jelas jelas menang eh malah turun bintang, ni game Makin lama bukannya tambah bagus malah makin gajelas tolong minimal Bug dihilangin , game gajelas","sentiment":"negatif","predict":"negatif"},{"text":"Apasih sistem pemilihan lawan di game ini? Gak jelas banget. Tim musuh jago\" sedangkan tim sendiri pada poqe semua. Kalo sekali atau dua kali gpp tapi ini 15× ajg. Pokoknya asw buat moonton","sentiment":"negatif","predict":"negatif"},{"text":"Setelah update, game ini semakin tidak seru lagi, selalu Dapet tim tidak sepadan, sedangkan tim musuh selalu sulit. Pengguna baru dari pada nantinya jengkel jangan instal game ini. Setelah update bukanya makin bagus gamplay nya, malah semakin tidak sesuai, sangat mengecewakan.","sentiment":"negatif","predict":"negatif"},{"text":"Semakin banyak keluhan player tentang masalah jaringan, padahal pas di dalam roam aman aman aja, tapi pas main malah patah patah, logo jaringan hijau, pas dipencet malah jaringan tidak stabil. Tolong saat ini juga diperbaiki moonton.","sentiment":"positif","predict":"negatif"},{"text":"Makin hari bulan makin bagus setelah di update malah makin hancur ...padahal jaringan wifi bagus gw coba download buka tiktok sgala rupa masih bagus tapi malah merah jaringan pas di pertandingan dan ngga mau stabil ..dan keluar sendiri","sentiment":"netral","predict":"netral"},{"text":"hehe.. game paling buruk yg sekarang saya mainkan selalu ping 200 saat mau menang atau pas war 🥱 semoga cepat di hapus dari playstore krna game ini tidak layak untuk di mainkan","sentiment":"negatif","predict":"negatif"},{"text":"Mohon kepada pihak ML saya sudah berkali kali mendapatkan hal aneh saat main tiba tiba jaringan merah pas login ulang malah ga ada gambar muncul mohon di perbaiki jaringan saat ini wifi dan paket lancar tetapi tetap saja tidak bisa jaringan selalu merah mohon di perbaiki","sentiment":"positif","predict":"netral"},{"text":"Main solo klo kalah selalu di kasih tim yang gak sepadan, gw mytic 16 klo main rank\/classic\/apalagi brawl pasti dapet tim yang Matchnya 100an, kadang dapat yang ribuan itupun orang ngetroll, saya udah lama mainin game ini dan selama gw maen solo pasti kek gitu, dark system Mulu. Tolong moonton sesuaikan skill playernya capek kalau gini trus. Gw kasih bintang 1 mungkin gak ngaruh buat developernya wkkw","sentiment":"negatif","predict":"negatif"},{"text":"Montoon niat gak sih perbaiki jaringannya Parah banget jaringannya, nge lag terus tiap kali main. Padahal pakai WiFi. Nonton YouTube lancar streaming lancar, pas ML kayak taiiik jaringannya","sentiment":"positif","predict":"positif"},{"text":"Sering freeze di tengah match, dan butuh 5 menit lebih untuk relogin, jaringan meningkat ping saat berhadapan dengan musuh, pembacaan terkait jaringan buruk tidak masuk akal dan kadang tidak sesuai fakta.","sentiment":"netral","predict":"netral"},{"text":"Masa iya saya beli skin ko nggak ada hilang di telan bumi. kan aneh udah uang hilang skin gak dapat. Kecewa sih padahal udah lama maen. Kukira bug..setelah gua reload eh masih skin nya tetep nggak ada. Kecewa bener sih😌","sentiment":"netral","predict":"netral"},{"text":"apakah di game inii tidak ada yg namanya sistem rank pas mode ranked?,serinng sekali saya menemukan tim yg dikasi oleh sistem ini tidak sesuai dengan kriteria ranked seharusnya,misalnya saya mitik ketemu tim yg masih lagend,dan itu sangat menggangu dikasi tim yg serius main cuma 1 kali sesudah itu full dikasi tim yg main nya agak bikin risih apakah aplikasi ini gagal?","sentiment":"negatif","predict":"negatif"},{"text":"Ketika menjadi solo player, persentase menang anda akan menjadi <50%. Itu pasti. Moonton membuat anda terpaksa bermain terus untuk menaikkan rank dan pada akhirnya hal itu malah membuat anda menghabiskan banyak waktu tidak berguna.","sentiment":"negatif","predict":"negatif"},{"text":"Jaringan yang makin memburuk padahal sudah memakai internet bukan wifi tolonglah perbaiki ini monton kalo begini terus banyak player yang pensi karena ini dan bukan hanya ini saja contohnya seperti data yang besar ,lag, bug, drak sistem, dan lainya. Tolonglah hp kami yang hanya ram 2 kami ingin sekali pensi tapi kami ingin bersenang senang lagi, dan setiap kali apdate mobile legend selalu aja ada bug lag dan sebagainya","sentiment":"netral","predict":"netral"},{"text":"Waktu awal login jaringan aman, tapi setelah main lebih dari 5 menit tiba-tiba jaringan sering tidak stabil. Padahal untuk main game lain jaringan wifi stabil","sentiment":"negatif","predict":"negatif"},{"text":"Game rusak makin update bukannya di fix bug jaringan nya malah makin parah bug nya padahal jaringan lancar bahkan make wifi tapi masi aja ngelag mau make wifi\/data bug jaringan yg mengurangi pengalaman bermain kalo kek gini mending g usah di download aja","sentiment":"negatif","predict":"negatif"},{"text":"Saya beri 1 bintang karna saya sangat kesal karna saat saya bermain (setelah reset seson) selalu di beri musuh yang sudah berpengalaman (sudah pernah menyentuh myhtic) sedangkan saya tidak mendapat kan tim yang seperti itu tetapi tim musuh pasti selalu ada yang sudah menyentuh myhtic dan tidak hanya satu malainkan kan 2-5 player myhtic. Jika Battlefield nya tidak di adil kan maka saya tidak akan memberi rating game ini bintang 5","sentiment":"negatif","predict":"negatif"},{"text":"Semakin update semakin bagus. Tapi mathmaking ga seimbang dapet tim kebanyakan kek bot terus dikasih musuh kompak dan tim dapet main asal²an kalo engga dapet tim ngetrol apalagi di rank,","sentiment":"negatif","predict":"negatif"},{"text":"Gak bisa milihin tim males pen ngomong kasar terus, update terus terusan menstabilkan macthmaking biar imbang gak pernah dipedulikan, yakali lose streak terus 10 kali serasa main sama tier bawah melawan musuh tier atas, ni game lama lama bikin enek sumpah kalau Mytich serasa Epic, masa main di Mytich dapet tim yang gak bisa backup, gak bisa inisiasi, gak tau counter Hero dan Item, bahkan ada juga yang ga bisa rotasi kaya main brawl, game yang bertujuan buat hiburan malah bikin stres haaadduuhh","sentiment":"negatif","predict":"negatif"},{"text":"game sampah gak usah di install nyesel kalau di install game Dajjal hapus aja nih di play store setiap kali main gak pernah dpat yang bener gue solo nyet lu tolong nyerti lah kasih tim tu yang imbang dikit lah lu ada masalah apa sih Ama akun gue setiap kali gue main drop terus tim nya tolong lah di pertimbangnyin niat nya mau lepasin stres malah makin stres jadinya tolong lah ya plissss😭😭😭😭😭","sentiment":"negatif","predict":"negatif"},{"text":"Makin tidak jelas ini, saya sudah selesai secara seluruh mendownload data game tapi hero saya seluruh nya masih seperti bola, bahkan sudah saya ulangi sampai 3 kali, padahal sudah memakan kurang lebih 4gb paket untuk mendownload nya, masih saja belum berubah","sentiment":"negatif","predict":"negatif"},{"text":"Saat Mau Memasuki Match Loadingnya Lama Banget PASTI ada SALAH SATU PLAYER untuk mencapai 100% Sangat Lama. Apakah itu BUG atau Memang karena Player tersebut Kurang Dalam Hal Sinyal Atau HP, jika Memang Bug Mohon untuk DIPERBAIKI!. Dan untuk selebihnya yah lumayan Game babi...............................................................................................................................................................","sentiment":"negatif","predict":"negatif"},{"text":"Apa apaan, gak ada angin gak ada hujan tiba\" suara ingame,skill ingame, skin Hero,suara Hero, emote, musik background tiba\" ilang.. seakan belum download resource padahal ke download semua.. update gede malah nambahin masalah","sentiment":"netral","predict":"netral"},{"text":"Saya SANGAT kecewa dengan Moonton, Sistem match making sangat lah tidak adil bagi saya. Lawan yang saya hadapi selalu saja terlalu kuat. Saya kewalahan. Dan ini juga berdampak pada poin MMR yang saya main kan tiap hari nya. Saya benar² membenci nya (sistem matchmaking) tolong perbaiki sistem ini, saya selalu kesal dengan satu tim yang selalu saja melanggar kode etik dalam permainan. Anyway, saya selalu bermain solo. Tolong mudahkan dan perbaiki sistem ini.","sentiment":"positif","predict":"negatif"},{"text":"Game buruk Sistem marching tidak seimbang, selalu dipasangkan dengan tim yang lemah dan musuh yang terlalu kuat. Dari sistem moonton harus dihapus. Ini game adiktif yang membuat anak kecil kecanduan dan berdampak buruk bagi mental anak","sentiment":"negatif","predict":"negatif"},{"text":"Tarlalu banyak hukuman AFK inilah itulah, jangan langsung bisanya nge ban. Saya main beginian juga kadang koneksi kurang bagus sering lag. Bisanya langsung memvonis aja. Game terlalu ribet, kebanyakan lawan engga sesuai buat menang aja engga ada. Lama2 ribet, makan tuh AFK, makan tuh * 1","sentiment":"negatif","predict":"negatif"},{"text":"Game gajelas ada chiter ping gw ama temen-temen jadi jelek , bukannya chiter nya yg di bened malah gw ama tim gw yang di bened, alesannya\"anda telah afk di pertandingan beberapa waktu yang lalu\"cuihhh, apaan afk gw mati-matian ganti jaringan ganti sinyal ehh malah di bened + kredit skor gw juga turun gara-gara afk, udh ngasih tim ga seimbang ada chiter juga malah di belain ini developer nya gimana sih!!! Tolong dong ini urus kalo ada chiter gini, bukannya malah di belain!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Tolong perbaiki lagi jaringan saat match sering sekali menghilang. Saat war sering sekali pingnya jumping tiba2. Jadi tolong perbaiki sinyalnya. Untuk dari segi grafik dan karakter sudah baik. Plis sinyalllll. Wjdnjbsjansjksms","sentiment":"netral","predict":"netral"},{"text":"Makin kesini makin gak jelas, sering lag padahal jaringan normal. Random publik selalu di temuin sama player player gak jelas","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak update data yg tidak perlu sehingga penyimpanan sistem menjadi membengkak.. Bukannya semakin bagus malah semakin buruk.. Tolonglah perkecil data sistem yg tidak perlu","sentiment":"netral","predict":"netral"},{"text":"Payah kalo gini.masa iya tembus sampe 7Gb hanya untuk nyimpan data-data nya.parah sih melebihi game sebelah ini kalo gini cerita nya. Update nya bikin bingung,Lama-lama kalo gini banyak yang pensi apalagi katanya ML mau update besar besaran.","sentiment":"negatif","predict":"negatif"},{"text":"Game sih seru tapi sekarang banyak player pensi, lag parah padahal sinyal bagus, yg lebih parah kenapa timnya gk seimbang, yah jadi gitu alasan banyak player pensi, karna game play gk nyaman, seharusnya sih montoon bukan sibuk updete, tapi harus urusin kenapa gameplay nya gk nyaman, jadi gitu aja sih kendala mlbb, tolong di respon.","sentiment":"negatif","predict":"negatif"},{"text":"Kalau bisa tanpa bintang kasih penilaian rasanya cocok buat game busuk begini, rasanya sayang ngasih bintang satu aja buat game busuk begini. Ingat ya semua kemenangan di game ini sudah diatur sama moonton jadi jangan harap bisa dapat kenyamanan bermain, apalagi kalau udah lose 2 x jangan di lanjutkan bagus unnistall aja game ini sayang sama paketnya toh juga gak dapat apa apa dari game begini","sentiment":"negatif","predict":"negatif"},{"text":"Game taii. Sering dapat tim beban. Gua yg solo rank harus berusaha maksimal. Sedangkan tim gua rata rata gak bisa maen. Moonton janco","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal suka jelek padahal pake wifi dan masih ada beberapa bug satu lagi match tidak seimbang di kasih tim lawan pada jago tim gw malah di kasih bott emang aneh","sentiment":"netral","predict":"negatif"},{"text":"matching match yang tidak seimbang, untuk player tunggal pasti mengalami hal yang sama , contoh tingkat rank ya g tidak sesuai dan banyak hal lagi dan ini sangat merugikan","sentiment":"negatif","predict":"negatif"},{"text":"Saya main ML sudah 6 sampai 7 thn tapi saya sudah mulai jenuh main ML sekrang se akan akan udah ga mau main lagi,karena tiap main dapat tim nya selalu aja ga seimbang dan itu terus mnerus tiap kali saya main,parah. Tolong dong dengan sangat,untuk matchmaking nya lebih di perbaiki dan lebih di pentingkan juga demi kenyamanan para player nya,karna saya pikir hampir kebnyakan para player bnyak yg ngeluh di matchmaking nya,jangan hanya mementingkan upgrade dan hero baru dan skin skin nya. Tks.","sentiment":"positif","predict":"positif"},{"text":"Tolonglah montoon perbaiki jaringannya tiba-tiba jumping ping Mulu sepanjang pertandingan dan saya harus login ulang ketika selesai pertandingan menyebalkan.tolonglah perbaiki jaringan itu saja...","sentiment":"netral","predict":"netral"},{"text":"Reset ranknya terlalu sadis. Udh mati-matian push sampe mytich,pas ganti season reset ranknya mengecewakan. Paling tidak turun legend lah,lah ini turun epic. Mending kalo epic 1 bintang 5,ini epic 2 bintang 1. Keren sekali para developer moonton ini....","sentiment":"positif","predict":"negatif"},{"text":"Dear moonton, untuk update emblem revamp ini sih ga nyaman banget main mage pakai emblem mage jalannya lelet banget sangat tidak nyaman, masih bagusan emblem yang lama biarpun ga bisa modifikasi emblem tapi movement speed nya enak, kenceng dan bikin nyaman, please next update kasih seluruh emblem ada movement speed nya, engga banget hero asassin yang notaben nya hero lincah di pake di emblem baru jalanya lelet banget kaya siput, please dengerin player mu ini demi kenyamanan bermain terima kasih","sentiment":"positif","predict":"negatif"},{"text":"Habis update terbaru Hero ixia mm malah jadi crash Mulu, padahal hp high end ram 8\/126 Kenapa semakin lama malah bukan diperbaiki tapi makin parah NGE freeze nya, aneh buat main genshin lancar banget buat main ML yg GK seberapa malah NGE freeze developer benerin lah udah lama aku komplain di in game juga","sentiment":"positif","predict":"negatif"},{"text":"Knp sih dengan sistem moonton? Jadi kan saya afk trus saya ingin melanjutkan pertandingan, dan tau apa yang terjadi? Ya ngetack di 100% gw nunggu udh 30mnt an? Malah pertandingan rank, suka aneh sistem moonton, semakin update semakin kocak nih game, dulu lebih asik kayak nya malah, game GK jelas, tolong di periksa kembali sistem nya, kasihan yang lain nya juga bukan saya saja","sentiment":"negatif","predict":"negatif"},{"text":"Menurut saya makin hari game mobile Legends ini makin tidak jelas deh masa bicara kotor tidak di ban mute baru kalau bicara yang bagus di ban mute oleh pihak anda sendiri percuma dong kita main top up atau lain-lainnya kalau soal kaum bocil yang suka berbicara kotor masih ada di dalam game mobile Legends, saran saya sih lebih baik kalau ada yang mau main game mobile Legends itu dikasihkan jangka umur dan kalau perlu harus dicantumkan oleh KTP elektronik🙏🏻","sentiment":"negatif","predict":"negatif"},{"text":"Sering Ngelag, makin di update makin lag sering afk juga ujung2nya kredit skor turun jadinya gk bisa main rank, Mactmacing, sering dapat tim yg gk seimbang ujung2nya lose streak mulu .banyak Bug, kadang main suka keluar sendiri,GK jelas mohon segera di perbaiki 😡😡😡😡😡 apalagi Mactmacing!!!!!!","sentiment":"positif","predict":"positif"},{"text":"Montoon aneh!!!!!!!!! Setiap aku ketemu musuh tiba² sinyalnya jelek dan gk bisa gerak sama sekali dan setelah sinyalnya kembali bagus pasti sudah mati di kill oleh musuh. (Padahal Wi-Fi nya sinyalnya bagus) DASAR ANEHHHHHHHHHH!!!!!!!!!!","sentiment":"netral","predict":"netral"},{"text":"Padahal ini game bagus tapi karena sinyal selalu hilang gak jelas, disaat momen penting di tambah lagi dari mytic dikasih tim yg tolol terus ,, makanya ini game aanjing,,","sentiment":"negatif","predict":"negatif"},{"text":"Dude that so bad sinyal saya tidak bermasalah tetapi kenapa tiba² jaringan saya merah dan saya harus keluar untuk me restart dan saat itu juga sudah berakhir gameplay nya","sentiment":"negatif","predict":"netral"},{"text":"Makin update makin rusak jaringannya, sinyal ngga stabil antara 120ms-285ms kalo mati ijo. Kalo diem di tempat ijo kalo jalan merah.","sentiment":"netral","predict":"negatif"},{"text":"Kadang tiba-tiba lag, server sering down dan dinilai afk in game. Terlalu banyak dark sistemnya ini game.","sentiment":"negatif","predict":"negatif"},{"text":"halo moonton gimana nih dengan server hari ini kok bisa² server buruk\/ngelag trus,tolong ditangani dan diperbaiki secepatnya Jangan fokusin event²nya dulu perbaiki server dulu lah ini ke 2 kalinya lohhhh!!!!!! Ayo game terlaris masa masalah teknis server aja teledor trusssss, tolooonggg dibacaaaaaaaaaa??????:( Dear dari player pejuang push rank:)","sentiment":"negatif","predict":"negatif"},{"text":"Tolong dong benerin gamenya ,terkadang ml nya agak ngebug dan kluar sendiri ,kdng jg saat tiba\"wif mti trs ganti ke data malah gk mau menghubungkan yg ada trs muter\"dn di suruh masuk dri awal lgi tolong game nya di perbaiki agar lebih baik lgi kedepannya","sentiment":"negatif","predict":"negatif"},{"text":"Semenjak update patch baru jadi sering ngelag gak tau kenapa padahal udah coba pakai Kouta dan WiFi tapi tetep saja begitu (lag) sudah mencoba cara yang di sarankan mobile legend tapi tidak kian membaik tolong di perbaiki lagi agar aku dan para permain yang lain nyaman terimakasih~","sentiment":"netral","predict":"negatif"},{"text":"Game kek apa ini giliran di tinggal afk ping nya stabil giliran di tap ping merah teros padahal wifi udah bagus,percuma Kon gua bayar WiFi mahal2 masa iya harus make kuota lagi kan ga mungkin gituh,tolong dong moonton tolong perbaikin bug ini karena saya di saat war sering terjadi mati konyol.","sentiment":"negatif","predict":"negatif"},{"text":"Setelah update Sering nge lag. Sering patah2. Kalah kalau sama lawan yang jago gak apa2. Tapi sering kalah karna ping yang tiba2 naik. Ping naik pas war pula. Game mulai gak jelas. Developer nya juga kayaknya gak peduli sama yang mainin game buatan nya. Game tolol emang","sentiment":"negatif","predict":"negatif"},{"text":"Permainan semakin buruk. Jumlah kill dalam pertandingan lebih banyak daripada jumlah kill musuh. War turtle selalu menang tapi gold bisa kalah dari gold musuh. Semakin update bukan semakin bagus malah semakin merugikan pemain","sentiment":"netral","predict":"netral"},{"text":"Untuk penyimpanan semakin update semakin membebani penyimpanan, padahal sudah sering hapus data menumpuk tetap aja penyimpanannya gak berkurang, tolong dong min tambahkan sistem mengatur file agar bisa di hapus atau mendownload file, jangan dibuat sistem ginian malah dikhususkan buat HP speak rendah dan penyempanan menumpuk harus semua sistem HP, biar player kek saya merasa nyaman.","sentiment":"netral","predict":"netral"},{"text":".saya sering afk tapi saya sudah berusaha mengumpulkan kredit skor agar bisa bermain rank mode lagi tapi kenapa pas saya sudah mencapai 90 kredit skor tiba² kredit skor saya berkurang sendiri saya sangat kecewa pada pihak montoon karena saya sudah begadang mengumpulkan kredit skor tapi kenapa hasil nya sepeti itu saya sangat kecewa.","sentiment":"negatif","predict":"negatif"},{"text":"Ketidak stabilan jaringan dalam gameplay, di lobby hijau pas main merah. Solo rank kita story match 1500 an lebih disatuin sama player player baru dan egoisme tingkat kelurahan. Banyak yg tidak memahami role. Update doang banyak jaringan miris meresahkan.","sentiment":"negatif","predict":"negatif"},{"text":"Game suka ngebug. Pas udh masuk ke gamplay tiba² sinyal menghilang dan auto rilog. Tiba² stuck di loby dan kg mau masuk² ke game. Alhasil jadi afk. Udh coba pakai wifi + data buat nonton yt 1080p lancar . Buat main game sampah ini mlh ngebug. Bikin player g nyaman begini. Ivent aj di ulang² mulu. liatnya bosen, Player old yg udh dapat skin limit malah di keluarin lg. Percuma. Fokus perbaiki sinyal terlebih dahulu. Jangan asal keluar hero baru\/ skin baru.","sentiment":"negatif","predict":"negatif"},{"text":"Game Burik, level sudah tinggi tetep kalah sama level rendah, dan selalu dapat tim peforma rendah, jadi kalah terus, karena musuh level sudah diatas kita. Kecewa berat level tinggi nggak ngaruh, tetep kalah sama level rendah","sentiment":"negatif","predict":"negatif"},{"text":"gua lose streak terus ini emang sengaja dikasih tim yang bodo atau gimana ya? gua kasih bintang 1 dulu, karna ya emang gak wajar aja, udah main 8 kali di rank tapi lose streak semua, untungnya cuma mvp, tolong dong jangan buta harta kalo gamenya udah mendunia, pikir juga cara mekanismenya gimana","sentiment":"negatif","predict":"negatif"},{"text":"Gw beri bintang 2 karena sinyalnya lag banget padahal buat login FF,pubg, Minecraft,roblox,YouTube, Facebook, Instagram lancar tapi untuk login ml kenapa lag banget!!!!!!😠","sentiment":"netral","predict":"netral"},{"text":"Update apaan makin nge lag aja nih game, jumping parah diluar nalar ga bisa serang musuh padahal musuh bisa serang kita pas lagi jumping, udah matchmaking nya gajelas, solo ditrol mulu gw lagi pake Hero MMR, hapus aja ni game haram, cape dari dulu gini amat ini game","sentiment":"negatif","predict":"negatif"},{"text":"Tolong ya monton kenapa setiap saya main belum ada 3 menit saya sudah di restart kembali dan dari dulu saya begitu terus dan sering terjadinya afk tolong ya sekali lagi untuk di perbaiki karna di saya selalu restart tolong di perbaiki","sentiment":"positif","predict":"positif"},{"text":"Gamenya Sangat bagus,Tetapi kenapa ya? Kami Mendapatkan team yang sangat tidak stabil sedang kan musuh yang sangat lah stabil dan kompak dan saat bermain Jaringan ku sangat tidak stabil padahal jaringan ku bagus dan matching lama jika moonton tidak ingin ini terjadi mohon di perbaiki Ya,Dark Systeam Mulu! Mohon di perbaiki🙏","sentiment":"netral","predict":"netral"},{"text":"kadang game nya selalu bug apalagi klo mau mulai pertandingan selalu bug jadi layar hitam, tim nya juga ga rata:(","sentiment":"negatif","predict":"negatif"},{"text":"Smoga saja mlbb dihapus dari google,skarang mobile Legend hanya bisa dimainkan untuk orang yg sering topup auto naik rank apalah daya yg gratisan ini turun rank trus. Musuhnya udah diprogram dari pengembang. Saat ini MLBB sangat tidak ramah dan suportif","sentiment":"negatif","predict":"negatif"},{"text":"Apa mobile legends sekarang masa di kasih tim nya yg bot trus, giliran musuhnya yg jago semua,belom lagi sinyal suka merah sendiri pdahal wifi bagus aj, tambah lagi mobile legends sekarang udh beda banget gak seru","sentiment":"netral","predict":"netral"},{"text":"Abis update bukannya bagus malah jelek performa jaringan yang tadinya selalu bagus sekarang malah sering banget naik ping padahal udah make data sama wifi masih aja naik merah mulu ping nya","sentiment":"netral","predict":"negatif"},{"text":"Tolong lah admin semenjak ML di perbaiki jaringan malah semakin buruk sinyal sangat suka jumping, dan juga sistem kalian dalam mempertemukan tim sangat lah aneh, bukan soal sesuai rank namun terkadang ada saja player joki yg skill nya tidak sesuai pangkat yang ia peroleh,jika terus begini lebih baik kami pindah game ke sebelah","sentiment":"negatif","predict":"negatif"},{"text":"Asalamualaikum maaf saya ngatau ini bug atau gimana yang penting knp di akun saya knp hero sama sekin nya nga keliatan saya jadi sulit untuk mainin gem nya padahal saya udah douwnlod data data nya knp masih nga keliatan sekin sama heronya di akun temen saya juga kaya begitu sampe dia prustasi pindah gem ke gem garena tolong di perbaiki","sentiment":"netral","predict":"netral"},{"text":"Moonton gk niat bikin game, dapet tim gk seimbang.Tim musuh mesti pro semua, tapi tim sendiri egois banget, gk pernah bantu. Sama sinyal sering merah , pas ketemu musuh langsung ngelag giliran udah mati langsung lancar. Capek setiap main lose streak mulu","sentiment":"negatif","predict":"negatif"},{"text":"Dulu suka banget sama game ini tapi sekarang, Game ini makin di Update makin buruk,sering kali tiba-tiba lag pada saat mach apalagi pada saat masuk tower musuh atau di depan musuh pasti ngelag dan baik lagi pada saat hero kita sudah mati, dan pembagian tim nya juga sering tidak seimbang apalagi kalo solo Rank, niat mau push rank malah turun rank karna dapat tim tidak seimbang dan sering lag pada saat main.","sentiment":"negatif","predict":"negatif"},{"text":"Update apaan lagi sih ni , ini geme LEGENDA seluler, seluler bukan pc, namanya hp ruang penyimpananya lebih kecil dr pc dan yang punya hp yang penyimpanannya 6gb Ke atas gk semua orang punya ada banyak yang pensi karena geme ini update trus Sampe hp yang mreka punya gk kuat, mana maen gk hepy malah pening kepala ,Grafiknya udah bagus Jdi mohon pegertianya","sentiment":"netral","predict":"netral"},{"text":"sayangi kuota internet anda! game ini sangat seru. namun tim yang didapat ditier epic keatas sangat tidak sepadan. meskipun kamu pandai memainkan gamenya, tim yang kamu dapat adalah tim yang buruk. selalu LOSESTREAK setiap hendak naik ke tier berikutnya.","sentiment":"negatif","predict":"negatif"},{"text":"Lebih teliti lagi dong terhadap players curang yang menggunakan cheat agak kenyamanan bermain tetap terjaga. Kami yakin banyak players curang yang tidak terdeteksi moontoon","sentiment":"netral","predict":"netral"},{"text":"Tolong di perbaiki lagi untuk kami pejuang solo rank..masa ia dapat teman yang baru install game nya..kalo bisa sesuaikan teman dengan level dan juga rank biar mantap...kalo di pas in dengan rank doang kebanyakan rank nya hasil joki..kalo sesuai level dan rank pasti bisa tau kita dia pemain lama atau baru main..itu aja dulu..semoga ada perbaikan","sentiment":"negatif","predict":"negatif"},{"text":"Dark system, gak sehat buat solo player. Selalu digabungin sama tim yg beban, emblem yg ngaco, pertandingan msh sedikit, gak kompak, egois, mau begadang kayak apapun ini game rusak. Matchmaking harus lebih lama & lbh seimbang biar gak capek, buang2 waktu. Epic rank kutukan!!!","sentiment":"negatif","predict":"negatif"},{"text":"Bisa ga sih game nya dioptimalkan untuk perangkat low end seperti saya , karena game inilah yang membuat saya merasa kesal dan nyaman dalam permainan, tetapi bisakah moontod untuk optimalisasi game nya, saya sebagai rakyat kecil yang bukan sekaya pejabat menangis karena hp saya kentang dan ga bisa beli hp baru","sentiment":"negatif","predict":"negatif"},{"text":"Tolong kalo ngasih musuh sama temen yg ngotak dikit dong, masak musuh nya mythic honor, terus tim ku ada yg masih legend, tolong di perhatikan, kalo kyk gini trs yg main bakal berkurang","sentiment":"positif","predict":"positif"},{"text":"Game buruk 👎 game ngelag2 padahal wifi ku lancar, setelah update makin hancur ml ni, ngebug:pas main custom ama teman tiba2 msalah customer service. Kembalikan ml yang dulu!!!","sentiment":"negatif","predict":"negatif"},{"text":"Tolong muntun diperbaiki lagi sistem game ml ini karena setiap saya bermain saya mendapat tim yang tidak masuk akal sedangkan tim lawan pro mengapa saya kasih bintang karena game ini bikin purustasi","sentiment":"negatif","predict":"negatif"},{"text":"Ternyata Moonton lebih mengutamakan tim mabar aplg tim konten mabar apalagi kalau sudah berlanganan satelit mobile legend ketimbang tim solo player, pantesan kalau ketemu mereka jaringan kita langsung dibikin lemot mau wifi maupun kuota, sudah pasti kalah cepat dari lawan soal kill, ini sudah setingan moonton supaya mendapat keuntungan sebesar- besarnya dari mereka, karena salah satu dr mereka pernah membocorkan masalah berlangganan satelit mobile legend lewat acara tv talk show","sentiment":"netral","predict":"negatif"},{"text":"Wow game ini sangat membuat ku kesal karena game ini sangat lag padahal jaringan nya bagus dan ada dark sistem aku mohon hilang kan aku jadi kangen ml yang dulu tidak lag dan tidak ada dark sistem","sentiment":"negatif","predict":"negatif"},{"text":"Game ini memang asyik tapi sering lag bug tinggi.. Sampai game kembali sendiri.. Dan mudah dihack oleh pihak ketiga.. Terkadang saat asyik main tiba\" sdah lag\/bug dari pertengahan pertandingan sampai selesai","sentiment":"negatif","predict":"negatif"},{"text":"lu Napa dah muntun,gua kagi main jaringan bagus di bikin 248,gua di base 47,dekat musuh 278,lu kalo bikin game yg bener anj,nah itu gua tekan jaringan 248,terus yg muncul malah 70,ku bikin game yg benar woy","sentiment":"negatif","predict":"negatif"},{"text":"Sangat tidak puas,, padahal udah lama saya main, baru ini saya merasa kn sinyal yg tidak bagus, di loby jaringan bagus, begitu main pas lgi war malah ilang jaringan nya,, lama2 dari pada saya banting hp saya mending pansiun aja dari ini geme,, geme rusak,, marching pemain GK pernah di perhatikan...","sentiment":"positif","predict":"negatif"},{"text":"DARK SYSTEM aja terus sampe meninggal. Jaringan masih sering terputus. Keadilan matchmaking hanya 10% dengan diberi player yang tidak bisa main ke dalam team, padahal sudah berada di tier tinggi","sentiment":"positif","predict":"negatif"},{"text":"kenapa setelah update game jadi lag?? padahal spek hp dan jaringan saya bagus, mohon untuk kedepannya perbaiki🙏","sentiment":"negatif","predict":"negatif"},{"text":"Setiap saya menggunakan ixia selalu jump ping. Wifi aman, mabar sama teman dengan jaringan yang sama tapi hanya device saya yang lag.","sentiment":"netral","predict":"netral"},{"text":"makin kesini makin ga jlas banyak kendala y tiba2 sinyal hilang. ketika sedang main tiba² balik ke awal. bnyk lgi yg lain y bikin ga nyaman main. sangat merugikan.","sentiment":"positif","predict":"positif"},{"text":"Kocak banget sistem match maching mu moonton. Main solo tim sendiri gak ngerti draft asal pik Hero ,tim lawan malah sebaliknya. Akun yg lama gak aktif hampir 1 season lebih. Push rank nya gampang bgt naik nya wkwkw. Kalah berkali kali sekali menang dapat bot ntah siapa yg maiinin wkwk","sentiment":"negatif","predict":"negatif"},{"text":"Semakin banyak cheater ! , Tidak ada inovasi yang inovatif!, Sangat membosankan, dalam waktu dekat game ini akan kehilangan pemain nya yang sudah jelas lebih memilih game sebelah, yang fresh dan penuh pengembangan positif. Moonton terlalu berfokus pada jualan skin dan Hero 👎","sentiment":"negatif","predict":"negatif"},{"text":"Game nya asik tapi Suka negleg aneh Apalagi main rank Susah banget layar beku Patah patah gravik nya Dan suka aneh sendiri Aku mau banget fix plis moonton tolong ML Ini harus dibenarkan total karana bug nya juga banyak tiba tiba Tim kami Bodoh hancur nub Dan lawan bisa lebih hebat padahal sebelumnya lawan itu lemah dan juga karna lawan terlalu kuat jaringan suka patah -patah.... Aneh sampe aku bingung sama temen aku jadi gak main ML jadi aku mau ML dibenerin pliss banget Aku naik rank kagak naik","sentiment":"negatif","predict":"negatif"},{"text":"Mobile legends tidak ada perubahan sama sekali, makin update pun makin ngelag dan menambah memori handphone saya , tolong kurangi lag di mobile legends ini dan ini juga untuk aplikasi yang lainnya, semua aplikasi yang saya buka selalu mengalami lag parah dan saya terkeluar sendiri di aplikasi tersebut karena mobile legends , dan memori mobile legend sampai mencapai 4GB , bagaimana hape saya tidak terkena virus?, Tolong bantuannya moonton 🙏🏻","sentiment":"netral","predict":"netral"},{"text":"Plis fix bugnya : server lag, draft yg g seimbang, tier rendah lawan tier tinggi ( mytic 9 lawan mytic immortal 120 ), gacha skin terlalu susah dapetin item rare, event selalu berbayar, sistem laporan bagi pemain yang toxic serta feed masih suka g bener.","sentiment":"positif","predict":"netral"},{"text":"Saya mulai pusing memainkan game bujang ini,bisa buat emosi,apalagi punya tim seperti bot,percuma pandai klo yang lain bodoh,,sesuaikan matmacingnya moonton bujang inam,biar seru main.pgn kuhapus kadang kadang ini game.mulai bosan karena kalah trus....","sentiment":"negatif","predict":"negatif"},{"text":"waktu login jadi lebih lama dan tiba-tiba saja error lalu meminta colose dan restart game. padahal jaringan baik2 saja, sebelumnya tidak ada kendala. namun 2 hari belakangan selalu begitu. mohin ditindak lanjuti.","sentiment":"negatif","predict":"negatif"},{"text":"Untuk game bagus tapi untuk menghubungkan akun dengan moonton terdapat masalah di dalam game, yaitu ketika saya sudah menghubungkan dengan moonton itu, tetapi ada tulisan \"alamat email ini belum terdaftar\" padahal sudah saya daftarkan sebelumnya, ketika saya mengganti ke akun lain, disitulah saya tidak dapat kembali ke akun yg sebelumnya, jadi di mohon untuk kembalikan akun saya yg sudah saya rawat itu, jika pihak moonton ingin saya menunjukkan buktinya, DM ig saya @cuma_pengen_hijrah","sentiment":"negatif","predict":"negatif"},{"text":"Untuk ping game dan dark system tolong perbaiki Dapet team bagus ping tidak stabil Dapet team kurang bagus jaringan stabil Sesuaikan tier dan wr , ini terlalu buruk.","sentiment":"negatif","predict":"negatif"},{"text":"Update sekarang ini lama lama menjadi semakin buruk banyak bug, sistem tidak jelas, tidak stabil, hukuman tidak jelas, kadang dapat tim tidak seimbang. Menyesal saya bermain selama ini kalah dapat menang sedikit mohon diperbaiki sistem game ini","sentiment":"negatif","predict":"negatif"},{"text":"Game yg sangat membuang-buang waktu kita,sekali dikasih menang kalahny beruntun.sehingga waktu kita dihabiskan dgn sia-sia.lebih baik saya uninstall dan waktu saya bisa dimanfaatkan dgn hal yg bermanfaat seper main pokemon","sentiment":"negatif","predict":"negatif"},{"text":"Kalau bisa lagi ada perbaikan kasih tau,kami yang lagi push rank merasa rugi jaringan tiba tiba lag,padahal sinyal kami bagus sudah di cek pun","sentiment":"negatif","predict":"negatif"},{"text":"Aku kasih bintang 1 soalnya solo rank gak imbang banyak lose nya menang 1 kalah 4 kali menang 1 kalah 5 kali, menang 1 kalah 5 kali lagi winstreknya gak ada kena dark sistem dari monton, lama lama player mobile legends sepi pemain pada ninggalin game burik","sentiment":"negatif","predict":"negatif"},{"text":"Semenjak update kemarin sinyal jagi Mera terus dan juga dapet tim buta map gak tau arah bikin emosi hp gw juga pecah gara gara dapet tim bloyon dan juga sinyal gak dukung ayang juga gak punya uang udah habis buat top up gak bisa lagi buat kebutuhan jadi sekarang tolong di buat yang versi sederhana saja\"NGAKAK MULU LIHAT TIM BLOYON\"","sentiment":"positif","predict":"positif"},{"text":"Game nya bagus banget sampai beberapa kali mau naek tier diturunin lagi malah losestreak parah dan itu berulang juga dapat tim yang sangaaaat tolol banget. Ku harap muntun kasih tau ada masalah apa sama akun aku yang selalu di troll sama muntun. Masalah jaringan juga bagus tiap war jumping mulu dari ijo langsung merah wuuwuhuuuuuu matchmaking nya juga fair sampai setim sama bot gg banget 🤦","sentiment":"positif","predict":"negatif"},{"text":"Tolong ya ini saya kasih bintang satu karena jika update terbaru selalu mendownload ulang skin Hero event dan lainnya jika ada perubahan saya akan kasih bintang lagi 🙏🙏","sentiment":"netral","predict":"negatif"},{"text":"Pembaruan seperti interface, set emblem, atau pun revamp hero tidak diperlukan buat apa itu semua jika kalian sebagai development tidak memperhatikan matcmaking yg dibuat. Dapat tim kok mainnya sekelas epic gk ngerti apa apa dibanding tim musuh yg diberkan tim lebih baik. Jika kalian sebaai development peduli dengan playertnya perhatikan sistem matchmaking bukan malah memperbarui game dengan hal2 yg dirasa tidak perlu seperti yg disebutkan diatas. PERBAIKI MATCHMAKING MU. Cabut dari INDO aja","sentiment":"negatif","predict":"negatif"},{"text":"Aneh padahal udah update terus banyak masalah bugg Hero bulat terus padahal udah di update semua data jdi gak nyaman main game ini sampe afk 3 x kena masalah bug tolong diperbaiki lagi dari season 1 main mobile legend baru kali ini merasakan kesal dalam kendala game sekian dan terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"We moonton kasih cepat lah loading yang mau ke game play nya masa gua gak sengaja ke hps history ml nya terus login nya nah pas loading mau ke game play nya lama kali hampir 8menit pikir lahh moonton dan satu lagi masa gua chat di game gua bilang siapa yang mau coklat malah di miute salah nya di mana moonton!!!!!!?","sentiment":"negatif","predict":"negatif"},{"text":"Tolong saat sinyal merah\/kurang bgus saat permainan berlangsung jngan keluarkan dari match sebab saya coba login kembali dan ternyata saya dikeluarkan dari match padahal posisi kami udah mau menang...tlong perbaiki ini..klo mau dikasi rating 5","sentiment":"netral","predict":"netral"},{"text":"Gamenya sih jelek tapi gak terlalu pas gwe Main timnya gak sama tim musuh lebih kuat daripada tim kita gak asik kalo gini bikin males main 👎","sentiment":"positif","predict":"positif"},{"text":"Knp sih saat main kalah terus,kadang cuman mau bilang sampah terus mlh kena kata kasar pdhl terus itu kata negativ,Ama permainan selalu di ksh musuh yg di luar akal,kadang hebat,lalu tim saya malah di kasih yg buruk sedangkan yg musuh lebih hebat,dan di kasih loststreak GK pernah win streak,jadi ya kasih tim Ama musuh yg seimbang,jangan asal musuh kuat lalu tim beban,kadang dpt tim yg bodoh,Ama beban,sementara musuh malah banyak yg pro di tim saya aja kadang tdk ada sama sekali","sentiment":"positif","predict":"positif"},{"text":"Ini game terlalu besar ukuran datanya, terlalu banyak fitur alay yang ada. 1. Fitur poster di awal game yang mengganggu untuk bisa langsung ke mode game. 2. Fitur notif contest MPL, dan live stream mereka yang membuat ukuran game semakin besar, padahal live stream mereka sangat tidak penting. 3. Banyaknya player yang sengaja tidak masuk saat mencoba masuk mode game, sehingga matching semakin lama yang membuat mood bermain hilang sehingga banyak player yang auto troll, termasuk saya. 4. DSB.","sentiment":"negatif","predict":"negatif"},{"text":"Semangkin kesini semangkin buruk . Setiap Kali masuk Game Jaringan Oke Pas sudah War ping langsung naik 250ms selalu seperti itu tiap main kalau diam di base jaringan normal bagus kalau sudah maju ping langsung naik. Tolonglah devlovernya di perhatikan lagi hal² seperti ini jangan buat kami kecewa dengan game anda.","sentiment":"negatif","predict":"negatif"},{"text":"Game ga guna bet contoh Ketika kita keluar terus masuk lagi,lama bet anjir Trus kasih tim yg tolol-tolol gitu Mohon di perbaiki dark sistem nya. Game moba tolol ga ada buat nyenangin playernya dan hanya prioritaskan grafik tak jelas","sentiment":"negatif","predict":"negatif"},{"text":"Saya jujur lebih suka season 28 kemarin, knp begitu?. Karna pertandingan nya adil 5v5, jaringan juga stabill, grafik juga bagus, tapi season 29 ambles klo main sinyal 300 lebih, dapat team juga buta map, feeding secara sengaja, ngambil boff tmn sendiri, mage 2 kadang mm 3, dan tank yg gk mau bantuin mm nya parah banget gk sih. Kadang juga leg tiba2 keluar sendiri padahal sinya bagus penyimpanan juga belum penuh, pas loading lagi nunggu lama, udh nunggu lama loading udh 100 tapi gk masuk masuk,","sentiment":"positif","predict":"negatif"},{"text":"Perbaikan sinyal mohon diperhatikan kadang kadang sering stuck dan mati sendiri dituret lawan gara gara sinyal merah padahal lancar, dan lagi dapet musuh GG mulu sedangkan teman kayak g tau main ,bosen gua mvp dari tim yang kalah mulu 😪","sentiment":"positif","predict":"negatif"},{"text":"Setelah update pertemuan matchmaking yang tidak seimbang serta sinyal yang tidak stabil saat permainan Dimohon untuk Developer dibenahi jangan memfokuskan pada update grafik dan gameplay yang baru","sentiment":"netral","predict":"netral"},{"text":"Sudah lebih dari 3 hari bermain... Tapi selalu dapat tim yg BURUK sehingga menurunkan tier rank cukup jauh... Algoritma pemilihan teman setim SANGAT ANEH dan mungkin harus DIPERBAIKI.. SANGAT BURUK... Patch baru... SAMA SAJA... MATCHMAKING MAKIN PARAH... Selalu dapat tim yang tidak serius main.. dan hanya menurunkan tier...","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa abis update ini sinyal sampek 200, padahal sinya wifi enak. Ml makin lama makin gk bener. Mungkin kalo semua player unistal aplikasi ml. Buru di denger kritik dan saran kita.","sentiment":"netral","predict":"positif"},{"text":"Moonton ga jelas, ngasih buat player solo rank teman satu tim nya banyak yg tolol, ga sebading sama lawannya, terus sistem matchmaking gajelas, orang ga afk ga toxic kena pelanggaran, sama kalau main mc nyari hero seperti karina lancelot susah keluar.. sistem game gajelassssss.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong kembalikan MLBB seperti dulu yg di mana real jaringan kita yg di pakai 🙏🏻🙏🏻🙏🏻🙏🏻jangan terlalu di atur\" untuk menang kalahnya 🙏🏻 jadikan sebagai permainanan real jangan dengan aturan computer\/ dari pihak trimakasih","sentiment":"positif","predict":"netral"},{"text":"Game nya tidak dapat menstabilkan jaringan padah jaringan saya sudah bagus. Mohon di perbaiki agar pengalaman bermain lebih baik","sentiment":"negatif","predict":"negatif"},{"text":"Untuk moonton bisa minta tolong nggak soal nya banyak pemain yg pakek cheat dan itu meresah kan banget tolong lah untuk pihak moonton di perbaiki lagi banyak banget pemain yg curang,","sentiment":"netral","predict":"netral"},{"text":"Tolong pihak devolpor moonton masalah crash Sama lag dihilangin susah jaringan sama kalo upgrade jangan banyak makan ram banyak2 itu doang😭😅 match making kurang seimbang dark moonton hilangin ya.","sentiment":"negatif","predict":"netral"},{"text":"Buruk jika terus menerus memainkan ini.. Banyak ruginya..Un instal game ini ajalah.. . banyak buruknya daripada baiknya.... MANA BANYAK MINTA UPDATE MULU TAPI KUALITAS MALAH MAKIN MENURUN, NGURAS KUOTA, NGUTAS EMOSI!!! UN INSTALL mL.. Yok ah pindah..","sentiment":"negatif","predict":"negatif"},{"text":"Bukan nya di update makin bagus.iyah bagus sih bagus tapi tolong dong kondisikan sama hp hp yang ram 2\/3 mau meledak mass,lagi in game tiba² terkeluar sendiri,masuk kembali pas udah masuk kembali ke relog lagi,mau nya apa sih mas..... Baru kali ini gua benci ama developer ML, lagi main suka bagi Ter reload sendiri nya kan sakit banget itu","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah perbaiki updatetannya biar makin bagus bukan makin jelek, contoh nya di pengaturan sinyalnya. pas main rank\/cs (pas ngetap sinyal,bagus eh pas main dan mengikuti pertarungan tim sinyalnya mendadak sering merah) itu sering kali mengganggu performa main bisa² player ml pindah game atau pensi semua. Perbaiki hal kecil itu agar performa main kami makin baik, CAPEK GUA MAIN ML BUG NYA MALAH MAKIN PARAH, SETIAP WAR NGE FRAME PADAHAL SINYAL BAGUS, MAGIC CHESS JADI INVISIBLE.kecewa👎🏻","sentiment":"positif","predict":"negatif"},{"text":"Ehm........ Huh(narik nafas)..... Saya ingin adanya perubahan sistem matching yang dimana tim 1 dan tim 2 seimbang dikarenakan saya sudah muak dengan ketidakseimbangan match jadi dimohon untuk diubah sistemnya sekian dari saya dan juga perbaikan beberapa bug yg sangat mengganggu permainan","sentiment":"netral","predict":"netral"},{"text":"Season saat ini banyak banget dibiarin moonton player2 toxic,feeder dengan sengaja ,menggunakan cheat,,dan untuk update season saat ini banyak sekali bug nya,tombol yg gak bisa digerakin,Hero yg jalan sndri pdhal GK digerakin ,Hero nya gak bisa digerakin,,jaring hilang2,tiba2 keluar sndri dri pertandingan dan malah poin saya dikurangi.kedepannya tolong perbaiki lgi,,lama2 kalau gini trus ini game bisa punah banyak player yg meninggalkannya.","sentiment":"negatif","predict":"negatif"},{"text":"Update trbaru ml makin berat..sewaktu login jringan aman...tapi setelah masuk dlm game jringannya lemot kali....sering afk hanya karna jaringanya ngg stabil...plis diprhatikan. Gua kasi bintang satu krna mmng kecewa.klo gini terus bisa\" gua hapus game ini.","sentiment":"negatif","predict":"negatif"},{"text":"ini game terburuk yang pernah saya mainkan kenapa saat pangkat rank epic semua musuh menjadi pro dan tim seperti computer semua tidak seimbang yang menjadi kan lose terus menerus sejujurnya saya sudah lelah memainkan game ini, bukannya bikin senang malah bikin stres","sentiment":"negatif","predict":"negatif"},{"text":"Mobile legend sekarang makin buruk sayah kecewa makin sekarang sinyal tidak kondusif jaringan bagus normal masih ngeleg gak jelasss udh pake wifi tetep ngeleg gak jelas dikit dikit ngeleg dan makin aneh ajah gak jelas tolong perbaiki lagi kaya dulu walau jaringan sedikit jelek tapi tetep mendukung performa ini makin gak jelas makin di update tolong perbaiki","sentiment":"positif","predict":"netral"},{"text":"MONTONN.. tolonglah perbaiki sperti dulu lagi, semakin kesini semakin hancur sistemnya bikin hp rusak. kadang patah patah, kadang pula suka keluar sendiri. tidak seperti ML yang aku kenal dulu meski ram 1 LANCAR bikin tethibur.. jangan mentang mentang sudah mendunia. ingat kamu akan hanycut jika terus seperti ini.. TERIMAKASIH MONNTONG","sentiment":"netral","predict":"netral"},{"text":"Apakah tidak bisa di beri tim yang sesuai dengan skill saat matching, apakah kau ingin mencoba bermain solo dulu agar mengerti itu ? betapa benci nya saya mendapatkan musuh yang dapat bermain sedangkan tim saya sangat buruk dalam bermain","sentiment":"netral","predict":"netral"},{"text":"Game bagus namun pemilihan timnya selalu ga adil,udah main beberapa kali masih aja dapet tim trol,mending ganti game aja yg lebih menyenangkan lebih ramah","sentiment":"negatif","predict":"negatif"},{"text":"Tolong Mooton Misalnya kita afk sebentar terus login ulang di percepat masuk nya,masa saya harus nunggu sampe match selesai si, udh 5 menitan ngestuk gk masuk masuk,eh pas udah 97 malah stak,gak bisa masuk masuk sampe match selesai alhasil kalah saya pdhl awal game dh menang","sentiment":"negatif","predict":"negatif"},{"text":"Klo matchnya itu di perhatikan!!!!!!!.Masa rank ku stuck di epic terus,musuh damage gk ngotaklah,match gk seimbang gara² musuh itu sudah pernah mythic lah tim hanya epic abadi.lihatlah gue lose strike berkali² gara² match gk seimbang karena musuh juga jago² gk kyk tim woyyyy.tolong perhatikan lah.lagian aku mau ke legend aja gk bisa.klo gk mau naikkan ya gk usah pakai cara gini.dasar game bawa emosi.Dan juga Ram yg di butuhkan cukup banyak,saya hanya ram 3 dan itu sudah habis karena game ini.","sentiment":"negatif","predict":"negatif"},{"text":"Pihak moonton yg terhormat saya sebagai pemain ml kok ad bug lag dan saya dikasih temang random yg ngetrol dan musuh saya seperti pro player dan teman saya cuma menjadi beban tolong d perbaiki mohon bantuannya","sentiment":"negatif","predict":"negatif"},{"text":"tolong di perbaiki lagi bagi saya ini sangat mengganggu saat bermain jaringan wifi lancar buka apk lain lancar kenapa pas buka ml malah pinknya naik turun tolong di perbaiki lagi sebelum saya sudah malas bermain game jika ada pelanggan tidak di hiraukan seperti ini","sentiment":"negatif","predict":"negatif"},{"text":"Untuk hal yg lain sudah mulai bagus kecuali pemasangan tim dan jaringan yg sering loncat loncat (ijo ke merah setiap 1 detik sekali ketika didekat musuh) mohon di fix","sentiment":"netral","predict":"netral"},{"text":"Untuk grafis bagus, tapi jaringannya mohon diperbaiki lagi, padahal jaringan bagus tapi lag, trus saat pesan maaf lag malah jaringan bagus yg di liatinnya padahal ping saya merah, trus sistem moonton tuh tolonglah diperbaiki jangan kasih tim yg jelek mulu, sekali menang gw maen malah lose muluu, katanya adil tetapi tdk","sentiment":"netral","predict":"netral"},{"text":"Tolong dong monton kalau kasih tim berotak sedikit sama kasih musuhnya yg setara lah monton.... Gimana gak player ya banyak pada pensi , sekarang aja player ya pada nuub semuanya sedangkan musuhnya pada pro","sentiment":"netral","predict":"negatif"},{"text":"Moonton lu bisa jadi developer yang baik gak katanya update sekarang akan di benerin draft picknya akan di di benerin timnya, nyatanya apa 1 tim user mm semua apa coba lu mau gua turun apa gimana susah naiknya mudah turunnya, udahlah terserah lu moonton gua gak peduli untung aja lu punya game bagus gak bakal di hapus! 😡😡😡😡😡 Mampus lu di kasih rating rendah tapi tetep aja gak di hapus gamenya ngasih rating rendah doang","sentiment":"negatif","predict":"negatif"},{"text":"Game nya tambah lama tambah membosan kan Main nya sering gk se imbang Dark sistem gk ngotak Makin hari makin nge lag Selalu dapat tim yg pertangan nya sangat sedikit Buat yg update kasih bintang satu aja ini game Biar ada perubahan Kalo gk gitu dia gk bakal berubah","sentiment":"negatif","predict":"negatif"},{"text":"woi perbaiki lagi Kon... Sistem nya rusak ini game dalam match dah lah intinya an...g untu yang punya game ini udah lama gw main perasaan dulu ga begini game skrg malah rusak","sentiment":"negatif","predict":"negatif"},{"text":"Permisi moonton yang terhormat Saya ingin memberi saran untuk kenikmatan dan kenyamanan permainan semua player.Saya minta tolong hukuman untuk player yang ngetrol dan afk itu ditambah supaya memberikan efek jera bagi mereka karena perilaku mereka sangat merugikan dan mengganggu kenyamanan lingkungan permainan.","sentiment":"netral","predict":"netral"},{"text":"Game yang tidak kompetitif lose streak manjang, antara tim dan musuh bagaikan langit dan bumi tidak ada keseimbangan dalam pemilihan tim dan musuh yang merata selalu musuh yang lebih unggul dari pada tim. Kenapa selalu begini game gak jelas","sentiment":"negatif","predict":"negatif"},{"text":"tolong lah dev, kalau mau mulai game tidak usah kebanyakan mulainya, mulai game ke1, mulai game ke2 trrus ada lagi masuk ke3, belum lagi nunggu waktunya apa gunanya itu, cukup 2 langkah aja, mulai game ke1 n mulai game ke2, kalau orang mulai game sampai yang ke2 itu bearti sudah pada mau main,orang yang mau batal tinggal tekan batal tanda di atas x, thx","sentiment":"negatif","predict":"negatif"},{"text":"game nya bagus,update juga terus menarik tapi dari dulu sampai sekarang masih eneg sama masalah jaringan di game ini, padahal sinyal sedang lancar tapi sinyal tiba-tiba hilang dan beberapa kali saat inmatch atau draft pick sering tiba-tiba kembali ke lobby dengan masalah jaringan terputus, mohon segera diperbaiki untuk kenyamanan player kedepannya 🙏","sentiment":"negatif","predict":"negatif"},{"text":"awal nya sih enak buat pus reng tapi lama kelamaan jadi susah buat pus reng soal nya tim musuh makin jago sedang kan tim kita gk dan buat kalian jangan coba coba donlot mobile legends kalo kalian gk emosi ni gem bikin semua orang emosi soal nya gk fer kalo kasih musuh nya jago tim kita malah gobok gk bisa main","sentiment":"positif","predict":"negatif"},{"text":"makin buruk ajaa ini dari penyeimbang match nya dark sistem ajaa truss, update jangan cuma skin, event, sama hero, tapi update juga penyeimbang match sama ke stabilan jaringan, biar player kecil seperti saya bisa nyaman main ini game, lama² klo dark sistem mulu player kecil pada pensi #darksistembadjingan","sentiment":"negatif","predict":"negatif"},{"text":"Game bagus tapi banyak bug nya, match making kadang suka gajelas (dark system). Mohon kedepannya untuk diperbaiki masalah bug dan match makingnya, biar nanti saya rubah kembali ulasan saya.","sentiment":"negatif","predict":"negatif"},{"text":"Kecendrungan untuk mengahiri hidup rupanya bisa naik, frustasi, ambisi menjadi alasan betapa buruknya sistem yang mempermainkan pemain, 8 jam waktu yang terbuang hanya berbuah 1 bintang, ya.. ambisi memenangkan sebuah pertandingan berbuah rasa frustasi, putus asa, kesal dan emosi yang meledak-ledak. Kalah adalah hal biasa, lalu bagaimana dengan permainan yang pernah terlihat rasa keseimbangan, game yang berlalu sangat cepat dengan kekalahn.","sentiment":"negatif","predict":"negatif"},{"text":"Kecewa sama mathcing nya, kalo maen solo sering dapet player yang kapabilitasnya rendah, sangat2 merugikan, bikin rugi, jadi beban, bikin kesel, emosi, dapet player2 ga bisa maen, ga sesuai tier, bikin emosi Baru maen LG, tier mitik, dpt tmn maen epic beban banget, kira2 lah kalo match making, laju dikasih tim nub, lawannya ga imbang, kalah lah","sentiment":"positif","predict":"negatif"},{"text":"Udh kalo ga niat ini buat apa di update kalo ujung ujungnya sinyal masih jelek kalo update itu yg sesuai dong bukanya sinyal nya bagus malah lag hdehh gak niat ni ya gw main lag melulu","sentiment":"positif","predict":"negatif"},{"text":"Ping sangat tidak stabil selama pertandingan, padahal sinyal bagus. Ping naik turun parah, Wifi atau data seluler hasilnya sama. Padahal di pake untuk nonton Youtube atau aplikasi lain lancar, tapi main ML malah parah. Ayodong, kapan mau di beresin Servernya, masa main di jam prime time, setiap jam 18.00 - 23.00 ping gak stabil, masa harus main tengah malem terus?","sentiment":"positif","predict":"positif"},{"text":"Selalu dapet tim bot sedangkan musuhnya diluar nalar, ga seimbang akhirnya losetreak gara\" dikasih musuh yang jagonya ga ngotak. sebelum update baik\" aja tpi kok pas udah update makin aneh ya, sinyal tidak stabil padahal lancar\" aja. Selalu ngelag padahal sinyal hijau. Apalagi banyak bug. Kacau, Makin update makin hancur. Tolong diperbaiki.","sentiment":"netral","predict":"netral"},{"text":"HAPUS DARK SYSTEM ga jelas banget item udah bener tapi musuh bisa immune dmg, immune CC, efek item tidak sesuai dengan deskripsi... Hero terlalu banyak ketidakseimbangan, banyak convert² ngga jalan, musuh gapake item slow bisa nge-slow, yang paling aneh darah sama-sama sekarat musuh bisa regen padahal gaada atribut regen\/lifesteal\/spellvamp","sentiment":"negatif","predict":"negatif"},{"text":"Aku kira aku doang yg sering lag kalau main,ternyata pas aku baca ulasan hampir semua bahas jaringan,tolong lebih diperhatikan lagi masalah jaringan,aku udah pake Wifi+data tetep aja sering kena pelanggaran,untuk skin,hd,udah bagus,cuma kalau bnyk skin tapi jaringan notwork ya percuma.","sentiment":"netral","predict":"positif"},{"text":"Game bosok, skin ae muncul terus tapi draft system gk pernah dibenerin, mana skrng gk dpt kompensasi lagi, masak dpt team afk apa ngetroll tiap di laporin cuma kena peringatan doang gk di tangani, apalagi kalo kalah , kita yg mvp aja kadang masih turun bintangnya. Emng udh gk jelas ni game, skin ae rilis mulu system eror mulu ,kimak","sentiment":"negatif","predict":"negatif"},{"text":"Sistem matchmakingnya tidak sesuai masa musuh-musuhnya lebih hebat daripada teamnya aku, mohon segera di beberkan jangan mikiri update Hero sama grapik mulu ,kita butuh gameplay bukan grafik","sentiment":"netral","predict":"netral"},{"text":"Tolong lah moonton saya sudah download full data kok malah kehapus sendiri data skin yg ada? Katanya data skin yg jarang digunakan telah dihapus oleh fitur hapus otomatis Jadi harus ulang download lagi deh kontl Fitur ga guna nyusahin aja udh download malah kehapus sendiri👎","sentiment":"positif","predict":"netral"},{"text":"Tolong kembalikan emblem yang dulu sistem pembentukan emblem yang sekarang gak berguna sama sekali. Permasalahannya jika ganti item yang kita inginkan malah gak ada damagenya padahal emblem udah saya atur sebagus mungkin tapi pas ganti item sedikit aja malah gak ada damagenya. Please kembalikan pengaturan emblem yang dulu🙏","sentiment":"netral","predict":"netral"},{"text":"kenapa ini ga bisa download ml?pdhl sy dlu udah pernah instal ml cuma sy hapus dan skrg sy mau download lagi tpi ga bisa padahal memori tidak penuh dan sinyal juga bagus tolong di perbaiki🙏","sentiment":"netral","predict":"netral"},{"text":"Game nya makin jelek pas di-update sistem nya kalah menang Mulu,banyak yang troll,musuhnya jago semua,banyak yg ego,iklannya bikin cringe,pokoknya kalau gamau stress jangan download deh☕🗿 Edit:kalau ada update bukannya ditingkatin malah dikurangi Edit:game GAJELAS","sentiment":"negatif","predict":"negatif"},{"text":"Game buruk, system matchmaking game paling buruk yg pernah ada, penyeimbangan tim tidak setara. Setelah win 1x selanjutnya pasti lose 2x atau lebih, stuck dan terus berputar\" seperti itu. Jika tidak ada perbaikan mengenai penyeimbangan matchmaking, game ini akan menjadi game moba dengan matchmaking terburuk yang pernah ada.","sentiment":"negatif","predict":"negatif"},{"text":"To:Developer MOONTON ada satu hal yangembuat saya sebagai player setia mobile legend sangat kecewa dengan mobile legend sekarang,(disaat saya mau main,dibagian matchmaking(menunggu pemain pencet mulai)estimasi waktunya selalu diatas perkiraan,dan yang lebih parahnya lagi,tiba² saya langsung kembali ulang kedalam lobby,saya diban darimatchmaking karna tidak siap,padahal layar tekan tombol mulainya nggak muncul dan score credit saya otomatis berkurang,saya merasa dirugikan,(TOLONG JAWAB)!!!!!!!!!","sentiment":"netral","predict":"netral"},{"text":"Anyim lah, makin kesini makin burik. Mau di update kaga muncul2, gw nunggu 2 minggu kaga muncul juga update. Gw mau update lewat buka mlbb malah terus berulang2 resource 100% - 160 % Gw dah coba hapus - instal tetep sama. Ini gimana sih moonton systemnya? -_- Sinyal gw on dan bagus pake banget!!!!!! Yg gw kaga paham kenapa sering bug tiap kali gw menang tpi kaga ad penambahan bintang. Ni montoon gimana si?","sentiment":"netral","predict":"negatif"},{"text":"Gamenya lemot masalah pada jaringanya masih belum di pebaiki, dan magic chessnya sangat buruk sekali karena combo yg mau di bikin presentase heronya muncul sangat kecil padahal tidak ada yg bikin combo yg sama","sentiment":"positif","predict":"netral"},{"text":"gajelas bener game rusak, klo pake hero tertentu pas login ke ingame tu pasti overclose trus pas relog stuk di loading screen, abis itu ga lama over close lagi, tolong lah di fix, ini sangat mengaggu karna saat afk kredit skor saya berkurang, jika tidak segera di fix khawatir nya ini akan menjadi penyebab game ini hancur","sentiment":"negatif","predict":"negatif"},{"text":"Kembalikan sinyal seperti dahulu lagi ,ini gimana ini sinyal semakin burik (buruk) padahal udah pakai data + WiFi masih tetep aja.","sentiment":"netral","predict":"netral"},{"text":"Moonton hapus dark system lu kalo lu ga mau game lu mati, jaringan tiba tiba lag terus pas dah mati baru lag nya selesai, gua dapet tim yg ga ngerti main mulu, tapi, musuh nya jago semua, kalo gua kalah sekali lagi gua hapus nihh mobile legend","sentiment":"negatif","predict":"negatif"},{"text":"Gua keluar sendiri dri game dan gak mau masuk lagi ke in game setelah update.trus gua yang di ban.gua udh coba masuk make sinyal sendiri make wifi tetep gak bisa masuk eror mobile legend","sentiment":"negatif","predict":"negatif"},{"text":"Pada saat matchmaking atau masuk dalam pertandingan dikasih tim yang bodoh dan tim musuh pinter dan akhirnya kalah terus menerus dan tidak sekali dua kali bahkan 10 kali lebih, dikasih tim bodohh dan menjadi tidak seimbang saya benci itu bukannya push rank makin nambah bintang malah tetep aja bahkan bisa berkurang bintang, tolong pihak moonton BACA!!! saya kesel dengan game BUSUK ini tolong diperbaiki!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Mohon untuk moonton, di update lagi sistem match nya saya selalu mendapatkan tim yang tidak berguna di setiap pertandingan, Padahal saya sudah berusaha semampu saya untuk memenangkan pertandingan tetapi tetap saja kalah Karena mempunyai tim yang tidak berguna, Padahal tim lawan sangat kompak di awal pertandingan sampai akhir pertandingan, mohon sistem match nya di update lagi untuk kedepannya.","sentiment":"netral","predict":"netral"},{"text":"Untung moonton yang terhormat, tolong perbaiki bug yang ada di dalam game Mobile Legends. Terutama bug yang sering terjadi saat ganti akun Original server ke original server yang dimana download datanya udah 100% diulang menjadi 90% atau terkadang menjadi 80%, 70%, dan lain lain. Hal ini tentu saja cukup sangat merugikan bagi player Mobile legends yang dimana mayoritas playernya memainkannya dengan menggunakan data seluler daripada player yang menggunakan WiFi. JADI TOLONG PERBAIKI BUG INI.","sentiment":"positif","predict":"negatif"},{"text":"Game yg tidak adil,bahkan di mythical glory sistem memberikan tim bodoh dan musuh yg hebat. Dan kebanyakan player bodoh tersebut berasal dari Jawa terutama, tolong minimalisir untuk mempertemukan Tim Jawa pada sy.","sentiment":"negatif","predict":"negatif"},{"text":"Halo monton.Saya sebagai player mobile legends sangat kecewa dengan matchmaking yang kalian berikan.Saya sangat kesulitan bermain di epic setelah season datang.Saya bosen dari mythic ke epic gitu gitu terus tolong lah monton kalau bisa jangan ke epic lagi yah minimal ke legend gitu oke monton.maaf ya saya blum bisa kasih kalian bintang 5 karena saya kurang puas dengan matchmaking yang monton berikan.dan kenapa darksistem masih ada hay monton.Saya lelah bermain dengan player epic yang lainnya.","sentiment":"positif","predict":"negatif"},{"text":"Gimana ini woy. Waktu matchmaking di screen ku kok ga ada. Adanya yang menghitung. Habis itu tiba2 kena pelanggaran karena ga pencet siap. Padahal di screen ku gada matchmaking nya. Tolong moonton di perbaiki. Bener2 merugikan saya, saya jadi gak bisa main rank karena kredit skornya kurang. Dan itu udah berkali-kali. Saya udah coba relog, install ulang. Habis itu report bug tetep aja gak ada perubahan.","sentiment":"negatif","predict":"negatif"},{"text":"Server sering down kalau habis update an jadi kalau maen terganggu, sampe sampe g bisa login padahal internet stabil. Kalau mau rating tinggi minimal game bisa dimainin lah kocak","sentiment":"negatif","predict":"negatif"},{"text":"Sdh kyk game sampah aja ni mobile legend...main game apa aja berjam2 gal pernah nge lag2....ini main baru 1 permainan nge lag nya sdh bekali2. Bego banget ini game..gw uninstall sekalian.","sentiment":"negatif","predict":"negatif"},{"text":"Moonton mmg pinter bikin player sllu aktif, 2 kali bikin Victory sisanya itu dibuat lose strike !. Buat player lain yg tiba² mengalami signal lose saat udah mau victory, jgn heran itu sudah menjadi kewajiban moontoon menerapkan dark system ! Dark system kalian udah kelihatan banget. saran aja next dark system nya di bikin halus dikit biar player baru pingin top up.","sentiment":"positif","predict":"negatif"},{"text":"Moonton kasih dong tim yang bagus ini main tim sekali jelek,, jelek terus kalo buat game di pentingin dulu yang lain bukanya update terus masa match making jelek tapi kualitas bagus buat apa gitu tim juga ga support bgt dan cmn sok bisa tolong deh monton kalo untuk anak di bawah 20 tahun batesin pemakainya pakai notif kah ato apapun itu yang penting ngasih tau kalo batas waktu tolong moonton benerin tentang game nya dulu bukan nya malah update terus game bagus cuman pas main apakah kalah terus","sentiment":"negatif","predict":"negatif"},{"text":"Data udah di download semua pas masuk game hero nya malah bulet bulet, udah relog, udah mulai ulang hp masih ttep bulet di game. Gimana ini moonton!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Alasan saya memberi bintang 1 karena setiap saya main ngelag mulu pas ada musuh lagi padahal sinyal wifi saya bagus main game lain knp setiap saya main clasic atau rank lag mulu tolong perbaiki lagi","sentiment":"negatif","predict":"negatif"},{"text":"pengalaman bermain yang sangat buruk, saya sering mendapatkan tim yang tidak objektif, bahkan sering mengalami bug. Yatim piatu kau monton anjingg","sentiment":"netral","predict":"netral"},{"text":"Tolong depvolepor moontoon gamenya abis di update di benerin laa masa tiba ngelag padahal udh mau end game kan aneh tiba \" di ripot bukan pelanggaran chett jaringan stabil tolong di perbaiki kolo gk lebih baik Apus aja gamenya karena sudah tidak menarik seperti dulu","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya seru sih tapi sering suka error terus patah patah padahal mah jaringannya bae bae ajah terus juga kenapa kalo rilok suka lama banget sih pliss tolong dong monton di perbaiki lagi yah biar tambah seru lagi maaf yah aku kasih bintang 1 dulu kalo dah kaya dulu lagi aku kasih bintang 5 deh","sentiment":"netral","predict":"negatif"},{"text":"Tolong pihak moonton diperbaiki dalam segi pertandingan musuh dapat team yang bagus sedangkan team sendiri gak seimbang banyak sekali keluhan dan rata rata di tim sendiri ada yang troll lah ada yang rank nya mytic tapi gak sesuai dengan skill nya banyak akun akun hasil joki bertebaran yang membuat pertarungan di land of down gak seimbang sama sekali Jangan hanya menaikan grafik dll tapi juga perhatikan player player kecil kecil yang pengen fun bermain tapi malah emosi hanya karena oknum bodoh","sentiment":"negatif","predict":"negatif"},{"text":"Game yang tidak ramah seluruh player nya rata - rata toxic semua, saat gamplay juga tidak sebanding pada tim saya dan tim musuh. Contoh Team saya pada bot dan team musuh jago - jago. Jadi bagai mana ini. Tolong moonton di perbaiki sistem nya agar tidak ada player yang di rugikan Terimakasih🙏","sentiment":"negatif","predict":"negatif"},{"text":"bintang 1 karena sy trauma stuck EPIC banyak yang ngetroll, buta map, kalo bisa map-nya digedein lagi, biar para player yang masih GM dan EPIC itu sadar kalo dipojok kiri atas ada map nyempil dan kecil, sy juga ingin memukul moonton karena selalu mendapatkan musuh yang tidak setara dengan sy, sedangkan tim sy yg sangat begitu Tolol, dan sy ingin menegaskan ke moonton bahwa mantan mantan player rank tinggi jangan diadu dengan org org yg tolol sy losetreak gara gara anda padahal sdh mau naik rank","sentiment":"negatif","predict":"negatif"},{"text":"Game yg sangat tidak adil, 10 kali lebih saya dapet tim bot dari mytic sampe turun ke legend 2, apakah itu yg namanya game moba, bukan sekali 2 kali saya dapet rim gitu terus, setiap season pasti dapet tim bot terus","sentiment":"negatif","predict":"negatif"},{"text":"Game ini sangat seru, aku jadi ingin main game setiap waktu dan bolos sekolah. Aku sangat suka game ini, player nya ramah. Moonton juga sigap menghukum player yang berkata kasar didalam game. Tolong moonton yang baik beri saya skin epic gratis agar saya kelihatan jago, dan tidak beban. Klo dikasih skin gratis saya kasih bintang 5.Buat kalian yang belum mengdonlot Mobil lejen segera donlot, klo gk kalian bisa rugi karena keseruan bermain game ini","sentiment":"negatif","predict":"negatif"},{"text":"Plis lah moonton padahal game nya seru tapi gw jadi malas main karena dark System moonton,game nya tidak adil masa saya selalu dapat tim yang tidak seimbang dengan tim lawan,sedangkan tim musuh jago parah,ayolah moonton saya selalu losestreak jadi stress perlahan\" saya mulai bosan dengan game Mobile Legends karena sistem matchmaking yang tidak adil,saya hanya butuh tim saya seimbang dengan tim lawan🙏","sentiment":"negatif","predict":"negatif"}]