[{"text":"Update ke Next For II nya jelek sekali! Lagi enak² main malah keluar dan restart ke awal fan banyak bufferingnya!!! Paraaahhhh!!!","sentiment":"positif","predict":"negatif"},{"text":"Tolong monton •contoh akun tidk normal|T i n a <3|• akun yg kaya gini pertandingan baru sedikit udah metik akun nga normal di Ben aja permanen akun instan merusak player metik asli. Jadi permainan tidk adil dan tidak nyaman.","sentiment":"positif","predict":"negatif"},{"text":"Game Rusak lama2. Dri kmrin login ga bisa2 katanya gegara jaringan. Jaringan bagus2 aja. Sampek aku ikut tutorial di Youtube tetep ga bisa. Akhirnya ku install ulang kupikir emang cara satu2 nya ya itu. Eh ternyata tetep aja ga bisa. Game rusak.","sentiment":"negatif","predict":"negatif"},{"text":"game nya bagus grafiknya juga udah bagus tetapi saya saat bermain tim saya sangat bodoh dan buta map tetapi tim musuh saat saya menyerang turret langsung menyergap dan karna itu saya selalu kalah dan rank dan bintang saya selalu turun saya hanya ingin naik rank bukan turun rank saya selalu seperti itu setiap machmaking musuh selalu tidak adil saat saya menang 2 kali saja tetapi saat kalah sangat banyak saya juga ingin rank saya tinggi tolong berikan saya lawan yang adil saya sebenarnya bosankala","sentiment":"negatif","predict":"negatif"},{"text":"Kalau bisa lagi ada perbaikan kasih tau,kami yang lagi push rank merasa rugi jaringan tiba tiba lag,padahal sinyal kami bagus sudah di cek pun","sentiment":"negatif","predict":"negatif"},{"text":"Ketika main tiba-tiba ping merah padahal jaringan bagus, seperti ada data yang diunduh oleh Game Mobil Legend itu sendiri ketika bermain dan bikin jaringan lag. setelah selesai main, ping hijau kembali. Seperti sudah diatur tim mana yang akan menang oleh moonton!!!","sentiment":"positif","predict":"negatif"},{"text":"Game burik bersyukur sudah tidak banyak yg pake,makanya benerin sistem nya,kasih team yg bego terus main solo rank,belum klau war lag lag lag sudah g enak g nyaman main game laknat ini,hapus aja game ini teman2 sudah g seru","sentiment":"negatif","predict":"negatif"},{"text":"Saya mempunyai keluhan ya itu 1. musuh dan tim kita tidak seimbang 2. Tim yang tidak bisa bermain di tier grandmaster tolong di perbaiki","sentiment":"netral","predict":"negatif"},{"text":"Parah gamenya. Tidak ramah untuk hp yang kuarang kuat.. saya push rank dengan hp Wiko 4 lite.. game nya suka keluar sendiri.. sehingga saya di banded 24 jam..","sentiment":"negatif","predict":"negatif"},{"text":"Abis update malah makin kacau, selama instal game ini, baru hari ini ngalamin hal aneh, tadi barusan saya main mode ranked, hasilnya victory, tpi blm balik ke lobby tiba² jaringan terputus, padahal jaringan di hp aman, trus pas balik ke loby, bintang nya ga nambah, pas cek history juga gak ada, tapi pas cek replay, kok ada hasil pertandingan terbaru nya, makin lama makin aneh ini, bukan makin maju malah makin bobrok sistem nya!","sentiment":"negatif","predict":"negatif"},{"text":"Untuk ping game dan dark system tolong perbaiki Dapet team bagus ping tidak stabil Dapet team kurang bagus jaringan stabil Sesuaikan tier dan wr , ini terlalu buruk.","sentiment":"negatif","predict":"negatif"},{"text":"Montoon tim nya jelek semua aku lostreek 20 kali tim beban capek moonton lostrek terus. Aku solo player masa main 4 jam lostrek terus capek moonton. Gamenya bikin stres dengan tim yang jelek semua. Untuk solo player main nya jangan main. Game ini karena saat kalian ingin menaikan tier kalian akan di kasih sistem drag moonton","sentiment":"negatif","predict":"negatif"},{"text":"benerin match makingnya,tim musuh sama tim sendiri tidak seimbang,dan saran aja kalau bisa fungsi mute chat itu tanda² berkumpul dll jangan ikut mati.","sentiment":"netral","predict":"negatif"},{"text":"Ngotak dikit lah kalo ngasih tim,yang gw dapat defeat mulu,kredit skorku pun aman 110 dan yg gw dapat cuma losestreak mulu,rugi duit gw cuman buat top up game mati suri game gj yang dikembangin cuma skinnya bukan playernya,game itu have fun bukan bikin stres","sentiment":"negatif","predict":"negatif"},{"text":"Gamenya sering tidak stabil koneksinya membuat saya kalah terus saat ingin menang ini yang membuat saya kesal dan MMR ku turun karena masalah ini jadi tolong stabilkan koneksinya","sentiment":"netral","predict":"negatif"},{"text":"Apa ini tbtb ngelag dlm game ga bisa gerak padahal jaringan bagus, dan pas dicoba login ulang malah kga bisa coba diperbaikin lagi ni ga bagus bgt","sentiment":"negatif","predict":"negatif"},{"text":"Hebat ya sistem montoon giliran gue main pas banget ngasih tim yang lemah sedangkan tim lawan jauh lebih jago dan itu bukan hanya sekali main bahkan hampir setiap main pasti saya di kasih tim yang lemah bayangkan menangnya 2 kali kalahnya 10 kali sampek 5 kali mau naikin susah giliran kalahnya gampang maksut lo apa sih montoon bisa mikir enggak sih gimana susahnya naikin rank sampek gak tau lagi gimana caranya main supaya menang berbagi usaha telah di lakukan tetep di kasih tim lemah","sentiment":"negatif","predict":"negatif"},{"text":"Update apaan lagi sih ni , ini geme LEGENDA seluler, seluler bukan pc, namanya hp ruang penyimpananya lebih kecil dr pc dan yang punya hp yang penyimpanannya 6gb Ke atas gk semua orang punya ada banyak yang pensi karena geme ini update trus Sampe hp yang mreka punya gk kuat, mana maen gk hepy malah pening kepala ,Grafiknya udah bagus Jdi mohon pegertianya","sentiment":"netral","predict":"negatif"},{"text":"Tolong dong jangan di update besar besaran hp saya hp kentang ram 2 saya udah lama suka game anda saya udah sering top up Dan game nya sih bagus tapi tolong kasih tim nya yang sesuai dengan tim lawan","sentiment":"negatif","predict":"negatif"},{"text":"Kepada moonton yg terhormat.....please lah sistem matching diperbagus masa solo ketemu duo feeder Mulu....cape solo ranked Kalo begini terus......satu lagi perbaiki lagi sistem lapor masa gw yg di Ganking sama musuh...yg dibilang feeder Ama sistem ngak jelas gitu *Edit : moonton kontl...","sentiment":"netral","predict":"negatif"},{"text":"Salah satu game yang paling bikin stress doang dengan matchmaking yang gak sesuai ,skill musuh di atas skill tim sendiri Banyak nya orang yang troll. Dan juga kalo memberikan hukum yang jelas ,jangan cuman hukuman berat?? Hukuman berat apa .Tolong jelaskan apa yang di maksud hukuman berat dan dalam bentuk apa","sentiment":"negatif","predict":"negatif"},{"text":"Tolong moonton. Bikin game buat bikin orang refreshing happy. Ini mala bikin stress ngk masuk akal ketemu sama orang2 tolol.. game asuu.. rating gamemu sudah jelek, perbaiki lah masuk akal dikit kalau dapat rekan tim. Tiap naik bintang sdh 5 ketemu sama teman2 tolol terus turun lagi smpe bintang habis. Lu sistemx gimana?? Pengen orang main terus, tapi cara sistemnya bodohhh","sentiment":"positif","predict":"negatif"},{"text":"Matchmaking gagal terus, sedangkan game sebelah matchmaking tidak pernah gagal, tolong tim nya diperketat soalnya tim yang saya dapat selalu membuat masalah","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal nya jelek mulu, padahal baru beli data, makanya aku kasih bintang 1 🌟, tolong dong sinyal nya di kondisikan,jadi males kalo main , sinyal nya jelek mulu","sentiment":"positif","predict":"negatif"},{"text":"Sistim kalian kayak apa woiii.. Masak sinyal bagus ngadat... Ngelek terus, biar kalah... Gak fair cara kalian... Seharusnya kemenangan itu sesuai dengan skill player itu, bukan d tentukan oleh sistem... 👹👹👹😡😡😡😡","sentiment":"positif","predict":"negatif"},{"text":"Tolong diperbaiki lgi beda kek dulu skrng mah pas lagi maen suka patah\"gak jelas padahal sinyal bagus sekian dan terimakasih mohon maaf bila ada kata\"yng kurng berkenan 🙏","sentiment":"netral","predict":"negatif"},{"text":"Kecewa gua sama moonton kenapa setiap maen tiba-tiba ngelag padahal pake wifi pas di cek jaringan bagus,tapi begitu in game jaringan ngelag tolong di perbaiki bug nya","sentiment":"negatif","predict":"negatif"},{"text":"Kadang badmood mainnya aplagi rank,karena kita main jago tapi ketemu tim yang kyk baru bljr maen alhasil kalah sedangkan tim musuh pada jago, harusnya bisalah menyatukan tim dengan player yang jago maennya biar tim seimbang ini kyk pilih kasih","sentiment":"positif","predict":"negatif"},{"text":"Bintamg satu karena gua main game lain tapi muncul terus iklannya padahal gua udh ada gamenya terus detik nya lama banget 42 detik lama gua nungguin developer idiot","sentiment":"negatif","predict":"negatif"},{"text":"Game ini bikin kesel doang main satu team ataupun solo tetep aja lawan nya susah , di tambah main magic chess udah dapet Hero nya susah synergy udah lengkap masih aja kalah ancur game ini sangat mengecewakan","sentiment":"positif","predict":"negatif"},{"text":"Jaringan ping bagus, mode speed aktif, masa gk stabil jaringannya, trus suka masuk dark system, makin hari makin ngelawak aja moonton🤦‍♂️","sentiment":"negatif","predict":"negatif"},{"text":"Kenapa akhir akhir ini Jaringan gak stabil naik turun. USAHAKAN PERBAIKI JARINGAN bukann fitur fitur. susah mainnya klo jaringan naik turun.. AUTO UNISTAALLLL","sentiment":"netral","predict":"negatif"},{"text":"Knp speed hero nya makin lambat setelah update ya, apa lagi selena padahal speed selena mayan cpeat lo kok ini mala lambat banget jalan nya, ke bap ungu aja kadang blum muncul udah sampai di ungu, ini ungu udah aktif ungu nya bari selena nya sampai kasi bintang 1 dah klo gitu plis makin update jg dapat tim gajelas plis kasi imbang dikit la klo kasi tim random tu ini bodo semua di kasi gmna sih, cape naikin mala di turunin mana klo los, los nya ga berhenti² sampai rank turun apa la gini ni","sentiment":"negatif","predict":"negatif"},{"text":"Update nya gak enak makan ram banyak,dan makin buruk pengalaman makin gak seru, bukan nya bikin stres hilang malah nambah stres sama updat nya yg gak ngotak","sentiment":"netral","predict":"negatif"},{"text":"Permisi moonton yang terhormat Saya ingin memberi saran untuk kenikmatan dan kenyamanan permainan semua player.Saya minta tolong hukuman untuk player yang ngetrol dan afk itu ditambah supaya memberikan efek jera bagi mereka karena perilaku mereka sangat merugikan dan mengganggu kenyamanan lingkungan permainan.","sentiment":"netral","predict":"negatif"},{"text":"Sistem matching tidak sesuai dengan skil player solo. Masa mytik 1 ketemu legend V Tolong benerkan sistem matching anda montoon!!! Perbaiki sinyal untuk penggunaan data seluler, akhir² ini setelah update makin lag dan tidak stabil saat bermain di in-game jaringan sangat buruk dan membuat gameplay menjadi ikut buruk!","sentiment":"netral","predict":"negatif"},{"text":"Gamenya sih jelek tapi gak terlalu pas gwe Main timnya gak sama tim musuh lebih kuat daripada tim kita gak asik kalo gini bikin males main 👎","sentiment":"positif","predict":"positif"},{"text":"Game nya emang lumayan seru, tapi main sering banget dapet tim nya ga seimbang, udh suka nglag padahal jaringan bagus, ngebug juga iya, monton kamu nyebelin:(","sentiment":"negatif","predict":"negatif"},{"text":"Montoon kalo update tuh jangan besar banget kesian yang ram hp nya cuma 2 nanti kan banyak yang gk pada mau main ml klo ram nya besar, terus kalo lagi main tim nya tuh harus sesuai merata, aku kasih bintang 1 dlu deh","sentiment":"positif","predict":"negatif"},{"text":"Matchmakingnya benerin lagi, ga ngotak matchmakingnya, kalo emang ga mau darah tinggi saya saranin deh jangan maenin ni game, gajelas bikin stres, matchmakingnya ga bener, kena dark system' terus","sentiment":"negatif","predict":"negatif"},{"text":"Game Sampahh!! Semakin Update bukanya semakin seru kebanyak Update ke skin sampai sistem matchmaking aja ga di perbaiki.MALAHAN DI kasih Tim Bot Musuh nya jago jago. Ayolah montoon tolong Update matchmaking yang bener lama lama Gak betah orang main nih game Sumpahh.dengan game play yang gak seimbang dari musuh sama tim hadehh.","sentiment":"negatif","predict":"negatif"},{"text":"Game nya udah mulai rusak moonton dari pada Lo memperbarui even2 trus lebih baik Lo perbaikan game nya banyak yang bag masak dari dulu masih gitu aja walaupun grafik nya bagus percuma kalau banyak bag juga banyak hack tolong di perbaiki sama sekalian moonton knpa updetan baru banyak tim bot ya","sentiment":"negatif","predict":"negatif"},{"text":"Sistem matching memburuk, sangat terlihat sekali ketidak seimbangan permainan antar player.","sentiment":"netral","predict":"negatif"},{"text":"Gem terburuk yang pernah ada tim selalu dapat yang tolol gk bisa nyerang, pokoknya bangke banget saya sangat tidak suka dengan game ini saya harap seterusnya tidak seperti ini lagi kalau kek gini gw rate 1 terus ni game","sentiment":"negatif","predict":"negatif"},{"text":"Di ranked tinggi playernya pada match ratusan, dan jadilah beban akhirnya lose streak. Kenapa bisa seperti itu? Setelah update bukanya makin bagus makin parah jaringan pas in game, apalagi saat intens war selalu ngelag, kalau uda mati baru lancar.","sentiment":"negatif","predict":"negatif"},{"text":"bintang saya sudah hilang 3 kali, saya jadi tidak bisa main, tidak ada pertanggung jawaban dari moonton gara-gara sinyal hilang secara tiba-tiba jadi invalid semua, padahal dibuat main game lain lancar aja.","sentiment":"negatif","predict":"negatif"},{"text":"Main gak pernah menang ketemu satu tim kocak semua ada yang ngetroll lah afk lah, sementara tim musuh jago jago semua, dark sistem parah banget makin lama ini game, jangan ngurusin skin doang lah, liat komentar semua player lu","sentiment":"negatif","predict":"negatif"},{"text":"Sya ska bgt sama gamenya, ska bgt. Tapi ada yg kurang, klo kita LAPORKAN PLAYER atau AJU BANDING tapi g diterima maksudnya apa?! Dikira sya bohong? Jgn mentang dia MVP terus \"wah main dia bgus kok\" NGGA!! Dia main aman Moonton, yg lain war dia ga ikut. Trus gunanya fitur laporkan player itu apa klo g diterima? Player kyk dia yg jdi kurang ajar dan g tau diri, jadi mereka bisa begitu trus. TLG KLO UDH DILAPORKAN YA DISANKSI AJA PLAYERNYA LANGSUNG. Soal afk aja cpt, giliran FEEDING g ada aksi!!","sentiment":"positif","predict":"negatif"},{"text":"Ku kira ML makin kesini makin bagus dan adil ada kemajuan ehhh ternyata makin kesini makin ngaco lawak matchmaking musuh sama tim gak seimbang masa main clasic musuh mantan mitic sedangkan tim gm-epic ngacoo dari segi permainan jelas berbeda musuh main pake otak pengalaman bermain udah oke mikro makro bagus bisa di bilang jago sedangkan tim dari segi permainan masih kurang pengalaman.kalo dpt tim jago musuh ny yg gk ngotak nub nya.tolong di seimbang kan","sentiment":"positif","predict":"negatif"},{"text":"Tolong ketika saat main kenapa kami selalu dapat tim yg bot tidak seperti musuh yg kuat kuat sekali lagi mohon di perbaiki","sentiment":"positif","predict":"positif"},{"text":"Game ini habis di donglwod lodingnya lama habis di lauding ehh malah balik lagi ini hendpon saya yg bermasalah atau game nya sih kalau game nya tolong di perbaiki ya","sentiment":"negatif","predict":"negatif"},{"text":"Moonton lu gmn sih buat game , mau buat kita gila apa gmn sih ga jelas banget kalo kasih lawan kadang\" enak kadang kgk ayolah jangan gtu moonton plis gwe juga pengen kali ke rank paling tinggi tapi sistem lu dark bangett capek gwe kalo setiap maen lu kasih loststrike mulu","sentiment":"negatif","predict":"negatif"},{"text":"Lucunya game ini ga bisa myelesaikan masalah match yg tidak seimbang.. Coba aja setelah game selesai ck kembali profil tim sendiri dan tim lawan jauh berbeda..","sentiment":"negatif","predict":"negatif"},{"text":"Setiap bermain jaringan nya tidak stabil. Mana rank lagi. Tolong di perhatikan kesalahan sestemnya moonton!","sentiment":"negatif","predict":"negatif"},{"text":"Sangat kecewa selesai update gk bisa login lagi bahkan sempat uninstall ulang tetep ga bisa masuk, udh saat ny pensi dari game ini kecewa!!!!","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal nya makin parah ni Game merah ijo padahal gak bisa main ,, tolongperbaikan sinyal nya padahal hijau , kenapa gak bisa main aneh montoon klau kayak gini terus penggemar mobile legend akan berkurang","sentiment":"negatif","predict":"negatif"},{"text":"Saya kecewa dengan pemberian tim. Tim saya sama sekali tidak bisa bermain dan musuh saya adalah orang yg bahkan rank nya jauh di atas tim saya tolong berikan match antar tim dengan lebih adil","sentiment":"negatif","predict":"negatif"},{"text":"Bagaimana ini moonton,dari game,skin cukup bagus tapi saya tidak setuju dengan adanya tim ,contoh saya main di rank mytic lah musuhnya pada jago semua sedangkan tim sendiri tidak pernah berguna,dan sinyal saya sudah pakai data 4G+wifi tapi kadang sinyal nya itu ngelag lah ngebug lah atau kadang² ngeframe atau keluar dari in game nya lagi enak enak main malah ngelag","sentiment":"negatif","predict":"negatif"},{"text":"Bg kalo ada pemain yg ngetrol di kurangi kredit skornya lah, ngeselin, Ama yg gk bisa main tapi ad di rank tinggi, sama itu juga kenapa kalo pindah server dari adven ke normal kenapa kok harus download data lagi, Padahal sebelumnya udh download Data di server normal????????????????","sentiment":"negatif","predict":"negatif"},{"text":"Saya kasih 1 bintang karna setiap saya main game ini saya selalu di kata katain yg kotor atau menghina orang tua saya. Dan kalau mau game ini selalu saya dapat tim yang ga bisa main atau melakukan afk atau troll dan musuh nya jago jago. Kalau menang 1 kali kalah nya berkali-kali memang ga seimbang main game ini. Ditambah kalau cewee beban semuanya kalau main ml jgn kasih tim cewe semuanya moonton bikin kalah aja kalau di liat tim musuh cowo cowo semua pada jago lah ini cewe cewe main pada bebann","sentiment":"negatif","predict":"negatif"},{"text":"Abis pembaruan kenapa mobile lagends jaringan mesalah ..padaha jaringan wifi full yang 50 Mbps kecepatan nya.... sudah cukup besar ..tapi masih aja ngeleg ..tolong di perbaiki admin","sentiment":"positif","predict":"negatif"},{"text":"Tolong dong kualitas sinyal di tingkat kan kuota saya masih banyak tapi ngeleg ngeleg Pake ig YouTube semuanya lancar di loby sinyal ijo pas masuk ke game parah banget asli Rindu mobile legend dlu yang jarang banget gangguan sinyal tolong di perbaiki supaya player nyaman","sentiment":"negatif","predict":"negatif"},{"text":"gua sebgai player old gk nyaranin ni game sekarang ,server buruk ,mact dirank atas lama banget dpet player seperti komputer itu\" aja kyk gk ada plyer lain .stag war parah abis pdhl ping hijau .gk recomendet sebelum perbaikan besar\"an.jngn maenin ni game","sentiment":"negatif","predict":"negatif"},{"text":"Mohon game mobile legends di perbaikin lagi karna jaringannya kurang stabil. Jangan kasik skin terus!!! Tapi jaringan nya kagak dibutulin...","sentiment":"negatif","predict":"negatif"},{"text":"Makin kesini makin parah updatenya, matchmaking ga pernah bener, framedrop Mulu jaringan naik turun terus, enakan game sebelah daripada game ini","sentiment":"negatif","predict":"negatif"},{"text":"Tolong lah moonton game ini player nya tidak ada yang sopan pas matcking tim nya gak seimbang dan saya sering mendapatkan yang tidak saya harap kan Game ini di banding game sebelah seperti batle royal 3D game itu sangat seru dan cocok buat saya, game ini makin hari malah makin banyak bug nya walaupun sudah di update., moonton tolong perbaiki bug nya!!semoga lancar lagi, sekian Terima kasih.","sentiment":"negatif","predict":"negatif"},{"text":"Tolong perbaiki matchmaking nya di perbaiki agar seimbang, stres main ml team nya gajelas semua kayak bot. Main ga pernah dpt team yg bener, tolong perbaiki","sentiment":"positif","predict":"negatif"},{"text":"Ini gimana gw setiap push rank dapat tim darksistem parah ny lagi tim ada yg sengaja troll juga Makin kesini ko makin parah ya, setiap main gw di kasih losetrik terus Bukan cuman gw yg ngeluh sistem ml sekarang Banyak player lain jg","sentiment":"negatif","predict":"negatif"},{"text":"Moonton kalo ga bisa ngasih tim yang seimbang jangan kasih rank,,, ngasih tim yg ga seimbang mulu nih... Kacau short pemainnya... Kalo mo ngasih rank itu yg kira kira kedua belah pihak sama rata rateingnya jangan random tapi ngasih tim yang ngawur","sentiment":"negatif","predict":"negatif"},{"text":"Game bisnis kayanya, saya d jegal Mulu, kadang sinyal, kadang lawan, kadang tim, diberi gak sesuai,, padahal saya gak buka konten you tube. Paham lah saya","sentiment":"negatif","predict":"negatif"},{"text":"sudah 3kali main rank 3 orang bareng lag ada apa ini coba jelaskan moonton. lama\" uninstall juga game ini sering kena dark sistem pula resiko solo rank tolong lah jadi tambah ancur nih game moonton pa. mau banded akun ku silahkan sudah kesel sama game ini","sentiment":"negatif","predict":"negatif"},{"text":"Ngotak bro klo ngasih tim, tmn gw yg gak bisa main tiap hari solo dikasih win lah gua solo yg ada stuck rank gw, main 2 match win abis tu ls, gw mabar jg males trs gaada yg bisa diajak, kasian lah yg punya skill bagus tp dikasih tim kyk gt, ga mungkin jg orang tu ngecarry seumur hidup","sentiment":"positif","predict":"negatif"},{"text":"Saya masih 1 bintang terlebih dahulu karena masa saya mau login ngk bisa katanya mobile legend bang bang anda telah di hentikan pas saya login lagi ngk bisa berulang\" trs seperti begitu dan trs pas saya mvp malah saya di kasih jaringan yg buruk mohon ya moonton di perbaiki lagi 🙏","sentiment":"netral","predict":"negatif"},{"text":"MENDING GAUSAH MAIN GAME INI BUAT YANG MAU DOWNLOAD MATCHMAKING PARAH Dari kedua tim gak masuk akal sama sekali Masa kita yang main solo di rank mytic bisa ketemu para duo legend, mana musuhnya mytic semua lagi PERBAIKI DULU NOH MATCHMAKING LU Grafik mulu yang diupdate JARINGAN SUKA LAG PAS WAR padahan sinyal bagus, KAN LAWAK? #MLRUSAK","sentiment":"negatif","predict":"negatif"},{"text":"Dear moonton pasti setelah update skin\/ Hero selalu jaringan saat bermain bermalasah tolong segera di perbaiki agar player lain bisa nyaman bermain mobile legend jangan cuma banyakin Hero\/skin doang tapi jariang dan Players yang cheat\/GB juga harus di perhatikan dan pastikan mereka mendapatkan balasan yang setimpal jangan cuma player AFK doang yang sekali di repot turun drastis skore kreditnya mereka AFK pasti ada kepentingan lain selain nge game di mohon untuk di perbaiki lagi WAHAI MOOONTOOONN","sentiment":"negatif","predict":"negatif"},{"text":"kalau ganti device ( karena device rusak misalnya ) harus masukin id... bukan gmail... harus ke lvl 8 dulu.... WALAMUTU WALAYAHYA... TIDAK BERMUTU NGENTEKNO BIAYA .... unistal aja.... tambahan upgrade emblem.... tambah gak bermutu","sentiment":"netral","predict":"negatif"},{"text":"Game yg bikin emosi.. kenapa saat solo rank lawan nya gak seimbang? Solo ketemu mabar benar2 gak masuk akal. Harus nya lawan nya sepadan.","sentiment":"negatif","predict":"negatif"},{"text":"Lodingnya sangat lama padahal sinyalnya bagus dan terkadang lodingnya bisa sampai 7 jam . Dan sinyalnya terus merah padahal udah ngisi kuato , 1 lagi nih kalo udah dalam pertandingan sering terjadi crash atau keluar dari game , apalagi musuh nya op ga ada obat lagi tim gua ngefeed semua . Plis la moonton loading itu loh lama nya ga abis pikir ,Terkadang bisa sampai besok baru masuk lobby Apalagi kalau mau Mabar Nunggu lama nya.. perbaiki bug ini saya jadi tidak bisa login","sentiment":"negatif","predict":"negatif"},{"text":"Setuju... Makin kesini jaringan makin jelek.. Not good.. Ada apa dengan game ini ... Tolong di koreksi lagi agar game ini makin maju","sentiment":"negatif","predict":"negatif"},{"text":"Moonton tolong dong lw benerin lagi keamanan akun player, soalnya hack akun meraja lela dimana mana akun gw di hack mulu, terus feedback buat pengajuan pengembalian akun ke pengguna sebelumnya asli kayak taik, Kalo nggak lw atasi makin banyak ntar kerjaan lw. Thanks","sentiment":"positif","predict":"negatif"},{"text":"Nyesal download ini game,gamenya gk masuk logika,losttraiknya gk tangung2 seperti judi online saja.dari legen 3 bintang 4 ke legen 5 bintang 1,jika mengacak teman dalam satu permainana itu seharusnya sistem harus teliti membaca.capek main ini game mending PUBG jauh lebih menarik","sentiment":"negatif","predict":"negatif"},{"text":"Abis update bukannya bagus malah jelek performa jaringan yang tadinya selalu bagus sekarang malah sering banget naik ping padahal udah make data sama wifi masih aja naik merah mulu ping nya","sentiment":"netral","predict":"negatif"},{"text":"Pihak moonton yg terhormat saya sebagai pemain ml kok ad bug lag dan saya dikasih temang random yg ngetrol dan musuh saya seperti pro player dan teman saya cuma menjadi beban tolong d perbaiki mohon bantuannya","sentiment":"negatif","predict":"negatif"},{"text":"File game ini besar!! Sering lag dalam pertandingan, apalagi saat pertarungan sering kali lag!! Sering sekali pengguna game menggunakan cheat, yang membuat permainan tidak lancar dan layar berkedip-kedip!! Saya kecewa jika tidak ada perbaikan!! Seharusnya ada pembatasan dlm pemakaian hero 2 atau lebih posisi yg sama (mm\/fighter\/mage\/assasin), agar seimbang.","sentiment":"negatif","predict":"negatif"},{"text":"Makin kesini main rasa makin berat dengan bug sinyal yang terus menerus jadi buat maen rank makin susah tolong pihak monton tolong benerin masalah nya jadi biar maen makin enak","sentiment":"negatif","predict":"negatif"},{"text":"Woi kenapa main game ini sinyal gak pernah bagus selalu buruk Gak jelas banget ni game Di perbaiki dong sinyal nya Tiba tiba koneksi terputus Padahal sinyal di hp full Kenapa di game ni gak pernah bener sinyal nya","sentiment":"negatif","predict":"negatif"},{"text":"Ukurannya terlalu besar sampai ruang penyimpananku habis padahal hp ku ram 3 gb tapi masih gk cukup tolong ringankan ini gem jangan terlalu berat klw kaya gini gue pindah aja ke ff","sentiment":"netral","predict":"negatif"},{"text":"Anehhh bangetttttt lagi rank sama temen.. tiba\" game macet totall punya temen juga macet totall.. di tunggu lama malah udah kelar permainan Bintang turun kena APK lagi kena sanksi pelanggaran.. Padahal sinyal stabill lhooo Anaeh banget sumpah Maen Duo.. macet semua.. kena pelanggaran semua😡😡😡🤬","sentiment":"negatif","predict":"negatif"},{"text":"Gemnya ya si bagus tapi ada dak sistem nya ,dah mulai dapat teman yg pake jangler 2 lah dan lain² dan musuhnya musuhnya nih pro pro pada saat main pin :237 mohon mas monton tolong gemnya yah:(","sentiment":"negatif","predict":"negatif"},{"text":"Selalu dapat tim yang egois Gak adil bagi solo rank, gak tau kenapa, selalu dapat darksistem Kok bisa moonton gak adil bagi tim sih Kalau bisa minus bintang 5, gue kasih minus bintang 5 nih","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal jumping, matchmaking ga ngotak masa temen kek bot lawan kek penjoki, berantas dlu lah akun akun joki, benerin sinyal, jangan cuma bagus ui\/ux nya, perbaiki hal hal dasar aja dulu satu lagi yg paling penting, MAGIC CHESS BUATIN GAME SENDIRI AJA PENUH-PENUHIN MEMORI AJA!","sentiment":"netral","predict":"negatif"},{"text":"Tolong seimbangkan lagi untuk pemainnya. jngn asal kasih tim aja yg gak guna malah cari tim musuh yg gak sepadan dengan kami. kmi lelah terus terusan naikin rank malah ujung ujungnya kalah terus.","sentiment":"negatif","predict":"negatif"},{"text":"Ml nya bagus tapi setiap mau naik level pasti ada aja kekalahan sumpah terus setiap gw pilih Hero yang bagus menurut dari game nya nah gw pilih tu eh tapi malah kalah anying jadi gw minta tolong supaya setiap naik level jangan kalah Mulu udah itu aja BLK","sentiment":"negatif","predict":"negatif"},{"text":"Tolong boss gimana sih, saat main rank matchmaking kadang ga setara dengan rank kita, kadang juga kita main solo dapet musuh mabar gimana cobaaa,, hadeh lama\" males gua main 🤬 ml ga jelas dan saat rank juga sinyal nya itu looo suat game apa Kaden nyesel download","sentiment":"negatif","predict":"negatif"},{"text":"Game gak jelas khususnya di arcade magic chess. Pembagian lawan yang cukup sulit. Serta pembagian hero yang begitu sulit dicari. Lebih baik uninstall lah. Beralih game yang lain. Id saya 15419. Coba cek. Tidak adil sama sekali game ini","sentiment":"negatif","predict":"negatif"},{"text":"Mau login mentok di logo awal aja,, gimana solusinya ini? Udah gunain 2 provider dan wifi cafe,, hp ruang penyimpanan masih 80 GB lagi,, banyak yg kejadian gini","sentiment":"netral","predict":"negatif"},{"text":"Pless pihak game mentang mentang game populer dibikin lag bagi user jungler plees lah kasih ke sinyal bagus kalo dikasih sinyal bagus kesemua orang main ini game pasti enak dan gak patah patah setiap main patah patah dah to permasalahan gw tentang ini game semoga pihak game baca ini komentar🙏🙏🙏","sentiment":"negatif","predict":"negatif"},{"text":"Sinyal kadang tiba tiba buruk ngelag nggk jelas... Selalu dapat team dan lawan yg gk seimbang.. Tolong game ini benar-benar di perbaiki","sentiment":"negatif","predict":"negatif"},{"text":"Untuk moonton kalau kasih team itu yang kompak masa musuhnya nge kill banyak team aku sendiri nge kill 1,2,3,4 Apa itu beli tempe walaupun musuhnya kuat ya team aku juga kuat dong madi bisa di imbangin aku kasih bintang Satu aja gk usah banyak banyak nanti habis bintang ku😡🤬🤬😤","sentiment":"netral","predict":"negatif"},{"text":"Pengalaman bermain yg buruk, sistem terdeteksi dgn sngaja memberikan kita lawan yg berat dan memberikan tim yg lemah.. sehingga sangat susah untuk terus menuju level tinggi. Dan dgn sistem session maka player akan sia-sia, mskipun sudah di rank tinggi maka jika akhir session akan turun kmbali ke level sblumnya.. dan game ini TIDAK ADA AKHIRNYA.... Juga sering trjadi lag saat war brlangsung, pdhal HP & intrnet sy sgt support.. Ditambah sekarang saat pertandingan suaranya hilang sendiri...","sentiment":"negatif","predict":"negatif"},{"text":"Plis ini di perbaiki ya karena sering ngeleg patah patah dapet tim bot musuh pro tiba tiba keluar terus logi ulang dari gam sendiri terus lag hp jadi panas player player ml pada kecewa kalau kaya gini terus monton plis perbaiki ini ya","sentiment":"netral","predict":"negatif"},{"text":"Game cacat udah update berkali kali masih aja banyak bug mana bug nya ngerugiin plyaer, kalo mau update ya update gua udh 2x kena bug bikin males main banget sumpah,mana kompensasi bug ga ada","sentiment":"negatif","predict":"negatif"},{"text":"knp sekarang susah mau main kl udh afk, pdhl bukan kesalahn kami tp karna jaringan yg suka ngelek ditambah lg suka mati lampu, kerdit sekor sampe 60 , sehari cm dpt 3,trs terang saya jd males main, saya kecewa,","sentiment":"positif","predict":"negatif"},{"text":"Habis update terbaru Hero ixia mm malah jadi crash Mulu, padahal hp high end ram 8\/126 Kenapa semakin lama malah bukan diperbaiki tapi makin parah NGE freeze nya, aneh buat main genshin lancar banget buat main ML yg GK seberapa malah NGE freeze developer benerin lah udah lama aku komplain di in game juga","sentiment":"positif","predict":"negatif"},{"text":"Kalau bisa hadiahnya hp... Jngan skin mulu pembaruan hnya membuat para player yg mnggunakan hp ram tendah mnjadi patah2... Dan fitur2 yg g penting sebaiknya d hilangkan aja misal konten2 utube orang bisa langsung k youtube untuk nonton.... Pembaruannya bukan makin keren tapi menyiksa orang2 yg memiliki hp ram rendah....itu aja terima kasih moga d respond","sentiment":"netral","predict":"negatif"},{"text":"Asalamualaikum maaf saya ngatau ini bug atau gimana yang penting knp di akun saya knp hero sama sekin nya nga keliatan saya jadi sulit untuk mainin gem nya padahal saya udah douwnlod data data nya knp masih nga keliatan sekin sama heronya di akun temen saya juga kaya begitu sampe dia prustasi pindah gem ke gem garena tolong di perbaiki","sentiment":"netral","predict":"negatif"},{"text":"Bisa ga ya trash talking auto mute by system? Bug fixing jg perlu Matchmaking mgkn mmg sengaja dibuat aneh Kadang ketemu musuh cupu tp timnya solid Kadang ketemu musuh hyper timnya cupu","sentiment":"netral","predict":"negatif"},{"text":"jelek sekali ketemu tim hasil joki mungkin ga setara padahal di rank legend menuju mytich udh habisin waktu buat push bukan naik malah turun karena tim yang ga setara tolong di perbaiki lg dan ijin un instal","sentiment":"negatif","predict":"negatif"},{"text":"Belakangan ini gamenya sering ngebug. - Tiba\" ngelag dan hasil pertandingannya hilang. - Waktu masuk match juga gabisa, alasannya terjadi gangguan jaringan padahal jaringan baik\" aja. - Pas buka event tiba\" ngefreeze, jadi harus reload.","sentiment":"netral","predict":"negatif"},{"text":"Game rusak Gini amat main, tinggal 1 bintang lagi aja susah bener, selalu di kasi kawan yg gak tau main (dark system), mending main AOV dari pada ni game buatan moonton alis ko***l","sentiment":"negatif","predict":"negatif"},{"text":"Jaringan bagus tapi malah lag Mulu, udah keluar tapi masih sama aja nunggunya lama dirank pas war game anj, lag jadi afk dibayar pake kredit skor, update kentir tim gua ngatain yang gak bagus kegua karena jaringan merah","sentiment":"negatif","predict":"negatif"},{"text":"Untuk game nya udah bagus banget. Grafiknya bagus biarpun low, dan cukup optimal di hp standar. Jaringan udah cukup stabil saya rasa. Namun hal yang saya permasalahkan ialah sistem pertandingan yang saya rasa tidak adil. Saya ingin bermain sungguh sungguh agar pangkat saya naik, namun seringkali saya bertemu dengan pemain yang memiliki statistik permainan buruk. Hal itu membuat saya tidak pernah naik ke pangkat tertinggi, juga membuat nilai kemenangan saya 40%. Semoga diperbaiki, terima kasih...","sentiment":"negatif","predict":"negatif"},{"text":"Aplikasi abis update sering tidak menanggapi, padahal penyimpanan masih banyak, pasti tiap login harus relog dlu klo udh masuk in game","sentiment":"negatif","predict":"negatif"},{"text":"Mohon.maap ni moonton sebelum nya saya sangat kecewa banget moonton ko saya makin ke sini makin ke sini ko malah dapet tim yang ga bisa main ya moonton pdahal udah renk tertinggi yaitu mitic ko bisa orang seperti itu ke mitic moonton saya cape looss treakkk plis lah kasih tim yang bisa main juga jangan ini mah tim musuh pada bisa main lah tim gua gua doang yang bisa main ayok lh moonton pis ya","sentiment":"positif","predict":"negatif"},{"text":"Setelah update sinyal semakin jelek buat war,mohon moonton kembalikan seperti semula sinyal dll bikin emosi doang cuman gara\"sinyal sampai hp gw aku banting padahal buat apk lainya bagus,dan Mohon maaf gw kasih bintang 1 soallnya semakin kesini bukanya bagus malah tambah jelek cuman gara\"sinyal","sentiment":"netral","predict":"negatif"},{"text":"Klasikan kalah sekali next match langsung musuhnya bot, biar apa coba ????? Bukan tambah seru yang ada malah enek ni lama\" mobile legend","sentiment":"netral","predict":"negatif"},{"text":"Match tidak seimbang, sinyal merah padahal lancar, sering banget hilang sinyal padahal jaringan lancar, lingkungan game yang tidak ramah","sentiment":"negatif","predict":"negatif"},{"text":"Game gajelas! Dapet musuh jago dan tim noob, sering lag, dapet tim tidak toleransi, ga kompak, ga mood maen mobile legend lagi terutama di epic🤬😡","sentiment":"negatif","predict":"negatif"},{"text":"Woy moonton banyak sekali orang yang suka mengejek. sya tidak suka diejek jadi kalaunya ada yang ngejekin orang langsung aja credit skor kurangin. Emg moontoon knp sih dpt team yang beban mulu, cuma ngasih tim yang bagus gk bisa. Plis moonton hilangin aj hero ammon ngeselin damage nya juga sakit","sentiment":"netral","predict":"negatif"},{"text":"Semakin sini game nya jadi semakin aneh,,kadang ping merah lah sinyal bagus juga,leg lah,freeze lah. Mau naik satu kali permainan lagi pasti di kasih musuh di luar nalar atau tim ampas,ini game kayak udah di setting. . Udah naik satu kasta,next turun nya 2 atau 3 kasta 😌","sentiment":"negatif","predict":"negatif"},{"text":"Maaf ya kak klo aku kasih bintang satu, soalnya kenapa seasonnya berubah rank pun juga ikut turun. Itu padahal aku itu udah epic 2 mau legend turun jadi epic 5 gara2 season berubah. Maaf kak aku boleh kasih saran yaitu pas seasonnya berubah rank pun jgn ikut turun kak. Hargai hasil susah payah buat naikin bintang di rank kak, coba kakak main mobile legend trs rank nya turun kakak sedih dan kesel gak kak? Jadi aku mohon pas season berubah rank pun jangan ikut turun kk. Sekali lagi 🙏& terimakasih","sentiment":"negatif","predict":"negatif"},{"text":"Game sampah!, woy monton kalo kasih tim tuh yang seimbang lah, bukan malan dapet musuh jago jago, tim sendiri dapet nya gblk semua, tau diri lah woy ini game sebelumnya udah dikasih bintang 5 malah dibales gini, gajelas ini game, ga seimbang lawan ama tim, game ny juga menang kalah menang kalah, udah gitu aja terus, dasar monton ngasih darkSystem huuu, ngasih match tuh yg seimbang LOL !","sentiment":"negatif","predict":"negatif"},{"text":"padahal dulu aku semangat banget main mlbb tapi sekarang mlbb nya gak kayak dulu lagi jadi aku jarang login😌 dan juga kenapa update nya semakin banyak aku yang sebagai ram 2 jadi ga cukup buat update besar besaran di mlbb🙏🏻","sentiment":"positif","predict":"netral"},{"text":"Game moba asu apaan ini game lagi enak ngerank malah ping nya merah padahal jaringan disini bagus udah gitu di Double pake WiFi juga sama aja,ga jelas ini game makin kesini sering eror, lama-lama gue uninstall ni game asu banget 😤😤","sentiment":"negatif","predict":"negatif"},{"text":"Sering ngebug, satu room pas main ngelag semua. Apalagi pemilihan tim dari sistem sekarang jomplang jauh. Gak imbang. Mau sampe kapan kalian ngetroll.","sentiment":"positif","predict":"negatif"},{"text":"untuk orang yang baru mau download mending pikir-pikir lagi untuk khusus pemain Solo, soalnya lu nggak pernah bisa naik Legend main Solo rank,soalnya lu akan dikasih tim sampah setiap lu mau naik Legend","sentiment":"positif","predict":"negatif"},{"text":"Game makin kesini makin rusak, sistem pembagian tim ga adil. Jaringan pun terkadang tidak stabil, tolong perbaiki.","sentiment":"negatif","predict":"negatif"},{"text":"ini game kayak anj!!!!! aku baru beli hp aku juga pas main clasicc atau rank atau brawl tapi malah keluar ini game kayak anj!!!!! jadi aku terkeluar terus di ban karna afk padahal dia terkeluar sediri aku udah masuk tapi malah terkeluar terus di ban afk kayak anj!!!!! lah jadi kan orang malas kalau mau main pas itu aku lagi mabar lagi taikkkk!!!!!!","sentiment":"negatif","predict":"negatif"},{"text":"To:Developer MOONTON ada satu hal yangembuat saya sebagai player setia mobile legend sangat kecewa dengan mobile legend sekarang,(disaat saya mau main,dibagian matchmaking(menunggu pemain pencet mulai)estimasi waktunya selalu diatas perkiraan,dan yang lebih parahnya lagi,tiba² saya langsung kembali ulang kedalam lobby,saya diban darimatchmaking karna tidak siap,padahal layar tekan tombol mulainya nggak muncul dan score credit saya otomatis berkurang,saya merasa dirugikan,(TOLONG JAWAB)!!!!!!!!!","sentiment":"netral","predict":"negatif"},{"text":"Untuk developer mohon di perbaiki untuk masalah sinyal nya,sebelum update sinyal nya bagus\" aja tapi setelah update,kenapa lag banget padahal jaringan wifi bagus,mohon untuk pihak moonton untuk memperbaiki masalah sinyal biar gak lag lagi!!!","sentiment":"netral","predict":"netral"},{"text":"Kenapa kalau jaringan terputus, ketika masuk lagi kedalam pertandingan terakhir lama sekali masuknya? Tolong berikan jawaban nya","sentiment":"netral","predict":"negatif"},{"text":"Halo bg moonton makasih ya karna kmi player solo selalu dikasih lose streak mulu main dri jam 7 sampe pgi tiap malem tpi bintang nya gak pke naik dan malah menurun makasih juga bikin mood kita bagus banget gara\" lose streak mulu menang sekali kalah 5 kli gitu mulu bg moonton pintar sekali buat kita player solo dikasih tim sangat jgo mulu sehingga sering dpet mvp kalah atau kalah kita sendiri yg silver sedangkan tim coklat sekali lagi makasih banyak jujur saya tulis in dengan sangat tidak senang","sentiment":"positif","predict":"negatif"},{"text":"Sudah beli commander buss, sudah lama dimainkan sampai dapat bintang 3 (the midas touch). Tiba-tiba berubah menjadi free commander dan tidak bisa pakai level bintang 3 karena sudah pakai bintang 3 sekali, sekarang turun ke bintang 2. Banyak cheater berkeliaran di game ini padahal sering update. Musuh hero harga 5 sudah bintang 2 padahal baru round 3. Ini masih tentang magic cess, belum masalah rank, jumpa musuh pakai map hack, hyper power dll. Game berat, terlalu komer sial, tapi banyak cheater.","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak pemain troll, selalu minta saran dan masukan tpi tetap tdk pernah di perbaiki, untuk matchmakingnya burukk sekaliiiiii Sangat tidak puas☠️","sentiment":"netral","predict":"negatif"},{"text":"game nya suka ngelag.. suka kluar sendiri. banyak yg ngecit.. aneh kena dark sistem. Aplks yg bikin ngelag sendiri tapi dia sendiri yg baned skor aneh.. moonton moonton..","sentiment":"negatif","predict":"negatif"},{"text":"Saya cuma mau ngasih saran buat moonton, buat sistem baru berdasarkan war jadi nanti dikelompokkan orang yg main 0-500 match, 500-1000 match, 1000-500 match, dst. Jadi ga akan ketemu lawan 1000 match tapi temennya 10 match. Semoga membantu","sentiment":"positif","predict":"negatif"},{"text":"Makin GA BERESS BOBROK JARINGAN nya, jaringan gw TELKOMSEL FULL 4G + WIFI 20Mbps (lumayan kenceng dikit lah), tapi di game Merah kuning hijau mulu tapi lebih lama merah nya kek lampu jalan, auto uninstall, bye MONTODD","sentiment":"negatif","predict":"negatif"},{"text":"Pembagian tim tidak rata, sinyal sering merah padahal wifi lancar aja, banyak yg pake cheat ketika main tiba² keluar sendiri trs gabisa masuk lgi","sentiment":"positif","predict":"negatif"},{"text":"Coba deh perbaiki sistem matchnya saja jangan cuma fokus sama update fokus sama grafiknya doang. Perbaiki sistem pembagian tim agar dapat tim yang seimbang lah perbaiki juga sistem mmnya","sentiment":"netral","predict":"negatif"},{"text":"Game ini awalnya seru tpi lma kelamaan bugnya parah, tim lawan lebih hebat dari pada timku jdi, masa tim yg enak cuma 1 kali doang dan seterusnya sampek 7 kli kalah terus jdi kesal aku main sekalian ku hapus nii game bukan ngehina tpi kenyataan","sentiment":"negatif","predict":"negatif"},{"text":"Game ini Sangat bagus, hanya saja Game ini Merusak Masa depan anak anak, Karna Strategy game ini untuk membuat penggunanya kecanduan main game ini, alhasil kalah kalah terus, dan dampak buruk nya Lisan, Kepribadian orang, terutamanya untuk anak kecil Menjadi Toxic, hancur, Di otak nya Hanya Game ini, Saya ngomong ini karna saya Udh kecanduan main game ini, sekarang udh Uninstall","sentiment":"negatif","predict":"negatif"},{"text":"Perbaiki masalah jaringannya moonton... Setiap kali di dalam pertandingan ping nya tidak pernah stabil... Jangan event terus yg di utamain... Tapi yang harus di utamakan adalah permasalahan ping yang tidak pernah stabil... Bakalan banyak orang yang akan meninggalkan game ini jika moonton tidak mendengarkan suara playernya...","sentiment":"negatif","predict":"negatif"},{"text":"bug pas melakukan draft pick, sering for close ke lobby, pas draft pick, saya tidak tau ini bug atau bukan, tpi tolong segera di perbaiki","sentiment":"netral","predict":"netral"},{"text":"Relog. Trus mau masuk lagi persen nya lemot banget. Mau masuk stuck di 97% abis pertandingan selesai. Afk. Speck bisa ultra. Blok","sentiment":"netral","predict":"negatif"},{"text":"Tiap main di magic chess selalu habis menang 2 kali di kasih kekalahan terus menurus,kelihatan sekali sistem nya gold 30 up sampai habis nyari hero common kurang satu tidak keluar keluar,ketika darah tinggal dikit gold menipis baru keluar,begitu terus dan selalu stak win di no.4 ,makin parah tidak seperti dulu nyesel download lagi Tier mytic bye Uninstall .!!!!","sentiment":"positif","predict":"negatif"},{"text":"Email hilang , GK bisa login , pemulihan aku. Bertele tele segala minta foto bukti top up , mana top up udh lama , buat akun udh lupa kapan . Percuma top up udh berjuta juta , proses pemulihan akun aja bertele tele","sentiment":"positif","predict":"positif"},{"text":"Update2 terus jaringan ngak di betulin jadi makin parah makin kesini nya tolong di perbaiki lah server nya coba lah dengerin suara kami ini min yang bukan sebagai pro player wooyyyyyyy","sentiment":"netral","predict":"negatif"},{"text":"game rusak berapa kali saya harus mengomentari game ini,permasalahan saya kenapa matcmaking tidak adil pick hero nya emang bagus tapi skil tim saya sama lawan beda nya tim lawan kuat tim saya terlalu lemah 2 kali pertandingan,saya mau naik ke myticla honor 1 bintang lagi malah di kasih tim yang lemah","sentiment":"negatif","predict":"negatif"},{"text":"Memang game ini menyenangkan tetapi banyak player yg toxic, atau joki, di mana mereka tinggal bayar lalu naik ke rank yg mereka inginkan, mereka melakukan blunder yg sangat fatal , seperti tidak tau makro mikro, penguasaan Hero, Hero yg sesuai di Lane nya sampai spel yang ia pake, saya berharap game ini berhenti untuk jasa joki, saya bukan mau membuat rejeki orang ilang ya mau bagaimana mana lagi?, Manyak orang telah menjadi korban trol dari player yg tidak tau cara bermain ml","sentiment":"negatif","predict":"negatif"},{"text":"Moonton gak seperti dahulu yg enak sekarang sinyal mudah hilang update terus meneruS gak suka minta bayaran terus game perfoma kurang baik, hapus aja dari playstore game kayak gini hanya bikin kesel dan marah marah 😈👿😈👿 #player lama Game busuk","sentiment":"negatif","predict":"negatif"},{"text":"udh topup ratusan ribu buat gacha ampas, malah yg topup dikit diksh bgs, udh gitu bug mulu pula di bagian pick hero klo g di room dimana gk bisa ngapa-ngapain (freeze)","sentiment":"netral","predict":"negatif"},{"text":"Dari bintang 5 kuganti jadi bintang 1 karena mactmaking yg gak seimbang masa tim gw lemah tim musuh jago banget terus kadang tiba tiba lag pedahal jaringan bagus terus refresnya udah rendah. Jelek sekali ini game","sentiment":"negatif","predict":"negatif"},{"text":"Game gaje !!! Gw mencet batal bukannya kebatal malah ngelanjutin. Apa yang mau bilang hp gw kentang gw maennya nih di graphic ultra refresh rate high kalo refresh rate ultra sama aja g ada gunanya jadinya ku high in aja","sentiment":"negatif","predict":"negatif"},{"text":"Game ini sungguh game tolol. Rugi nyesal kalian akan instal ini. katanya game moba. tapi nyatanya ada solo player. dari solo player itulah dia ambil keuntungan,dia susupkan computernya di tambah lagi pemain dari yang 5 orang itu di ketemukan tidak merata skillnya. jadinya pemain solo itu akan mengendap sampai bertahun tahun di rank itu itu tok. misal menang dua kali maka main selanjutnya akan di susup comouter moonton untuk jadi lawan. so kemengan pasti sdh 0,5 persen untuk pemain solo tersebut.","sentiment":"negatif","predict":"negatif"},{"text":"Suka keluar sendiri waktu main mana Main nya di classic sama rank rank lagi suka kesel aja perbaiki lagi dong game nya jangan fokus event tambah Hero baru fokus bug nya juga ok","sentiment":"negatif","predict":"negatif"},{"text":"Setiap mau naik ganti tier pasti dikasih tim tolol, sehingga bolak balik maksa kita untuk main. Game rusak, dark system nya parah.","sentiment":"negatif","predict":"negatif"},{"text":"Sering terjadi darksistem bagi player solo , seperti saat bermain mendapatkan team yang troll tetapi sebaliknya team musuh mendapatkan team yg kompak.","sentiment":"netral","predict":"negatif"},{"text":"1. Matchmaking gak nalar 2. Masuk login lama 3. Sinyal aman tapi sering lag ping merah. Percuma file besar tapi gini kualitasnya 4. Dapet tim LAWAK ANJ 5. Moonton janck","sentiment":"netral","predict":"negatif"},{"text":"kepada pengembang, mohon perbarui masalah sinyalnya. pas saya main, sinyalnya merah tanpa sebab bikin para pemain kecewa terhadap sinyalnya.","sentiment":"positif","predict":"negatif"},{"text":"Payah bgt kami player yg slalu senang dgan partisipasi moonton,tapi mngapa slalu mengecewakan,makin lama makin gak seru lagi ni game,peraturan tidak masuk akal,dengan adanya kredit score yg terlalu minim untung di pulihkan,mingkin kedepannya orang makin pindah haluan,soalnya banyak yang pindah ke game AOV.","sentiment":"negatif","predict":"negatif"},{"text":"Terkadang jaringan hijau tapi pas war lgsg lag,oia satu lagi klo ngasih tim paling tidak agak imbang dikit,kadang lawannya jago banget tp dikasih tim yang gak jelas..!!","sentiment":"netral","predict":"negatif"},{"text":"tolong diperbaiki masalah leg di ingame masa setiap mau main selalu leg terus pas di gamenya kalau di lobynya aja bagus pas udah masuk legnya minta ampun susah sekali mau mainnya, rusak dh ke gamenya nii","sentiment":"positif","predict":"negatif"},{"text":"Ehh monton kalo ngasih tim yang bener lah gua udh seminggu di epic 1 bintang 5 mulu mau ke legen juga susah banget tolong lah kalo ngasih tim yang bener gua kalo nemu tim rata rata gren master semua terus musuh nya ada yang mantan miytik terus ada yang mantan legen yang gua jadi nya ngestak terus di epic 1 tolong monton sekali lagi kalo kasih tim buat gua yang bener jangan yang pada ngetrol cape gua tuh monton monton jadi males gua main mobile legen nya tau gua kasih bintang satu dulu tolong ya","sentiment":"positif","predict":"negatif"},{"text":"Min tolong lah makin update kok makin parah si, Selalu aja kalo login pasti stuck diloading screen nya,jadi badmood main gini,padahal mau ngejar top global jadi susah.","sentiment":"positif","predict":"negatif"},{"text":"Tolong MOONTON.! ini kenapa gua gak bisa masuk loby Biasa nya nggak kyk gini. Reelog terus Hp gua Tolong dibenerin lagi. Star satu cukup!","sentiment":"netral","predict":"negatif"},{"text":"Game ini terlalu sulit untuk menaikkan rank nya,harusnya kalo sulit kek gini pelindung rank nya dipermudah,udah tim kayak bot sistem ngak mendukung","sentiment":"negatif","predict":"negatif"},{"text":"Game jadi kurang seru soalnya mengadakan update besar besar tapi tidak memikirkan kestabilan jaringan sehingga membuat player kurang bersemangat dalam permainan.","sentiment":"negatif","predict":"negatif"},{"text":"Pesan kepada MOONTON kalo gandengin tim itu yang seimbang lah, masak math 8000 dapet tim yang math nya ganyampe 1000, terutama solo, mending kalah tapi tim waras sama2 berjuang dari pada main sama yang math nya dikit main asal2an, mending sistemnya diganti lah tiap server pertandingan disamakan math nya, bukan masalah kalah menangnya sih, tpi kesal sih udag serius2 main dapet tim asal2an gapaham objektif,serasa berjuang sendiri, capek tau mending ban aja akun saya aja biar sekalian gabisa main.","sentiment":"positif","predict":"negatif"},{"text":"bug apa lagi ini coba pas main brawl udh masuk digame udh milih Hero pas loading kegameplay nya tiba tiba layar hitam dan kembali kelobi terus masuk lg dan tiba tiba error dan tertulis loading file gagal,silahkan login kembali itu maksudnya ap ya bug atau gimna moontod","sentiment":"positif","predict":"negatif"},{"text":"Gamenya sih sudah menyenangkan cuma ada 1 perkara yaitu dapat tim yg gk bisa main\/beban dan juga timnya tidak seimbang sama tim musuh tolong segera diperbaiki🙏🙏🙏jujur aku sampai mau stress plisss ton perbaiki game ini monton emang babi ya gua ngetroll karena dapat tim beban malah gua yg salah padahal timnya yg beban lebih baik pensi aja daripada main game haram kek gini","sentiment":"negatif","predict":"negatif"},{"text":"teruntuk Mobile legends tolong di urus untuk pemerataan tim sekarang banyak sering kali mendapatkan tim yg tidak sesuai di karenakan ada penjoki, harap tindaki bagi penjoki karena itu merugikan tim!!!!!!!!","sentiment":"netral","predict":"negatif"},{"text":"Game buat saya stresss tim nya yang gini gitu yang omongannya kasar di kasih lose streak juag padahal highround nya bagus di awal malah xome back gara\" tim yng pke mm lah mage lah exp lah hyper lahh sedikit gua saranin jangan pernah downlod ni gem bisa stres lu dan masuk rumah sakit jiwa mau????","sentiment":"negatif","predict":"negatif"},{"text":"Terlalu banyak Update yang moonton buat, sampai memori kami full & jaringan yang kurang stabil padahal sudah memakai WIFI yang sudah cepat","sentiment":"positif","predict":"negatif"},{"text":"Saya adalah player old game ini.namun entah kenapa game ini lama kelamaan menjadi tidak asik seperti dulu lagi.pembagian tim yang tidak seimbang adalah faktor utamanya.jadi mohon saran saya ini didengar.moonton asu","sentiment":"negatif","predict":"negatif"},{"text":"Udh capek mainin ni game udh banyak bug gw udh pake andromax tapi g bisa krn itu udh ada bug udh gw nonton tutor di youtube g bisa kalo bikin game yang niat kalo masi banyak bug bintang 1 dlu","sentiment":"negatif","predict":"negatif"},{"text":"Ram 4 GB dah selalu keluar sendiri. Mungkin ML bakalan tenggelam KL ram 3 GB aja dah sulit buat main Dasar moonton kapitalis. Cuma suka uang, tp g lihat para pemain nya","sentiment":"positif","predict":"negatif"},{"text":"Kalau bisa pihak moonton meringankan atau mengurangi data resource atau di pisahkan data data tersebut sebab kami para pengguna android ram 3gb ke bawah sudah tidak mampu menampung semua data tersebut. Bahkan ada di antara beberapa hape yang tidak bisa menginstal apk ini setelah up date terimakasih!!!","sentiment":"netral","predict":"negatif"},{"text":"Game bagus sangat seru dimainkan tapi banyak sistem yg gk adil kayak emblem, stlh revamp yg newbie susah buat emblem cari mahal harus gacha, yg pro tambah pro yg newbie susah beradaptasi, gw tau pengen ngebalance game montoon tpi y gk gini lah pea","sentiment":"negatif","predict":"negatif"},{"text":"sudah ga bisa lagi main..habis kalo mau war ga bisa lagi..pas ikut war belum pencit skil udah mati..bearat kalo ram 2gb..","sentiment":"netral","predict":"negatif"},{"text":"Terlalu banyak sama komputer, tingkat losstreak mantap banyak, jadi kesannya game settingan, mohon diperbaiki montoon ,makin sini mobile legend makin arogan dark system nya .","sentiment":"negatif","predict":"negatif"},{"text":"Game nya bagus, cuman pembagian tim kurang seimbang. Misalkan musuhnya terlalu kuat dan tim sendiri terlalu lemah. Tolong di perhatikan dalam menentukan Matchmaking agar tidak terjadi ketidakseimbangan.","sentiment":"negatif","predict":"negatif"},{"text":"Akhir akhir ini jaringan 90 ke atas,padahal diloby bagus 20ms an,tpi pas di ingame jaringan 90 ke atas, udah nyoba di rilog,hp di matiin jaringan di mode pesawatin tapi masih tetep aja pas main lag terus,tolong untuk moonton atasi segera masalah ini,soalnya ga enak main dengan kondisi jaringan yang tidak stabil,terimasik","sentiment":"positif","predict":"negatif"},{"text":"Bagus si bagus tapi ya tapi pas awalnya tim bagus ya ya kalo udahkelamaan kelamaan tim kagak seimbang dan bosoh tim yang di pilih oleh monton saya kesel saya pensi aja maen di luar udah saya gak usah maen ngam mending maen bolla dah pensi maen ml pensi gam burik semuannya cape saya tau gak pusrenk pusrenk sampe tangan pegel nyampe bosen kalah kalah mulu 😡😤 yang bisa ke mitick mah cuma orang dewasa yang bisa tapi yang kecil susah susah naikit sampe pegel tolonglah pilih tim yang enak enak dikit","sentiment":"netral","predict":"negatif"},{"text":"semajak update bug jringan makin sering apalah moonton bug server juga kaga jelas betulin dlu bugnya baru update kbnykn update g bikiny nyaman yg main ,,bru aj ni kena big terpaksa afk nanti yg salah siapa ,,,kita yg afk yg bekutang kredit skor nya ...perbaiki dlu bug nya baru update!!!","sentiment":"positif","predict":"negatif"},{"text":"Gw ganti jadi 1 gara gara hari kemerdekaan RI cuman dikasih emote sedangkan server luar skin bahkan sampe skin epic? Tambahan : makin kesini maen makin ngelag, mau double WiFi data\/mode pesawat delay delay anjay, maen assassin dah gk se-smooth dulu, tambahan lagi : itu player yg beban di banned aja ngapa si, emangnya gamenya bakalan ramah setelah SK turun kalo toxic, giliran yg toxic turunnya banyak yg beban dikit","sentiment":"positif","predict":"negatif"},{"text":"Mactmaking kagak imbang kocak.... Game ini makin lama makin kagak jelas... Gua sebagai player old ngakak liat macthmaking sekarang yg amburadul.. Gua setiap main dapet tim yg total pertandingan nya gaada seribu padahal total pertandingan gua udah puluhan ribu... Tolong Montoon kalo masih mau game lu laris perbaiki lah sistem lu.. Banyak player old yg pensi gara\" Sistem lu yg gk bener... Kalo defeat nya gara\" Kalah mekanik si gapapa lha ini kalah karna dapet tim yg bego kagak ngarti rotasi dll.","sentiment":"negatif","predict":"negatif"},{"text":"SUMPAH KESEL BANGETTT!!Tiap main selalu tiba² keluar sendiri dari apk nya padahal tadinya ga gitu knp skrng sering jadi harus login lagi tapi gabisa keluar terus dan coba login lagi bisa tapi permainan udh selesai akhirnya jadi sering afk sampe kredit skore nya makin turun!","sentiment":"positif","predict":"negatif"},{"text":"tolonglah jangan mengatur permainan sekali menang sekali kalah, itu udh fix di seting dri moonton ,saya pemain sollo cape bngt dapat tim tdk seimbang, saya di satukan dengan tim yg losetrek oleh moonton","sentiment":"netral","predict":"negatif"},{"text":"jujur kecewa bgt sama update an yg sekarang, gua kira hp gua yg mulai ga enak buat main game.. ternyata komen orang lain juga ikut framedrop abis, lag, patah-patah, padahal sinyal lancar bagus, di in game kacau parah.. jadi bikin ga nyaman aja, tolong perubahannya agar tidak terjadi frame parah lagi, apalagi suara robot.","sentiment":"negatif","predict":"negatif"},{"text":"Akhir akhir ini sering ngelag dan ngebug. Plies lah bang, awalnya jaringan nya bagus\" aja tapi pas main mulai dah sinyal jadi ganti warna merah","sentiment":"positif","predict":"negatif"},{"text":"Game nya jelek banget padahal gw udh mau masuk ml keluar jadinya afk lama banget lgi masuk moonton muka kotak jelek amat padahal gw berusaha mau masuk cuman lama terus gw login kok kredit skor nurun sih gw cape cok naikin kredit skor mulu dasar gamenya jelek banget bug terus gw harus classic terus deh jadinya gara² monton tolong gw mau masuk pertandinga. tapi lama terpaksa gw afk nyolot gamenya jelek gw kasih 1 aja deh","sentiment":"negatif","predict":"negatif"},{"text":"Dasar game burik. 😤😤😤😤😤 Dari grand master susah banget masuk ke epic. Apa lagi mau masuk legend. Halah. Mitos. Habisin waktu dan paket aja. 😤😤😤😤😤😤 Main 10 kali menang 2 kali, sisa nya kalah mulu. Montoon gak adil dengan player. 😡😡😡😡😡","sentiment":"positif","predict":"negatif"},{"text":"saya beri bintang 1 dulu Karena setiap dekati musuh kenapa leg,, padahal sinyal nya bagus, Setiap main selalu dikasih tim beban Jadi tolong di perbaiki lagi Kalau sudah bagus baru saya kasih bintang empat...tolonglah montoon kasih tim jangan yg kek bot, season sekarang knp kasih tim yg kek bot, nggak niat main pliss la!!!!!!!!!😠😠😠😠😠😠monton lu knp sih ge udh kalah 7 kali loh dari legend 5 dn kini epik 1 pliss la monton lu cari akun gue z4ky__ udh kasih tim nggak niat tim nggak seimbang plis","sentiment":"positif","predict":"negatif"},{"text":"montoon knp si makin sni makin gjls,update an bagus\" tpi masalah jaringan gjls mulu,msa stiap kali sya main di rank sinyal nya suka tiba\" merah gk bisa nyambung ke game lgi pdhl pas sya lgin game sbelah lancar\" aja,gmn nih montoon utamain jaringan nya dong untuk membuat para pemain biar lebih nyaman dan enak bermain game nya,jngan mlah update an bnyk jaringan nya mkin jelek","sentiment":"negatif","predict":"negatif"},{"text":"Terkadang sinyal buruk dan pembagian tim yang tidak seimbang seperti musuh yang gg dan tim yang tidak kompak membuat gameplay menjadi berat dan sulit dimenangkan","sentiment":"netral","predict":"negatif"},{"text":"Bug nya sangat mengganggu banyak pemain ml bilang kalo ml sekarang ada bug suka keluar sendiri dan saya juga pernah kejadian gitu jadi skor kredit saya kecil tolong di perbaikin","sentiment":"netral","predict":"negatif"},{"text":"Tolong lah Moonton kenapa setiap ganti akun download data lagi, padahal setiap akun sudah saya download data, selang beberapa jam saya ganyi akun lagi suruh download data lagi, sdh 3.5 giga sata pakek internet data HP ... Ayolah perbaiki Saran ya kalau milah tim itu yg bener ... Masak gua dapet tim ampas muluu g ada bener2 nya ... Tolong lah pihak Mobile Legends direktur developer atau apalah d rubah itu yg ampas2 dibedakan yg pro dibedakan ... Jadi males maen kalau kek gini terus","sentiment":"netral","predict":"negatif"},{"text":"Makin kesini makin GK jelas...ntah musuh nge chit atau gimana ..cuma ML yang GK bisa jaringan... aplikasi lain lancar jaya wfi + data.. keluar sendiri GK bisa masuk lagi jaringan stabil heran dah..","sentiment":"netral","predict":"negatif"},{"text":"Gila banyak yang AFK tapi seglperti tidak ada tanggapan dari pihak monton .event aja terus yg di UP server gak di perbaiki.sangat di dayangkan season 29 semakin paraaaaaaaaaah terburuk sinyal makin lag dapat tim junior semua,banyak tim trol .karena stres","sentiment":"netral","predict":"negatif"},{"text":"Game nya jelek banget gue sudah lama main game ini karena apa karena begitu game ini tiba² saja langsung keluar dari aplikasi nya coba tolong di berbaiki mohon sama moonton nya klo gk gw akan tidak mau main game ini lagi","sentiment":"negatif","predict":"negatif"}]